/*
#############################################################################################
# Nether (BETA Patch #7 (64-bit, DX9)) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51->custom
# ========================================================================================= #
# File: NetherGame_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, kokole (64-bit port)
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function NetherGame.NetherDayNightCycleManager.SetKismetTime
// [0x00040003] ( FUNC_Final )
struct ANetherDayNightCycleManager_execSetKismetTime_Parms
{
};

// Function NetherGame.NetherDayNightCycleManager.ClientUpdateWorldTime
// [0x010401C3] ( FUNC_Final )
struct ANetherDayNightCycleManager_execClientUpdateWorldTime_Parms
{
	float                                              InWorldTime;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherDayNightCycleManager.OnTODChanged
// [0x00040003] ( FUNC_Final )
struct ANetherDayNightCycleManager_execOnTODChanged_Parms
{
	// class ANPawnEnemy*                              EnemyPawn;                                        		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function NetherGame.NetherDayNightCycleManager.Tick
// [0x00020102] 
struct ANetherDayNightCycleManager_execTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherDayNightCycleManager.PickDay
// [0x00020002] 
struct ANetherDayNightCycleManager_execPickDay_Parms
{
};

// Function NetherGame.NetherDayNightCycleManager.PostBeginPlay
// [0x00020802] ( FUNC_Event )
struct ANetherDayNightCycleManager_eventPostBeginPlay_Parms
{
};

// Function NetherGame.NetherEngine.FormatTime
// [0x00022002] 
struct UNetherEngine_execFormatTime_Parms
{
	int                                                Seconds;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0004 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// int                                             Hours;                                            		// 0x0014 (0x0004) [0x0000000000000000]              
	// int                                             Mins;                                             		// 0x0018 (0x0004) [0x0000000000000000]              
	// struct FString                                  NewTimeString;                                    		// 0x001C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function NetherGame.NetherEngine.MapFinishedLoading
// [0x00020802] ( FUNC_Event )
struct UNetherEngine_eventMapFinishedLoading_Parms
{
	// class ANetherPlayerController*                  NPC;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
	// class AWorldInfo*                               WI;                                               		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function NetherGame.NetherHUD.KeyDown
// [0x00020002] 
struct ANetherHUD_execKeyDown_Parms
{
	int                                                KeyCode;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.MouseWheel
// [0x00020002] 
struct ANetherHUD_execMouseWheel_Parms
{
	int                                                Delta;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.RightMouseUp
// [0x00020002] 
struct ANetherHUD_execRightMouseUp_Parms
{
	float                                              X;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Y;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.RightMouseDown
// [0x00020002] 
struct ANetherHUD_execRightMouseDown_Parms
{
	float                                              X;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Y;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.LeftMouseUp
// [0x00020002] 
struct ANetherHUD_execLeftMouseUp_Parms
{
	float                                              X;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Y;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.LeftMouseDown
// [0x00020002] 
struct ANetherHUD_execLeftMouseDown_Parms
{
	float                                              X;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Y;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.MouseMoved
// [0x00020002] 
struct ANetherHUD_execMouseMoved_Parms
{
	float                                              X;                                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Y;                                                		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.AS_SetHeaderStyle
// [0x00040003] ( FUNC_Final )
struct ANetherHUD_execAS_SetHeaderStyle_Parms
{
	int                                                FontSize;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     Align;                                            		// 0x0004 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                FontColor;                                        		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.AS_PlayQuickSlotUseAnimation
// [0x00040003] ( FUNC_Final )
struct ANetherHUD_execAS_PlayQuickSlotUseAnimation_Parms
{
	int                                                SlotIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.AS_HideQuickSlots
// [0x00040003] ( FUNC_Final )
struct ANetherHUD_execAS_HideQuickSlots_Parms
{
};

// Function NetherGame.NetherHUD.AS_ShowQuickSlots
// [0x00040003] ( FUNC_Final )
struct ANetherHUD_execAS_ShowQuickSlots_Parms
{
};

// Function NetherGame.NetherHUD.AS_UpdateQuickSlotHudIcon
// [0x00040003] ( FUNC_Final )
struct ANetherHUD_execAS_UpdateQuickSlotHudIcon_Parms
{
	int                                                SlotIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ItemId;                                           		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ItemCount;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.AS_SetHealth
// [0x00040003] ( FUNC_Final )
struct ANetherHUD_execAS_SetHealth_Parms
{
	int                                                currentHealth;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                maxHealth;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.AS_RotateMiniMap
// [0x00040003] ( FUNC_Final )
struct ANetherHUD_execAS_RotateMiniMap_Parms
{
	float                                              Angle;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.AS_SetStaminaBar
// [0x00040003] ( FUNC_Final )
struct ANetherHUD_execAS_SetStaminaBar_Parms
{
	float                                              Percent;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.AS_SetHungerBar
// [0x00040003] ( FUNC_Final )
struct ANetherHUD_execAS_SetHungerBar_Parms
{
	float                                              Percent;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.GetHideChatMessages
// [0x00020002] 
struct ANetherHUD_execGetHideChatMessages_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function NetherGame.NetherHUD.ToggleHideChatMessages
// [0x00020002] 
struct ANetherHUD_execToggleHideChatMessages_Parms
{
	unsigned long                                      bValue : 1;                                       		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function NetherGame.NetherHUD.GetShowChatForNewMessage
// [0x00020002] 
struct ANetherHUD_execGetShowChatForNewMessage_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function NetherGame.NetherHUD.ToggleShowChatForNewMessage
// [0x00020002] 
struct ANetherHUD_execToggleShowChatForNewMessage_Parms
{
	unsigned long                                      bValue : 1;                                       		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function NetherGame.NetherHUD.CloseMenuScreen
// [0x00020002] 
struct ANetherHUD_execCloseMenuScreen_Parms
{
};

// Function NetherGame.NetherHUD.StartClosingMenuScreen
// [0x00020002] 
struct ANetherHUD_execStartClosingMenuScreen_Parms
{
};

// Function NetherGame.NetherHUD.ToggleMenuScreen
// [0x00024003] ( FUNC_Final )
struct ANetherHUD_execToggleMenuScreen_Parms
{
	unsigned char                                      StartingMenu;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bCloseRegardless : 1;                             		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	// class ANetherPlayerController*                  NPC;                                              		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function NetherGame.NetherHUD.SetBloodLevel
// [0x00020002] 
struct ANetherHUD_execSetBloodLevel_Parms
{
	int                                                BloodLevel;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.DecayBloodMeter
// [0x00020002] 
struct ANetherHUD_execDecayBloodMeter_Parms
{
	float                                              Amount;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// float                                           CurrentAmount;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function NetherGame.NetherHUD.SetBloodMeter
// [0x00020002] 
struct ANetherHUD_execSetBloodMeter_Parms
{
	float                                              Amount;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.SetChatHeaderText
// [0x00020003] ( FUNC_Final )
struct ANetherHUD_execSetChatHeaderText_Parms
{
	struct FString                                     HeaderText;                                       		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function NetherGame.NetherHUD.ShowBarterObjectivePopup
// [0x00020202] ( FUNC_Exec )
struct ANetherHUD_execShowBarterObjectivePopup_Parms
{
	struct FString                                     TradeDescription;                                 		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FScriptDelegate                             FunctionToConfirm;                                		// 0x0010 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	class ANInteractiveObject_Barter*                  BarterObject;                                     		// 0x0020 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bPlayerHasItems : 1;                              		// 0x0028 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function NetherGame.NetherHUD.ShowPopupNotification
// [0x00024202] ( FUNC_Exec )
struct ANetherHUD_execShowPopupNotification_Parms
{
	struct FString                                     HeaderText;                                       		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     BodyText;                                         		// 0x0010 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     ButtonText;                                       		// 0x0020 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
};

// Function NetherGame.NetherHUD.ConfirmWithPopup
// [0x00024002] 
struct ANetherHUD_execConfirmWithPopup_Parms
{
	struct FScriptDelegate                             FunctionToConfirm;                                		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FScriptDelegate                             FunctionToDecline;                                		// 0x0010 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     HeaderText;                                       		// 0x0020 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     BodyText;                                         		// 0x0030 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     ConfirmButtonText;                                		// 0x0040 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     CancelButtonText;                                 		// 0x0050 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
};

// Function NetherGame.NetherHUD.ClosePopup
// [0x00020002] 
struct ANetherHUD_execClosePopup_Parms
{
	class UGFxButton*                                  Button;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function NetherGame.NetherHUD.CreatePopup
// [0x00040003] ( FUNC_Final )
struct ANetherHUD_execCreatePopup_Parms
{
};

// Function NetherGame.NetherHUD.ClosePopupByID
// [0x00020002] 
struct ANetherHUD_execClosePopupByID_Parms
{
	unsigned char                                      IDToClose;                                        		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function NetherGame.NetherHUD.OpenMenuScreen
// [0x00020002] 
struct ANetherHUD_execOpenMenuScreen_Parms
{
};

// Function NetherGame.NetherHUD.ToggleCAP
// [0x00020200] ( FUNC_Exec )
struct ANetherHUD_execToggleCAP_Parms
{
};

// Function NetherGame.NetherHUD.ToggleGeneralMenu
// [0x00020202] ( FUNC_Exec )
struct ANetherHUD_execToggleGeneralMenu_Parms
{
};

// Function NetherGame.NetherHUD.ToggleCharacter
// [0x00020202] ( FUNC_Exec )
struct ANetherHUD_execToggleCharacter_Parms
{
};

// Function NetherGame.NetherHUD.ToggleMap
// [0x00020202] ( FUNC_Exec )
struct ANetherHUD_execToggleMap_Parms
{
};

// Function NetherGame.NetherHUD.ToggleInventory
// [0x00020202] ( FUNC_Exec )
struct ANetherHUD_execToggleInventory_Parms
{
};

// Function NetherGame.NetherHUD.DisableHudCursorMode
// [0x00024202] ( FUNC_Exec )
struct ANetherHUD_execDisableHudCursorMode_Parms
{
	unsigned long                                      bForceCloseChat : 1;                              		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function NetherGame.NetherHUD.EnableHudCursorMode
// [0x00020202] ( FUNC_Exec )
struct ANetherHUD_execEnableHudCursorMode_Parms
{
	// class ANetherPlayerController*                  NPC;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function NetherGame.NetherHUD.ToggleHUDCursorMode
// [0x00020202] ( FUNC_Exec )
struct ANetherHUD_execToggleHUDCursorMode_Parms
{
};

// Function NetherGame.NetherHUD.PlayQuickSlotUseAnimation
// [0x00020003] ( FUNC_Final )
struct ANetherHUD_execPlayQuickSlotUseAnimation_Parms
{
	int                                                SlotIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.StopQuickSlotFillUpAnimation
// [0x00024003] ( FUNC_Final )
struct ANetherHUD_execStopQuickSlotFillUpAnimation_Parms
{
	int                                                SlotIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      SkipAnimation : 1;                                		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function NetherGame.NetherHUD.StartQuickSlotFillUpAnimation
// [0x00020003] ( FUNC_Final )
struct ANetherHUD_execStartQuickSlotFillUpAnimation_Parms
{
	int                                                SlotIndex;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Duration;                                         		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.DisplayObjectiveInfo
// [0x00020102] 
struct ANetherHUD_execDisplayObjectiveInfo_Parms
{
	class ANetherPawn*                                 NPawn;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.DisplayHealth
// [0x00020102] 
struct ANetherHUD_execDisplayHealth_Parms
{
	class ANetherPawn*                                 NPawn;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.DisplayStamina
// [0x00020102] 
struct ANetherHUD_execDisplayStamina_Parms
{
	class ANetherPawn*                                 NPawn;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// int                                             StaminaPercent;                                   		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function NetherGame.NetherHUD.StopPickupTimer
// [0x00020102] 
struct ANetherHUD_execStopPickupTimer_Parms
{
	unsigned long                                      bSkipAnimation : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function NetherGame.NetherHUD.StartPickupTimer
// [0x00020102] 
struct ANetherHUD_execStartPickupTimer_Parms
{
	float                                              Duration;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class AInventory*                                  Inv;                                              		// 0x0004 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.ClearPickupPrompt
// [0x00020102] 
struct ANetherHUD_execClearPickupPrompt_Parms
{
};

// Function NetherGame.NetherHUD.DisplayPickupPrompt
// [0x00020102] 
struct ANetherHUD_execDisplayPickupPrompt_Parms
{
	struct FString                                     ActionText;                                       		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function NetherGame.NetherHUD.DisplayHunger
// [0x00020102] 
struct ANetherHUD_execDisplayHunger_Parms
{
	class ANetherPawn*                                 NPawn;                                            		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// int                                             HungerPercent;                                    		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function NetherGame.NetherHUD.DisplayAmmo
// [0x00020102] 
struct ANetherHUD_execDisplayAmmo_Parms
{
	class ANWeap*                                      Weapon;                                           		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	// class ANWeapRanged*                             NRangedWeap;                                      		// 0x0008 (0x0008) [0x0000000000000000]              
};

// Function NetherGame.NetherHUD.HideHUD
// [0x00020002] 
struct ANetherHUD_execHideHUD_Parms
{
};

// Function NetherGame.NetherHUD.ShowHUD
// [0x00020002] 
struct ANetherHUD_execShowHUD_Parms
{
};

// Function NetherGame.NetherHUD.HideQuickSlots
// [0x00020102] 
struct ANetherHUD_execHideQuickSlots_Parms
{
};

// Function NetherGame.NetherHUD.ShowQuickSlots
// [0x00024102] 
struct ANetherHUD_execShowQuickSlots_Parms
{
	unsigned long                                      bAutoHide : 1;                                    		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function NetherGame.NetherHUD.RefreshPlayerList
// [0x00020002] 
struct ANetherHUD_execRefreshPlayerList_Parms
{
	// class APlayerReplicationInfo*                   PRI;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
	// struct FString                                  PlayerListString;                                 		// 0x0008 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// int                                             NumPlayers;                                       		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function NetherGame.NetherHUD.SubmitInputText
// [0x00020002] 
struct ANetherHUD_execSubmitInputText_Parms
{
	// struct FString                                  InputText;                                        		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function NetherGame.NetherHUD.RefreshQuickSlotIcons
// [0x00020102] 
struct ANetherHUD_execRefreshQuickSlotIcons_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	// int                                             NumQuickSlots;                                    		// 0x0004 (0x0004) [0x0000000000000000]              
	// class ANetherInventoryManager*                  NInvManager;                                      		// 0x0008 (0x0008) [0x0000000000000000]              
	// class ANetherPlayerController*                  NPC;                                              		// 0x0010 (0x0008) [0x0000000000000000]              
	// class ANetherPawn*                              NPawn;                                            		// 0x0018 (0x0008) [0x0000000000000000]              
	// class AInventory*                               Inv;                                              		// 0x0020 (0x0008) [0x0000000000000000]              
};

// Function NetherGame.NetherHUD.DrawPlayerHUD
// [0x00020003] ( FUNC_Final )
struct ANetherHUD_execDrawPlayerHUD_Parms
{
	// class ANetherPlayerController*                  NPC;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
	// class ANetherPawn*                              NPawn;                                            		// 0x0008 (0x0008) [0x0000000000000000]              
	// float                                           RadarRotation;                                    		// 0x0010 (0x0004) [0x0000000000000000]              
	// class ANWeap*                                   NWeapon;                                          		// 0x0014 (0x0008) [0x0000000000000000]              
};

// Function NetherGame.NetherHUD.DrawHUD
// [0x00020102] 
struct ANetherHUD_execDrawHUD_Parms
{
};

// Function NetherGame.NetherHUD.DrawCrosshair
// [0x00820102] 
struct ANetherHUD_execDrawCrosshair_Parms
{
	float                                              Scale;                                            		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FASDisplayInfo                           CrosshairDI;                                      		// 0x0004 (0x002C) [0x0000000000000000]              
};

// Function NetherGame.NetherHUD.ClearHeaderText
// [0x00020302] ( FUNC_Exec )
struct ANetherHUD_execClearHeaderText_Parms
{
};

// Function NetherGame.NetherHUD.SetHeaderText
// [0x00024302] ( FUNC_Exec )
struct ANetherHUD_execSetHeaderText_Parms
{
	struct FString                                     Text;                                             		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                FontSize;                                         		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                FontColor;                                        		// 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function NetherGame.NetherHUD.HideMessageWindow
// [0x00020002] 
struct ANetherHUD_execHideMessageWindow_Parms
{
};

// Function NetherGame.NetherHUD.PostMessageToWindow
// [0x00024202] ( FUNC_Exec )
struct ANetherHUD_execPostMessageToWindow_Parms
{
	struct FString                                     Message;                                          		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                HexColor;                                         		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	// class ANetherPawn*                              NPlayer;                                          		// 0x0014 (0x0008) [0x0000000000000000]              
};

// Function NetherGame.NetherHUD.Message
// [0x00024002] 
struct ANetherHUD_execMessage_Parms
{
	class APlayerReplicationInfo*                      PRI;                                              		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     msg;                                              		// 0x0008 (0x0010) [0x0000000000400880]              ( CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink )
	struct FName                                       MsgType;                                          		// 0x0018 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              Lifetime;                                         		// 0x0020 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	// struct FString                                  ThePlayerName;                                    		// 0x0024 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function NetherGame.NetherHUD.ToggleChatFade
// [0x00020002] 
struct ANetherHUD_execToggleChatFade_Parms
{
};

// Function NetherGame.NetherHUD.DisplayConsoleMessages
// [0x00020000] 
struct ANetherHUD_execDisplayConsoleMessages_Parms
{
};

// Function NetherGame.NetherHUD.DisplayLocalMessages
// [0x00020000] 
struct ANetherHUD_execDisplayLocalMessages_Parms
{
};

// Function NetherGame.NetherHUD.PostNote
// [0x00020B02] ( FUNC_Exec | FUNC_Event )
struct ANetherHUD_execPostNote_Parms
{
	struct FString                                     Text;                                             		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	float                                              NoteTime;                                         		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherHUD.PostBigMessage
// [0x00024B02] ( FUNC_Exec | FUNC_Event )
struct ANetherHUD_execPostBigMessage_Parms
{
	struct FString                                     Text;                                             		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bShowImmediately : 1;                             		// 0x0010 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bShowOnlyIfUnique : 1;                            		// 0x0014 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	float                                              Width;                                            		// 0x0018 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              Duration;                                         		// 0x001C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bClearQueue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function NetherGame.NetherHUD.PostNotification
// [0x00024B02] ( FUNC_Exec | FUNC_Event )
struct ANetherHUD_execPostNotification_Parms
{
	struct FString                                     Text;                                             		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      bShowImmediately : 1;                             		// 0x0010 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bShowOnlyIfUnique : 1;                            		// 0x0014 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function NetherGame.NetherHUD.PostMessage
// [0x00024B02] ( FUNC_Exec | FUNC_Event )
struct ANetherHUD_execPostMessage_Parms
{
	struct FString                                     Text;                                             		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	float                                              Duration;                                         		// 0x0010 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                PosX;                                             		// 0x0014 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                PosY;                                             		// 0x0018 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                FontSize;                                         		// 0x001C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FString                                     Align;                                            		// 0x0020 (0x0010) [0x0000000000400090]              ( CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink )
	int                                                FontColor;                                        		// 0x0030 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bShowImmediately : 1;                             		// 0x0034 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bShowOnlyIfUnique : 1;                            		// 0x0038 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	float                                              Width;                                            		// 0x003C (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      bClearQueue : 1;                                  		// 0x0040 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
};

// Function NetherGame.NetherHUD.InitializePlayerHUD
// [0x00020003] ( FUNC_Final )
struct ANetherHUD_execInitializePlayerHUD_Parms
{
};

// Function NetherGame.NetherHUD.PostBeginPlay
// [0x00020102] 
struct ANetherHUD_execPostBeginPlay_Parms
{
};

// Function NetherGame.NetherPlayerControllerBase.Debug_DeleteServerDocs
// [0x002200C3] ( FUNC_Final )
struct ANetherPlayerControllerBase_execDebug_DeleteServerDocs_Parms
{
	// class UOnlineSubsystemNether*                   OSS;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function NetherGame.NetherPlayerControllerBase.DebugDeleteServerDocs
// [0x00020202] ( FUNC_Exec )
struct ANetherPlayerControllerBase_execDebugDeleteServerDocs_Parms
{
};

// Function NetherGame.NetherPlayerControllerBase.ShouldDeleteServerDocsOnStartup
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct ANetherPlayerControllerBase_execShouldDeleteServerDocsOnStartup_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function NetherGame.NetherPlayerControllerBase.ClientLoggedIn
// [0x010201C0] 
struct ANetherPlayerControllerBase_execClientLoggedIn_Parms
{
};

// Function NetherGame.NetherServerDocument.ClearAsyncOps
// [0x00020400] ( FUNC_Native )
struct ANetherServerDocument_execClearAsyncOps_Parms
{
};

// Function NetherGame.NetherServerDocument.GetDocumentTags
// [0x00420802] ( FUNC_Event )
struct ANetherServerDocument_eventGetDocumentTags_Parms
{
	TArray< struct FString >                           DocumentTags;                                     		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function NetherGame.NetherServerDocument.OnDocumentUpdate
// [0x00020802] ( FUNC_Event )
struct ANetherServerDocument_eventOnDocumentUpdate_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// class UOnlineSubsystemNether*                   OSS;                                              		// 0x0004 (0x0008) [0x0000000000000000]              
};

// Function NetherGame.NetherServerDocument.OnDocumentCreate
// [0x00020802] ( FUNC_Event )
struct ANetherServerDocument_eventOnDocumentCreate_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function NetherGame.NetherServerDocument.PostBeginPlay
// [0x00020802] ( FUNC_Event )
struct ANetherServerDocument_eventPostBeginPlay_Parms
{
	// class UOnlineSubsystemNether*                   OSS;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function NetherGame.NetherServerDocument.ResetToDefault
// [0x00020000] 
struct ANetherServerDocument_execResetToDefault_Parms
{
};

// Function NetherGame.NetherServerDocument.AutoSaveDocument
// [0x00020003] ( FUNC_Final )
struct ANetherServerDocument_execAutoSaveDocument_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function NetherGame.NetherServerDocument.SafeToSave
// [0x00020002] 
struct ANetherServerDocument_execSafeToSave_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function NetherGame.NetherServerDocument.ShouldAutoSaveDocument
// [0x00020002] 
struct ANetherServerDocument_execShouldAutoSaveDocument_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function NetherGame.NetherServerDocument.SaveDocument
// [0x00020002] 
struct ANetherServerDocument_execSaveDocument_Parms
{
	// class UOnlineSubsystemNether*                   OSS;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function NetherGame.NetherServerDocument.Destroyed
// [0x00020902] ( FUNC_Event )
struct ANetherServerDocument_eventDestroyed_Parms
{
};

// Function NetherGame.NetherServerDocument.GetDocumentName
// [0x00020802] ( FUNC_Event )
struct ANetherServerDocument_eventGetDocumentName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function NetherGame.NetherServerDocumentClassOverride.GetDocumentTags
// [0x00420802] ( FUNC_Event )
struct ANetherServerDocumentClassOverride_eventGetDocumentTags_Parms
{
	TArray< struct FString >                           DocumentTags;                                     		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function NetherGame.NetherServerDocumentClassOverride.SaveDocument
// [0x00020000] 
struct ANetherServerDocumentClassOverride_execSaveDocument_Parms
{
};

// Function NetherGame.NetherServerDocumentClassOverride.OnDocumentUpdate
// [0x00020800] ( FUNC_Event )
struct ANetherServerDocumentClassOverride_eventOnDocumentUpdate_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function NetherGame.NetherServerDocumentClassOverride.UpdateDocumentTimer
// [0x00020002] 
struct ANetherServerDocumentClassOverride_execUpdateDocumentTimer_Parms
{
	// class UOnlineSubsystemNether*                   OSS;                                              		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function NetherGame.NetherServerDocumentClassOverride.SyncDocumentToServer
// [0x00020000] 
struct ANetherServerDocumentClassOverride_execSyncDocumentToServer_Parms
{
};

// Function NetherGame.NetherServerDocumentClassOverride.PostBeginPlay
// [0x00020802] ( FUNC_Event )
struct ANetherServerDocumentClassOverride_eventPostBeginPlay_Parms
{
};

// Function NetherGame.NetherServerDocumentClassOverride.GetDocumentName
// [0x00020802] ( FUNC_Event )
struct ANetherServerDocumentClassOverride_eventGetDocumentName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function NetherGame.NetherServerPlayerDocument.GetDocumentTags
// [0x00420802] ( FUNC_Event )
struct ANetherServerPlayerDocument_eventGetDocumentTags_Parms
{
	TArray< struct FString >                           DocumentTags;                                     		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function NetherGame.NetherServerPlayerDocument.GetDocumentName
// [0x00020802] ( FUNC_Event )
struct ANetherServerPlayerDocument_eventGetDocumentName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function NetherGame.NetherServerPlayerDocument.PostBeginPlay
// [0x00020802] ( FUNC_Event )
struct ANetherServerPlayerDocument_eventPostBeginPlay_Parms
{
	// class ANetherPlayerController*                  OwningPC;                                         		// 0x0000 (0x0008) [0x0000000000000000]              
};

// Function NetherGame.NetherServerPlayerDocument.Tick
// [0x00020902] ( FUNC_Event )
struct ANetherServerPlayerDocument_eventTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NetherServerPlayerDocument.PreAutosave
// [0x00020000] 
struct ANetherServerPlayerDocument_execPreAutosave_Parms
{
};

// Function NetherGame.NetherServerPlayerDocument.OnDocumentUpdate
// [0x00020802] ( FUNC_Event )
struct ANetherServerPlayerDocument_eventOnDocumentUpdate_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function NetherGame.NetherServerPlayerDocument.OnDocumentCreate
// [0x00020802] ( FUNC_Event )
struct ANetherServerPlayerDocument_eventOnDocumentCreate_Parms
{
	unsigned long                                      bWasSuccessful : 1;                               		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	// class UOnlineSubsystemNether*                   OSS;                                              		// 0x0004 (0x0008) [0x0000000000000000]              
};

// Function NetherGame.NetherServerPlayerDocument.InitForPlayer
// [0x00020002] 
struct ANetherServerPlayerDocument_execInitForPlayer_Parms
{
	class ANetherPlayerController*                     PC;                                               		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                CharacterIndex;                                   		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NThrownObject.OnLifeExpired
// [0x00020002] 
struct ANThrownObject_execOnLifeExpired_Parms
{
};

// Function NetherGame.NThrownObject.Tick
// [0x00020902] ( FUNC_Event )
struct ANThrownObject_eventTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NThrownObject.SetInitialState
// [0x00820902] ( FUNC_Event )
struct ANThrownObject_eventSetInitialState_Parms
{
	// struct FVector                                  TossVel;                                          		// 0x0000 (0x000C) [0x0000000000000000]              
};

// Function NetherGame.NThrownObject_AOEGrenadeBase.GetAllPawns
// [0x00020401] ( FUNC_Final | FUNC_Native )
struct ANThrownObject_AOEGrenadeBase_execGetAllPawns_Parms
{
	float                                              GrenadeRadius;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	TArray< struct FHitPawn >                          ReturnValue;                                      		// 0x0004 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function NetherGame.NThrownObject_AOEGrenadeBase.ExplosionFX
// [0x00020102] 
struct ANThrownObject_AOEGrenadeBase_execExplosionFX_Parms
{
};

// Function NetherGame.NThrownObject_AOEGrenadeBase.AreaEffect
// [0x00020000] 
struct ANThrownObject_AOEGrenadeBase_execAreaEffect_Parms
{
	struct FHitPawn                                    InHitPawn;                                        		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NThrownObject_AOEGrenadeBase.CheckGrenadeLOS
// [0x00020002] 
struct ANThrownObject_AOEGrenadeBase_execCheckGrenadeLOS_Parms
{
	class APawn*                                       PawnToCheck;                                      		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function NetherGame.NThrownObject_AOEGrenadeBase.ExplosionAOE
// [0x00820002] 
struct ANThrownObject_AOEGrenadeBase_execExplosionAOE_Parms
{
	// TArray< struct FHitPawn >                       HitPawns;                                         		// 0x0000 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// struct FHitPawn                                 TempHitPawn;                                      		// 0x0010 (0x000C) [0x0000000000000000]              
};

// Function NetherGame.NThrownObject_AOEGrenadeBase.Tick
// [0x00020902] ( FUNC_Event )
struct ANThrownObject_AOEGrenadeBase_eventTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NThrownObject_AOEGrenadeBase.ReplicatedEvent
// [0x00020902] ( FUNC_Event )
struct ANThrownObject_AOEGrenadeBase_eventReplicatedEvent_Parms
{
	struct FName                                       VarName;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.NThrownObject_AOEGrenadeBase.SetInitialState
// [0x00020902] ( FUNC_Event )
struct ANThrownObject_AOEGrenadeBase_eventSetInitialState_Parms
{
};

// Function NetherGame.OnlineAuthInterfaceNether.VerifySteamClientAuthSession
// [0x00020400] ( FUNC_Native )
struct UOnlineAuthInterfaceNether_execVerifySteamClientAuthSession_Parms
{
	struct FUniqueNetId                                ClientUID;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                ClientIP;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ClientPort;                                       		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                AuthTicketUID;                                    		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function NetherGame.OnlineAuthInterfaceNether.VerifyClientAuthSession
// [0x00020400] ( FUNC_Native )
struct UOnlineAuthInterfaceNether_execVerifyClientAuthSession_Parms
{
	struct FUniqueNetId                                ClientUID;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                ClientIP;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ClientPort;                                       		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                AuthTicketUID;                                    		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function NetherGame.OnlineAuthInterfaceNether.CreateClientAuthSession
// [0x00420400] ( FUNC_Native )
struct UOnlineAuthInterfaceNether_execCreateClientAuthSession_Parms
{
	struct FUniqueNetId                                ServerUID;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	int                                                ServerIP;                                         		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ServerPort;                                       		// 0x000C (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      bSecure : 1;                                      		// 0x0010 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	int                                                OutAuthTicketUID;                                 		// 0x0014 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function NetherGame.OnlineSubsystemNether.GetCurrentUTCTime
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemNether_execGetCurrentUTCTime_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function NetherGame.OnlineSubsystemNether.GetSecondsFromTimeString
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemNether_execGetSecondsFromTimeString_Parms
{
	struct FString                                     TimeString;                                       		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function NetherGame.OnlineSubsystemNether.Mber_GetData
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemNether_execMber_GetData_Parms
{
	class ANetherServerDocument*                       Data;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.OnlineSubsystemNether.Mber_ClientGetAuthToken
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemNether_execMber_ClientGetAuthToken_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function NetherGame.OnlineSubsystemNether.Mber_ClientLogin
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemNether_execMber_ClientLogin_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function NetherGame.OnlineSubsystemNether.Mber_ServerList
// [0x00420400] ( FUNC_Native )
struct UOnlineSubsystemNether_execMber_ServerList_Parms
{
	TArray< struct FServerDesc >                       ServerListArray;                                  		// 0x0000 (0x0010) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function NetherGame.OnlineSubsystemNether.Mber_ServerHeartbeat
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemNether_execMber_ServerHeartbeat_Parms
{
	float                                              ServerTick;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.OnlineSubsystemNether.Mber_ServerRegister
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemNether_execMber_ServerRegister_Parms
{
};

// Function NetherGame.OnlineSubsystemNether.Mber_ServerBanPlayer
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemNether_execMber_ServerBanPlayer_Parms
{
	struct FString                                     PlayerID;                                         		// 0x0000 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function NetherGame.OnlineSubsystemNether.Mber_ServerCleanupPlayer
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemNether_execMber_ServerCleanupPlayer_Parms
{
	class ANetherPlayerController*                     PC;                                               		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.OnlineSubsystemNether.Mber_ServerSpendGoldFor
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemNether_execMber_ServerSpendGoldFor_Parms
{
	class ANetherPlayerController*                     PC;                                               		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     Reason;                                           		// 0x0008 (0x0010) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                AmountSpent;                                      		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.OnlineSubsystemNether.Mber_ServerUpdateGoldAmount
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemNether_execMber_ServerUpdateGoldAmount_Parms
{
	class ANetherPlayerController*                     PC;                                               		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.OnlineSubsystemNether.Mber_ServerDeleteServerDocs
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemNether_execMber_ServerDeleteServerDocs_Parms
{
	class ANetherPlayerControllerBase*                 PC;                                               		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.OnlineSubsystemNether.Mber_ServerAuthorizePlayer
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemNether_execMber_ServerAuthorizePlayer_Parms
{
	class ANetherPlayerControllerBase*                 PC;                                               		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function NetherGame.OnlineSubsystemNether.Mber_ServerCreateData
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemNether_execMber_ServerCreateData_Parms
{
	class ANetherServerDocument*                       Data;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.OnlineSubsystemNether.Mber_ServerWriteData
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemNether_execMber_ServerWriteData_Parms
{
	class ANetherServerDocument*                       Data;                                             		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function NetherGame.OnlineSubsystemNether.Mber_ServerLogin
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemNether_execMber_ServerLogin_Parms
{
};

// Function NetherGame.OnlineSubsystemNether.CreateAuthInterface
// [0x00020400] ( FUNC_Native )
struct UOnlineSubsystemNether_execCreateAuthInterface_Parms
{
	class UOnlineAuthInterfaceSteamworks*              ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function NetherGame.NetherAnimBlendByAggro.GetAggroDirection
// [0x00820003] ( FUNC_Final )
struct UNetherAnimBlendByAggro_execGetAggroDirection_Parms
{
	struct FVector                                     AttackerDir;                                      		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      ReturnValue;                                      		// 0x000C (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector                                  OwnerFacingDir;                                   		// 0x0010 (0x000C) [0x0000000000000000]              
	// unsigned char                                   AggroDir;                                         		// 0x001C (0x0001) [0x0000000000000000]              
	// float                                           Angle_Front;                                      		// 0x0020 (0x0004) [0x0000000000000000]              
	// float                                           Angle_Left;                                       		// 0x0024 (0x0004) [0x0000000000000000]              
	// float                                           Angle_Back;                                       		// 0x0028 (0x0004) [0x0000000000000000]              
	// float                                           Angle_Right;                                      		// 0x002C (0x0004) [0x0000000000000000]              
	// float                                           Angle_Smallest;                                   		// 0x0030 (0x0004) [0x0000000000000000]              
};

