/*
#############################################################################################
# Nether (BETA Patch #7 (64-bit, DX9)) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51->custom
# ========================================================================================= #
# File: NetherGame_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, kokole (64-bit port)
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_CHAR_SLOTS_MAX                                     1
#define CONST_OptionBoxSpacing                                   35
#define CONST_DROP_DOWN_BUTTON_OFFSET                            -15
#define CONST_NumMessages                                        10
#define CONST_ScaleInSpeed                                       2
#define CONST_MAX_MESSAGE_COUNT                                  40
#define CONST_SelectionIndicatorXOffset                          15

// Enum NetherGame.NetherDataTypes.ENetherPlayerPosture
/*enum ENetherPlayerPosture
{
	NPP_Stand                                          = 0,
	NPP_Sprint                                         = 1,
	NPP_Crouch                                         = 2,
	NPP_Crawl                                          = 3,
	NPP_MAX                                            = 4
};*/

// Enum NetherGame.GFxAnimatedObject.NetherAnimationState
/*enum NetherAnimationState
{
	NAS_PlayingShow                                    = 0,
	NAS_PlayingHide                                    = 1,
	NAS_Showing                                        = 2,
	NAS_Hidden                                         = 3,
	NAS_MAX                                            = 4
};*/

// Enum NetherGame.NetherMoviePlayer.NetherClickLayer
/*enum NetherClickLayer
{
	NCL_Bottom                                         = 0,
	NCL_Middle                                         = 1,
	NCL_Top                                            = 2,
	NCL_MAX                                            = 3
};*/

// Enum NetherGame.NetherMoviePlayer.NetherMoviePriority
/*enum NetherMoviePriority
{
	NMP_Low                                            = 0,
	NMP_Medium                                         = 1,
	NMP_High                                           = 2,
	NMP_ExtraHigh                                      = 3,
	NMP_MAX                                            = 4
};*/

// Enum NetherGame.NetherPlayerController.eDebugPointColor
/*enum eDebugPointColor
{
	DPC_Red                                            = 0,
	DPC_Yellow                                         = 1,
	DPC_Green                                          = 2,
	DPC_Cyan                                           = 3,
	DPC_Blue                                           = 4,
	DPC_Magenta                                        = 5,
	DPC_White                                          = 6,
	DPC_MAX                                            = 7
};*/

// Enum NetherGame.NetherServerScreenUI.EQueryCompletionAction
/*enum EQueryCompletionAction
{
	QUERYACTION_None                                   = 0,
	QUERYACTION_Default                                = 1,
	QUERYACTION_CloseScene                             = 2,
	QUERYACTION_JoinServer                             = 3,
	QUERYACTION_RefreshAll                             = 4,
	QUERYACTION_MAX                                    = 5
};*/

// Enum NetherGame.NetherSettingsUI.NETHER_WIDGET_TYPE
/*enum NETHER_WIDGET_TYPE
{
	NWT_DropDown                                       = 0,
	NWT_CheckBox                                       = 1,
	NWT_Slider                                         = 2,
	NWT_MAX                                            = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class NetherGame.NetherDataTypes
// 0x0000 (0x0060 - 0x0060)
class UNetherDataTypes : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1982 ];

		return pClassPointer;
	};

};

UClass* UNetherDataTypes::pClassPointer = NULL;

// Class NetherGame.NetherDayNightCycleManager
// 0x0038 (0x02C4 - 0x028C)
class ANetherDayNightCycleManager : public AActor
{
public:
	float                                              ClientUpdateInterval_Current;                     		// 0x028C (0x0004) [0x0000000000000000]              
	float                                              ClientUpdateInterval_Max;                         		// 0x0290 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              PlayRateDay;                                      		// 0x0294 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              PlayRateNight;                                    		// 0x0298 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              CurrentPlayRate;                                  		// 0x029C (0x0004) [0x0000000000000000]              
	float                                              CurrentWorldTime;                                 		// 0x02A0 (0x0004) [0x0000000000000000]              
	unsigned char                                      CurrentTimeState;                                 		// 0x02A4 (0x0001) [0x0000000000000000]              
	float                                              RealtimePlayRate;                                 		// 0x02A8 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              AnimDayLength;                                    		// 0x02AC (0x0004) [0x0000000000000002]              ( CPF_Const )
	int                                                AnimDayCount;                                     		// 0x02B0 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              DaytimeStart;                                     		// 0x02B4 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              DaytimeEnd;                                       		// 0x02B8 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              TimeOffset;                                       		// 0x02BC (0x0004) [0x0000000000000000]              
	int                                                CurrentDay;                                       		// 0x02C0 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1983 ];

		return pClassPointer;
	};

	void SetKismetTime ( );
	void ClientUpdateWorldTime ( float InWorldTime );
	void OnTODChanged ( );
	void Tick ( float DeltaTime );
	void PickDay ( );
	void eventPostBeginPlay ( );
};

UClass* ANetherDayNightCycleManager::pClassPointer = NULL;

// Class NetherGame.NetherEngine
// 0x0004 (0x0AC0 - 0x0ABC)
class UNetherEngine : public UGameEngine
{
public:
	unsigned long                                      bEnableStartScreen : 1;                           		// 0x0ABC (0x0004) [0x0000000000004000] [0x00000001] ( CPF_Config )
	unsigned long                                      bMapFinishedLoading : 1;                          		// 0x0ABC (0x0004) [0x0000000000000000] [0x00000002] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1984 ];

		return pClassPointer;
	};

	struct FString FormatTime ( int Seconds );
	void eventMapFinishedLoading ( );
};

UClass* UNetherEngine::pClassPointer = NULL;

// Class NetherGame.NetherHUD
// 0x0194 (0x0740 - 0x05AC)
class ANetherHUD : public AHUD
{
public:
	class UNetherMoviePlayer*                          HudMovie;                                         		// 0x05AC (0x0008) [0x0000000000000000]              
	class UNetherInputOverlayUI*                       InputOverlay;                                     		// 0x05B4 (0x0008) [0x0000000000000000]              
	class UNetherPopupUI*                              PopupMovie;                                       		// 0x05BC (0x0008) [0x0000000000000000]              
	class UNetherMenuOverlayUI*                        MenuScreen;                                       		// 0x05C4 (0x0008) [0x0000000000000000]              
	struct FString                                     HeaderString;                                     		// 0x05CC (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UGFxObject*                                  AmmoBar;                                          		// 0x05DC (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  StaminaBar;                                       		// 0x05E4 (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  HungerBar;                                        		// 0x05EC (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  WeaponNameText;                                   		// 0x05F4 (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  MessageBoxText;                                   		// 0x05FC (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  MessageBoxMask;                                   		// 0x0604 (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  QuickSlotGroup;                                   		// 0x060C (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  BloodLevelText;                                   		// 0x0614 (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  HealthText;                                       		// 0x061C (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  ClipAmmoText;                                     		// 0x0624 (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  ReserveAmmoText;                                  		// 0x062C (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  ObjectiveInfoText;                                		// 0x0634 (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  HudHeaderText;                                    		// 0x063C (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  PickupPromptText;                                 		// 0x0644 (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  PlayerListText;                                   		// 0x064C (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  crosshair;                                        		// 0x0654 (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  ProneIcon;                                        		// 0x065C (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  CrouchIcon;                                       		// 0x0664 (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  PlayersText;                                      		// 0x066C (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  ChatHeader;                                       		// 0x0674 (0x0008) [0x0000000000000000]              
	class UGFxObject*                                  BloodMeterWrapper;                                		// 0x067C (0x0008) [0x0000000000000000]              
	class UGFxAnimatedObject*                          PlayerList;                                       		// 0x0684 (0x0008) [0x0000000000000000]              
	class UGFxMessageBox*                              MessageBox;                                       		// 0x068C (0x0008) [0x0000000000000000]              
	class UGFxMessageBox*                              MessageBox2;                                      		// 0x0694 (0x0008) [0x0000000000000000]              
	class UGFxMessageWindow*                           MessageWindow;                                    		// 0x069C (0x0008) [0x0000000000000000]              
	class UGFxScrollWindow*                            PlayerListWindow;                                 		// 0x06A4 (0x0008) [0x0000000000000000]              
	class UGFxCircleMeter*                             PickupMeter;                                      		// 0x06AC (0x0008) [0x0000000000000000]              
	class UGFxCircleMeter*                             QuickSlot0Meter;                                  		// 0x06B4 (0x0008) [0x0000000000000000]              
	class UGFxCircleMeter*                             QuickSlot1Meter;                                  		// 0x06BC (0x0008) [0x0000000000000000]              
	class UGFxCircleMeter*                             QuickSlot2Meter;                                  		// 0x06C4 (0x0008) [0x0000000000000000]              
	class UGFxCircleMeter*                             QuickSlot3Meter;                                  		// 0x06CC (0x0008) [0x0000000000000000]              
	class UGFxHitIndicator*                            HitIndicator;                                     		// 0x06D4 (0x0008) [0x0000000000000000]              
	class UGFxBarMeter*                                BloodMeter;                                       		// 0x06DC (0x0008) [0x0000000000000000]              
	class UGFxRadar*                                   Radar;                                            		// 0x06E4 (0x0008) [0x0000000000000000]              
	class ANameTagManager*                             NameTagManager;                                   		// 0x06EC (0x0008) [0x0000000000000000]              
	TArray< class UGFxCircleMeter* >                   QuickSlotMeters;                                  		// 0x06F4 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              QuickSlotsHideTime;                               		// 0x0704 (0x0004) [0x0000000000000000]              
	unsigned long                                      bQuickSlotAutoHide : 1;                           		// 0x0708 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bShowChatForNewMessage : 1;                       		// 0x0708 (0x0004) [0x0000000000004000] [0x00000002] ( CPF_Config )
	unsigned long                                      bHideChatMessages : 1;                            		// 0x0708 (0x0004) [0x0000000000004000] [0x00000004] ( CPF_Config )
	unsigned long                                      bPlayingShowMessageAnimation : 1;                 		// 0x0708 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bPlayingClearMessageAnimation : 1;                		// 0x0708 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bHudShowing : 1;                                  		// 0x0708 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bCursorModeEnabled : 1;                           		// 0x0708 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      bChatWindowAlwaysShow : 1;                        		// 0x0708 (0x0004) [0x0000000000000000] [0x00000080] 
	float                                              ChatWindowHideTime;                               		// 0x070C (0x0004) [0x0000000000000000]              
	float                                              TimerFadeSpeed;                                   		// 0x0710 (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FColor                                      BlackColor;                                       		// 0x0714 (0x0004) [0x0000000000000002]              ( CPF_Const )
	class UAkEvent*                                    UIBackSound;                                      		// 0x0718 (0x0008) [0x0000000000000002]              ( CPF_Const )
	class UAkEvent*                                    UISelectSound;                                    		// 0x0720 (0x0008) [0x0000000000000002]              ( CPF_Const )
	class UAkEvent*                                    UIConfirmSound;                                   		// 0x0728 (0x0008) [0x0000000000000002]              ( CPF_Const )
	struct FString                                     PlayersString;                                    		// 0x0730 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1985 ];

		return pClassPointer;
	};

	void KeyDown ( int KeyCode );
	void MouseWheel ( int Delta );
	void RightMouseUp ( float X, float Y );
	void RightMouseDown ( float X, float Y );
	void LeftMouseUp ( float X, float Y );
	void LeftMouseDown ( float X, float Y );
	void MouseMoved ( float X, float Y );
	void AS_SetHeaderStyle ( int FontSize, struct FString Align, int FontColor );
	void AS_PlayQuickSlotUseAnimation ( int SlotIndex );
	void AS_HideQuickSlots ( );
	void AS_ShowQuickSlots ( );
	void AS_UpdateQuickSlotHudIcon ( int SlotIndex, int ItemId, int ItemCount );
	void AS_SetHealth ( int currentHealth, int maxHealth );
	void AS_RotateMiniMap ( float Angle );
	void AS_SetStaminaBar ( float Percent );
	void AS_SetHungerBar ( float Percent );
	bool GetHideChatMessages ( );
	void ToggleHideChatMessages ( unsigned long bValue );
	bool GetShowChatForNewMessage ( );
	void ToggleShowChatForNewMessage ( unsigned long bValue );
	void CloseMenuScreen ( );
	void StartClosingMenuScreen ( );
	void ToggleMenuScreen ( unsigned char StartingMenu, unsigned long bCloseRegardless );
	void SetBloodLevel ( int BloodLevel );
	void DecayBloodMeter ( float Amount );
	void SetBloodMeter ( float Amount );
	void SetChatHeaderText ( struct FString HeaderText );
	void ShowBarterObjectivePopup ( struct FString TradeDescription, struct FScriptDelegate FunctionToConfirm, class ANInteractiveObject_Barter* BarterObject, unsigned long bPlayerHasItems );
	void ShowPopupNotification ( struct FString HeaderText, struct FString BodyText, struct FString ButtonText );
	void ConfirmWithPopup ( struct FScriptDelegate FunctionToConfirm, struct FScriptDelegate FunctionToDecline, struct FString HeaderText, struct FString BodyText, struct FString ConfirmButtonText, struct FString CancelButtonText );
	int ClosePopup ( class UGFxButton* Button );
	void CreatePopup ( );
	bool ClosePopupByID ( unsigned char IDToClose );
	void OpenMenuScreen ( );
	void ToggleCAP ( );
	void ToggleGeneralMenu ( );
	void ToggleCharacter ( );
	void ToggleMap ( );
	void ToggleInventory ( );
	void DisableHudCursorMode ( unsigned long bForceCloseChat );
	void EnableHudCursorMode ( );
	void ToggleHUDCursorMode ( );
	void PlayQuickSlotUseAnimation ( int SlotIndex );
	void StopQuickSlotFillUpAnimation ( int SlotIndex, unsigned long SkipAnimation );
	void StartQuickSlotFillUpAnimation ( int SlotIndex, float Duration );
	void DisplayObjectiveInfo ( class ANetherPawn* NPawn );
	void DisplayHealth ( class ANetherPawn* NPawn );
	void DisplayStamina ( class ANetherPawn* NPawn );
	void StopPickupTimer ( unsigned long bSkipAnimation );
	void StartPickupTimer ( float Duration, class AInventory* Inv );
	void ClearPickupPrompt ( );
	void DisplayPickupPrompt ( struct FString ActionText );
	void DisplayHunger ( class ANetherPawn* NPawn );
	void DisplayAmmo ( class ANWeap* Weapon );
	void HideHUD ( );
	void ShowHUD ( );
	void HideQuickSlots ( );
	void ShowQuickSlots ( unsigned long bAutoHide );
	void RefreshPlayerList ( );
	void SubmitInputText ( );
	void RefreshQuickSlotIcons ( );
	void DrawPlayerHUD ( );
	void DrawHUD ( );
	void DrawCrosshair ( float Scale );
	void ClearHeaderText ( );
	void SetHeaderText ( struct FString Text, int FontSize, int FontColor );
	void HideMessageWindow ( );
	void PostMessageToWindow ( struct FString Message, int HexColor );
	void Message ( class APlayerReplicationInfo* PRI, struct FString msg, struct FName MsgType, float Lifetime );
	void ToggleChatFade ( );
	void DisplayConsoleMessages ( );
	void DisplayLocalMessages ( );
	void PostNote ( struct FString Text, float NoteTime );
	void PostBigMessage ( struct FString Text, unsigned long bShowImmediately, unsigned long bShowOnlyIfUnique, float Width, float Duration, unsigned long bClearQueue );
	void PostNotification ( struct FString Text, unsigned long bShowImmediately, unsigned long bShowOnlyIfUnique );
	void PostMessage ( struct FString Text, float Duration, int PosX, int PosY, int FontSize, struct FString Align, int FontColor, unsigned long bShowImmediately, unsigned long bShowOnlyIfUnique, float Width, unsigned long bClearQueue );
	void InitializePlayerHUD ( );
	void PostBeginPlay ( );
};

UClass* ANetherHUD::pClassPointer = NULL;

// Class NetherGame.NetherPhysicalMaterialProperty
// 0x0010 (0x0070 - 0x0060)
class UNetherPhysicalMaterialProperty : public UPhysicalMaterialPropertyBase
{
public:
	TArray< class UNetherPhysicalMaterialPropertyItem* > InteractionEntries;                               		// 0x0060 (0x0010) [0x0000000004400001]              ( CPF_Edit | CPF_NeedCtorLink | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1986 ];

		return pClassPointer;
	};

};

UClass* UNetherPhysicalMaterialProperty::pClassPointer = NULL;

// Class NetherGame.NetherPhysicalMaterialPropertyItem
// 0x001C (0x007C - 0x0060)
class UNetherPhysicalMaterialPropertyItem : public UObject
{
public:
	unsigned char                                      Interaction;                                      		// 0x0060 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	class UAkEvent*                                    Sound;                                            		// 0x0064 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	TArray< unsigned char >                            Overrides;                                        		// 0x006C (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1987 ];

		return pClassPointer;
	};

};

UClass* UNetherPhysicalMaterialPropertyItem::pClassPointer = NULL;

// Class NetherGame.NetherPlayerControllerBase
// 0x001C (0x0BD4 - 0x0BB8)
class ANetherPlayerControllerBase : public AUTPlayerController
{
public:
	unsigned long                                      bDisablePlayerHUD : 1;                            		// 0x0BB8 (0x0004) [0x0000000000000002] [0x00000001] ( CPF_Const )
	struct FString                                     MberID;                                           		// 0x0BBC (0x0010) [0x0000000000400002]              ( CPF_Const | CPF_NeedCtorLink )
	struct FQWord                                      ClientUID;                                        		// 0x0BCC (0x0008) [0x0000000000000002]              ( CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1988 ];

		return pClassPointer;
	};

	void Debug_DeleteServerDocs ( );
	void DebugDeleteServerDocs ( );
	bool ShouldDeleteServerDocsOnStartup ( );
	void ClientLoggedIn ( );
};

UClass* ANetherPlayerControllerBase::pClassPointer = NULL;

// Class NetherGame.NetherServerDocument
// 0x0014 (0x02A0 - 0x028C)
class ANetherServerDocument : public AActor
{
public:
	unsigned long                                      bSafeToSaveDocument : 1;                          		// 0x028C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bSaveInTimeIntervals : 1;                         		// 0x028C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bDocumentDirty : 1;                               		// 0x028C (0x0004) [0x0000000000000000] [0x00000004] 
	TArray< struct FPointer >                          MberAsyncOps;                                     		// 0x0290 (0x0010) [0x0000000000001000]              ( CPF_Native )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1989 ];

		return pClassPointer;
	};

	void ClearAsyncOps ( );
	void eventGetDocumentTags ( TArray< struct FString >* DocumentTags );
	void eventOnDocumentUpdate ( unsigned long bWasSuccessful );
	void eventOnDocumentCreate ( unsigned long bWasSuccessful );
	void eventPostBeginPlay ( );
	void ResetToDefault ( );
	bool AutoSaveDocument ( );
	bool SafeToSave ( );
	bool ShouldAutoSaveDocument ( );
	void SaveDocument ( );
	void eventDestroyed ( );
	struct FString eventGetDocumentName ( );
};

UClass* ANetherServerDocument::pClassPointer = NULL;

// Class NetherGame.NetherServerDocumentClassOverride
// 0x0008 (0x02A8 - 0x02A0)
class ANetherServerDocumentClassOverride : public ANetherServerDocument
{
public:
	class UClass*                                      OverrideClass;                                    		// 0x02A0 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1990 ];

		return pClassPointer;
	};

	void eventGetDocumentTags ( TArray< struct FString >* DocumentTags );
	void SaveDocument ( );
	void eventOnDocumentUpdate ( unsigned long bWasSuccessful );
	void UpdateDocumentTimer ( );
	void SyncDocumentToServer ( );
	void eventPostBeginPlay ( );
	struct FString eventGetDocumentName ( );
};

UClass* ANetherServerDocumentClassOverride::pClassPointer = NULL;

// Class NetherGame.NetherServerPlayerDocument
// 0x0014 (0x02B4 - 0x02A0)
class ANetherServerPlayerDocument : public ANetherServerDocument
{
public:
	struct FString                                     OwningPlayerId;                                   		// 0x02A0 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              AutoSaveTimer;                                    		// 0x02B0 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1991 ];

		return pClassPointer;
	};

	void eventGetDocumentTags ( TArray< struct FString >* DocumentTags );
	struct FString eventGetDocumentName ( );
	void eventPostBeginPlay ( );
	void eventTick ( float DeltaTime );
	void PreAutosave ( );
	void eventOnDocumentUpdate ( unsigned long bWasSuccessful );
	void eventOnDocumentCreate ( unsigned long bWasSuccessful );
	void InitForPlayer ( class ANetherPlayerController* PC, int CharacterIndex );
};

UClass* ANetherServerPlayerDocument::pClassPointer = NULL;

// Class NetherGame.NThrownObject
// 0x0020 (0x02AC - 0x028C)
class ANThrownObject : public AActor
{
public:
	float                                              ThrowSpeed;                                       		// 0x028C (0x0004) [0x0000000000000000]              
	float                                              LifeTimer;                                        		// 0x0290 (0x0004) [0x0000000000000020]              ( CPF_Net )
	float                                              TimeToLive;                                       		// 0x0294 (0x0004) [0x0000000000000000]              
	class ANetherPlayerController*                     Thrower;                                          		// 0x0298 (0x0008) [0x0000000000000000]              
	float                                              YawRate;                                          		// 0x02A0 (0x0004) [0x0000000000000000]              
	float                                              PitchRate;                                        		// 0x02A4 (0x0004) [0x0000000000000000]              
	float                                              RollRate;                                         		// 0x02A8 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1992 ];

		return pClassPointer;
	};

	void OnLifeExpired ( );
	void eventTick ( float DeltaTime );
	void eventSetInitialState ( );
};

UClass* ANThrownObject::pClassPointer = NULL;

// Class NetherGame.NThrownObject_AOEGrenadeBase
// 0x0034 (0x02E0 - 0x02AC)
class ANThrownObject_AOEGrenadeBase : public ANThrownObject
{
public:
	float                                              FuseLength;                                       		// 0x02AC (0x0004) [0x0000000000000000]              
	float                                              FuseTimer;                                        		// 0x02B0 (0x0004) [0x0000000000000000]              
	unsigned long                                      bNeedsLOS : 1;                                    		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bHasExploded : 1;                                 		// 0x02B4 (0x0004) [0x0000000000000020] [0x00000002] ( CPF_Net )
	unsigned long                                      bMakesNoise : 1;                                  		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bImpactGrenade : 1;                               		// 0x02B4 (0x0004) [0x0000000000000000] [0x00000008] 
	float                                              MinLOSCheckDistance;                              		// 0x02B8 (0x0004) [0x0000000000000000]              
	float                                              FastTraceOffset;                                  		// 0x02BC (0x0004) [0x0000000000000000]              
	float                                              BlastRadius;                                      		// 0x02C0 (0x0004) [0x0000000000000000]              
	class UParticleSystem*                             ParticleEffect;                                   		// 0x02C4 (0x0008) [0x0000000000000000]              
	class UParticleSystemComponent*                    SpawnedEffect;                                    		// 0x02CC (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UAkEvent*                                    GrenadeExplodeSound;                              		// 0x02D4 (0x0008) [0x0000000000000002]              ( CPF_Const )
	float                                              ExplosionLoudness;                                		// 0x02DC (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1993 ];

		return pClassPointer;
	};

	TArray< struct FHitPawn > GetAllPawns ( float GrenadeRadius );
	void ExplosionFX ( );
	void AreaEffect ( struct FHitPawn InHitPawn );
	bool CheckGrenadeLOS ( class APawn* PawnToCheck );
	void ExplosionAOE ( );
	void eventTick ( float DeltaTime );
	void eventReplicatedEvent ( struct FName VarName );
	void eventSetInitialState ( );
};

UClass* ANThrownObject_AOEGrenadeBase::pClassPointer = NULL;

// Class NetherGame.OnlineAuthInterfaceNether
// 0x0000 (0x0324 - 0x0324)
class UOnlineAuthInterfaceNether : public UOnlineAuthInterfaceSteamworks
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1994 ];

		return pClassPointer;
	};

	bool VerifySteamClientAuthSession ( struct FUniqueNetId ClientUID, int ClientIP, int ClientPort, int AuthTicketUID );
	bool VerifyClientAuthSession ( struct FUniqueNetId ClientUID, int ClientIP, int ClientPort, int AuthTicketUID );
	bool CreateClientAuthSession ( struct FUniqueNetId ServerUID, int ServerIP, int ServerPort, unsigned long bSecure, int* OutAuthTicketUID );
};

UClass* UOnlineAuthInterfaceNether::pClassPointer = NULL;

// Class NetherGame.OnlineSubsystemNether
// 0x00B8 (0x0924 - 0x086C)
class UOnlineSubsystemNether : public UOnlineSubsystemSteamworks
{
public:
	struct FString                                     NetherUsername;                                   		// 0x086C (0x0010) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FString                                     NetherPassword;                                   		// 0x087C (0x0010) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	struct FString                                     MberServerUID;                                    		// 0x088C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     MberServerName;                                   		// 0x089C (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     MberServerHost;                                   		// 0x08AC (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ServerMOTD;                                       		// 0x08BC (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     ServerMessage;                                    		// 0x08CC (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned char                                      UnknownData00[ 0x48 ];                            		// 0x08DC (0x0048) UNKNOWN PROPERTY: MapProperty NetherGame.OnlineSubsystemNether.PlayerHash

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1995 ];

		return pClassPointer;
	};

	struct FString GetCurrentUTCTime ( );
	int GetSecondsFromTimeString ( struct FString TimeString );
	void Mber_GetData ( class ANetherServerDocument* Data );
	struct FString Mber_ClientGetAuthToken ( );
	bool Mber_ClientLogin ( );
	void Mber_ServerList ( TArray< struct FServerDesc >* ServerListArray );
	void Mber_ServerHeartbeat ( float ServerTick );
	void Mber_ServerRegister ( );
	void Mber_ServerBanPlayer ( struct FString PlayerID );
	void Mber_ServerCleanupPlayer ( class ANetherPlayerController* PC );
	void Mber_ServerSpendGoldFor ( class ANetherPlayerController* PC, struct FString Reason, int AmountSpent );
	void Mber_ServerUpdateGoldAmount ( class ANetherPlayerController* PC );
	void Mber_ServerDeleteServerDocs ( class ANetherPlayerControllerBase* PC );
	bool Mber_ServerAuthorizePlayer ( class ANetherPlayerControllerBase* PC );
	void Mber_ServerCreateData ( class ANetherServerDocument* Data );
	void Mber_ServerWriteData ( class ANetherServerDocument* Data );
	void Mber_ServerLogin ( );
	class UOnlineAuthInterfaceSteamworks* CreateAuthInterface ( );
};

UClass* UOnlineSubsystemNether::pClassPointer = NULL;

// Class NetherGame.AnimNotify_HitBox
// 0x001C (0x0080 - 0x0064)
class UAnimNotify_HitBox : public UAnimNotify
{
public:
	int                                                AttackDirection;                                  		// 0x0064 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                AttackRange;                                      		// 0x0068 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector                                     Extents;                                          		// 0x006C (0x000C) [0x0000000000000001]              ( CPF_Edit )
	int                                                DamageDay;                                        		// 0x0078 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                DamageNight;                                      		// 0x007C (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1996 ];

		return pClassPointer;
	};

};

UClass* UAnimNotify_HitBox::pClassPointer = NULL;

// Class NetherGame.NetherAnimBlendByAggro
// 0x0034 (0x01B8 - 0x0184)
class UNetherAnimBlendByAggro : public UAnimNodeBlendPerBone
{
public:
	struct FName                                       AggroForward;                                     		// 0x0184 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FName                                       AggroLeft;                                        		// 0x018C (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FName                                       AggroRight;                                       		// 0x0194 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FName                                       AggroBackLeft;                                    		// 0x019C (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FName                                       AggroBackRight;                                   		// 0x01A4 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              BlendTime;                                        		// 0x01AC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAnimNodeSequence*                           AggroAnimNode;                                    		// 0x01B0 (0x0008) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1997 ];

		return pClassPointer;
	};

	unsigned char GetAggroDirection ( struct FVector AttackerDir );
	void eventAnimStopAggroAction ( );
	float AnimPlayAggroAction ( unsigned char AggroAction );
};

UClass* UNetherAnimBlendByAggro::pClassPointer = NULL;

// Class NetherGame.NetherAnimBlendByDodgeType
// 0x0000 (0x017C - 0x017C)
class UNetherAnimBlendByDodgeType : public UUDKAnimBlendBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1998 ];

		return pClassPointer;
	};

};

UClass* UNetherAnimBlendByDodgeType::pClassPointer = NULL;

// Class NetherGame.NetherAnimBlendByHitReact
// 0x0050 (0x01D4 - 0x0184)
class UNetherAnimBlendByHitReact : public UAnimNodeBlendPerBone
{
public:
	TArray< struct FName >                             HitReactAnims;                                    		// 0x0184 (0x0010) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FName >                             HitReactAnims_Crawling;                           		// 0x0194 (0x0010) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FName >                             HitReactAnims_Melee;                              		// 0x01A4 (0x0010) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FName >                             HitReactAnims_MeleeBlocking;                      		// 0x01B4 (0x0010) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	float                                              BlendTime;                                        		// 0x01C4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              BlendWeight_HitReact;                             		// 0x01C8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAnimNodeSequence*                           HitReactSeqNode;                                  		// 0x01CC (0x0008) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1999 ];

		return pClassPointer;
	};

	unsigned char GetHitReactDirection ( struct FVector AttackerDir );
	void AnimStopHitReact ( );
	float AnimPlayHitReact ( struct FVector AttackerDir, unsigned char PlayerPosture, unsigned long bIsMeleeDamage, unsigned long bIsMeleeBlocking );
	bool IsPlayingAnim ( );
};

UClass* UNetherAnimBlendByHitReact::pClassPointer = NULL;

// Class NetherGame.NetherAnimBlendByMeleeAction
// 0x0050 (0x01D4 - 0x0184)
class UNetherAnimBlendByMeleeAction : public UAnimNodeBlendPerBone
{
public:
	TArray< struct FBasicMeleeAttack >                 BasicMeleeAttackAnims;                            		// 0x0184 (0x0010) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FBasicMeleeAttack >                 WeakMeleeAttackAnims;                             		// 0x0194 (0x0010) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	struct FName                                       HeavyMeleeAttack_Intro;                           		// 0x01A4 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FName                                       HeavyMeleeAttack_Loop;                            		// 0x01AC (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FName                                       HeavyMeleeAttack_Release;                         		// 0x01B4 (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FName                                       MeleeBlock;                                       		// 0x01BC (0x0008) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              BlendTime;                                        		// 0x01C4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAnimNodeSequence*                           MeleeActionNode;                                  		// 0x01C8 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	unsigned long                                      bIsCharging : 1;                                  		// 0x01D0 (0x0004) [0x0000000000002000] [0x00000001] ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2000 ];

		return pClassPointer;
	};

	void StopMeleeAction ( );
	void BeginMeleeBlock ( );
	unsigned char ReleaseMeleeAttack ( unsigned long bIsExhausted, float* AnimDuration );
	void BeginMeleeHeavyAttack ( );
};

UClass* UNetherAnimBlendByMeleeAction::pClassPointer = NULL;

// Class NetherGame.NetherAnimBlendByOneOff
// 0x000C (0x0190 - 0x0184)
class UNetherAnimBlendByOneOff : public UAnimNodeBlendPerBone
{
public:
	float                                              PendingBlendOutTime;                              		// 0x0184 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UAnimNodeSequence*                           CustomAnimSeqNode;                                		// 0x0188 (0x0008) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2001 ];

		return pClassPointer;
	};

	void EndCustomAnim ( float BlendOutTime );
	bool IsPlayingAnim ( );
	float BeginCustomAnim ( struct FName CustomAnimName, float AnimRate, float BlendInTime, float BlendOutTime );
};

UClass* UNetherAnimBlendByOneOff::pClassPointer = NULL;

// Class NetherGame.NetherAnimBlendByPosture
// 0x0000 (0x017C - 0x017C)
class UNetherAnimBlendByPosture : public UUDKAnimBlendByPosture
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2002 ];

		return pClassPointer;
	};

};

UClass* UNetherAnimBlendByPosture::pClassPointer = NULL;

// Class NetherGame.NetherAnimBlendByWeaponPose
// 0x0000 (0x017C - 0x017C)
class UNetherAnimBlendByWeaponPose : public UUDKAnimBlendBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2003 ];

		return pClassPointer;
	};

};

UClass* UNetherAnimBlendByWeaponPose::pClassPointer = NULL;

// Class NetherGame.NetherAnimBlendByWeaponUpdate
// 0x0000 (0x017C - 0x017C)
class UNetherAnimBlendByWeaponUpdate : public UUDKAnimBlendBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2004 ];

		return pClassPointer;
	};

};

UClass* UNetherAnimBlendByWeaponUpdate::pClassPointer = NULL;

// Class NetherGame.NetherAnimBlendWeaponIK
// 0x0003 (0x0140 - 0x013D)
class UNetherAnimBlendWeaponIK : public UAnimNodeBlendBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2005 ];

		return pClassPointer;
	};

};

UClass* UNetherAnimBlendWeaponIK::pClassPointer = NULL;

// Class NetherGame.NetherAnimNodeSeqWeap
// 0x0010 (0x01E4 - 0x01D4)
class UNetherAnimNodeSeqWeap : public UUDKAnimNodeSeqWeap
{
public:
	struct FName                                       RifleAnim;                                        		// 0x01D4 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       MeleeAnim;                                        		// 0x01DC (0x0008) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2006 ];

		return pClassPointer;
	};

};

UClass* UNetherAnimNodeSeqWeap::pClassPointer = NULL;

// Class NetherGame.NetherAnimNotify_PhysicalSound
// 0x0001 (0x0079 - 0x0078)
class UNetherAnimNotify_PhysicalSound : public UAnimNotify_AkEvent
{
public:
	unsigned char                                      Interaction;                                      		// 0x0078 (0x0001) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2007 ];

		return pClassPointer;
	};

};

UClass* UNetherAnimNotify_PhysicalSound::pClassPointer = NULL;

// Class NetherGame.NetherCameraMode_Socket
// 0x0003 (0x0258 - 0x0255)
class UNetherCameraMode_Socket : public UGameThirdPersonCameraMode
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 2008 ];

		return pClassPointer;
	};

	void OnBecomeActive ( class APawn* CameraTarget, class UGameThirdPersonCameraMode* PrevMode );
};

UClass* UNetherCameraMode_Socket::pClassPointer = NULL;

// Class NetherGame.NetherPlayerController
// 0x040C (0x0FE0 - 0x0BD4)
class ANetherPlayerController : public ANetherPlayerControllerBase
{
public:
	class UNetherInventoryUI*                          InventoryScreen;                                  		// 0x0BD4 (0x0008) [0x0000000000000000]              
	unsigned char                                      bCrawl;                                           		// 0x0BDC (0x0001) [0x0000000000000004]              ( CPF_Input )
	float                                              QuickSlotHoldToUseTime;                           		// 0x0BE0 (0x0004) [0x0000000000000002]              ( CPF_Const )
	int                                                QuickSlotBeingHeld;                               		// 0x0BE4 (0x0004) [0x0000000000000000]              
	float                                              GrabbingItemDuration;                             		// 0x0BE8 (0x0004) [0x0000000000000000]              
	unsigned long                                      bCompletedGrabbingItem : 1;                       		// 0x0BEC (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bPickedCharacter : 1;                             		// 0x0BEC (0x0004) [0x0000000000000020] [0x00000002] ( CPF_Net )
	unsigned long                                      bUsePersistentGlobalInventory : 1;                		// 0x0BEC (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bEnableDebugAim : 1;                              		// 0x0BEC (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bDebugPickupFinderEnabled : 1;                    		// 0x0BEC (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bGrantPreorderArmband : 1;                        		// 0x0BEC (0x0004) [0x0000000000000002] [0x00000020] ( CPF_Const )
	unsigned long                                      bVisualFlashbangStunned : 1;                      		// 0x0BEC (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      bVisualFlashbangStunIntialized : 1;               		// 0x0BEC (0x0004) [0x0000000000000000] [0x00000080] 
	unsigned long                                      bAudioFlashbangStunned : 1;                       		// 0x0BEC (0x0004) [0x0000000000000000] [0x00000100] 
	unsigned long                                      bDebugShowPlayerMapData : 1;                      		// 0x0BEC (0x0004) [0x0000000000000000] [0x00000200] 
	unsigned long                                      bDebugShowEnemyMapData : 1;                       		// 0x0BEC (0x0004) [0x0000000000000000] [0x00000400] 
	unsigned long                                      bDebugShowEnemySpawnMapData : 1;                  		// 0x0BEC (0x0004) [0x0000000000000000] [0x00000800] 
	unsigned long                                      bDebugShowLootMapData : 1;                        		// 0x0BEC (0x0004) [0x0000000000000000] [0x00001000] 
	unsigned long                                      bDebugShowLootSpawnMapData : 1;                   		// 0x0BEC (0x0004) [0x0000000000000000] [0x00002000] 
	unsigned long                                      bDebugShowAdminMapData : 1;                       		// 0x0BEC (0x0004) [0x0000000000000000] [0x00004000] 
	class AActor*                                      CurrentInteractActor;                             		// 0x0BF0 (0x0008) [0x0000000000000000]              
	class AActor*                                      CurrentPickup;                                    		// 0x0BF8 (0x0008) [0x0000000000000000]              
	float                                              PickupCheckInterval;                              		// 0x0C00 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              PickupCheckTimestamp;                             		// 0x0C04 (0x0004) [0x0000000000000000]              
	float                                              PickUpCone;                                       		// 0x0C08 (0x0004) [0x0000000000000002]              ( CPF_Const )
	int                                                CurrentCharacterSlotIdx;                          		// 0x0C0C (0x0004) [0x0000000000000000]              
	class ANPlayerPreviewMesh*                         PreviewMesh;                                      		// 0x0C10 (0x0008) [0x0000000000000000]              
	float                                              ServerDocSaveInterval;                            		// 0x0C18 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              LastServerDocSaveTime;                            		// 0x0C1C (0x0004) [0x0000000000000000]              
	struct FVector                                     ServerIronsightsStartLoc;                         		// 0x0C20 (0x000C) [0x0000000000000000]              
	struct FRotator                                    ServerIronsightsRot;                              		// 0x0C2C (0x000C) [0x0000000000000000]              
	class ANStore*                                     Store;                                            		// 0x0C38 (0x0008) [0x0000000000000020]              ( CPF_Net )
	float                                              ServerDocUpdateTimer;                             		// 0x0C40 (0x0004) [0x0000000000000000]              
	int                                                CurrentGold;                                      		// 0x0C44 (0x0004) [0x0000000000000020]              ( CPF_Net )
	TArray< struct FPointer >                          MberAsyncOps;                                     		// 0x0C48 (0x0010) [0x0000000000001000]              ( CPF_Native )
	TArray< struct FVector >                           RadarLocations;                                   		// 0x0C58 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              RadarTimer;                                       		// 0x0C68 (0x0004) [0x0000000000000000]              
	float                                              RadarUpdateTime;                                  		// 0x0C6C (0x0004) [0x0000000000000000]              
	TArray< class AActor* >                            NoiseMakers;                                      		// 0x0C70 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              RadarQuietDist;                                   		// 0x0C80 (0x0004) [0x0000000000000000]              
	float                                              RadarLoudDist;                                    		// 0x0C84 (0x0004) [0x0000000000000000]              
	float                                              RadarVeryLoudDist;                                		// 0x0C88 (0x0004) [0x0000000000000000]              
	struct FString                                     DisconnectDelayDesc;                              		// 0x0C8C (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     DisconnectCancelled;                              		// 0x0C9C (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	int                                                DisconnectDelay_Max;                              		// 0x0CAC (0x0004) [0x0000000000000002]              ( CPF_Const )
	int                                                DisconnectDelay_Current;                          		// 0x0CB0 (0x0004) [0x0000000000000000]              
	struct FString                                     AttributeNameString_Guns;                         		// 0x0CB4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     AttributeNameString_Melee;                        		// 0x0CC4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     AttributeNameString_Stamina;                      		// 0x0CD4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     AttributeNameString_Strength;                     		// 0x0CE4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     AttributeNameString_Survival;                     		// 0x0CF4 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     AttributeNameString_Stealth;                      		// 0x0D04 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     AttributeDescriptionString_Guns;                  		// 0x0D14 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     AttributeDescriptionString_Melee;                 		// 0x0D24 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     AttributeDescriptionString_Stamina;               		// 0x0D34 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     AttributeDescriptionString_Strength;              		// 0x0D44 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     AttributeDescriptionString_Survival;              		// 0x0D54 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     AttributeDescriptionString_Stealth;               		// 0x0D64 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	float                                              Skill1Level;                                      		// 0x0D74 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              Skill2Level;                                      		// 0x0D78 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              Skill3Level;                                      		// 0x0D7C (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              StaminaBonusPerLevel;                             		// 0x0D80 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              StaminaBonus_ReducedMeleeCost;                    		// 0x0D84 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              StaminaBonus_JumpHeight;                          		// 0x0D88 (0x0004) [0x0000000000000002]              ( CPF_Const )
