/*
#############################################################################################
# Nether (BETA Patch #7 (64-bit, DX9)) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51->custom
# ========================================================================================= #
# File: UDKBase_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, kokole (64-bit port)
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_SABM_FIND_FIRST_BIND                               -2
#define CONST_INVALIDFIELD                                       -1

/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/

// Enum UDKBase.CastlePC.ETutorialStage
/*enum ETutorialStage
{
	ETS_None                                           = 0,
	ETS_Tap                                            = 1,
	ETS_Swipe                                          = 2,
	ETS_Sticks                                         = 3,
	ETS_Done                                           = 4,
	ETS_MAX                                            = 5
};*/

// Enum UDKBase.UDKAnimBlendByFall.EBlendFallTypes
/*enum EBlendFallTypes
{
	FBT_Up                                             = 0,
	FBT_Down                                           = 1,
	FBT_PreLand                                        = 2,
	FBT_Land                                           = 3,
	FBT_DblJumpUp                                      = 4,
	FBT_DblJumpDown                                    = 5,
	FBT_DblJumpPreLand                                 = 6,
	FBT_DblJumpLand                                    = 7,
	FBT_None                                           = 8,
	FBT_MAX                                            = 9
};*/

// Enum UDKBase.UDKAnimBlendByFlying.EFlyingState
/*enum EFlyingState
{
	Flying_NotFlying                                   = 0,
	Flying_OpeningWings                                = 1,
	Flying_Flying                                      = 2,
	Flying_ClosingWings                                = 3,
	Flying_MAX                                         = 4
};*/

// Enum UDKBase.UDKMapMusicInfo.ECrossfadeType
/*enum ECrossfadeType
{
	CFT_BeginningOfMeasure                             = 0,
	CFT_EndOfMeasure                                   = 1,
	CFT_MAX                                            = 2
};*/

// Enum UDKBase.UDKUIDataProvider_MenuOption.EUTOptionType
/*enum EUTOptionType
{
	UTOT_ComboReadOnly                                 = 0,
	UTOT_ComboNumeric                                  = 1,
	UTOT_CheckBox                                      = 2,
	UTOT_Slider                                        = 3,
	UTOT_Spinner                                       = 4,
	UTOT_EditBox                                       = 5,
	UTOT_CollectionCheckBox                            = 6,
	UTOT_MAX                                           = 7
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class UDKBase.MobileHUDExt
// 0x0044 (0x070C - 0x06C8)
class AMobileHUDExt : public AMobileHUD
{
public:
	class UTexture2D*                                  TapToMoveTexture;                                 		// 0x06C8 (0x0008) [0x0000000000000000]              
	float                                              LastTapToMoveEffectTime;                          		// 0x06D0 (0x0004) [0x0000000000000000]              
	struct FVector2D                                   TapToMoveEffectPos;                               		// 0x06D4 (0x0008) [0x0000000000000000]              
	unsigned long                                      bFlashJoysticks : 1;                              		// 0x06DC (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              FlashTime;                                        		// 0x06E0 (0x0004) [0x0000000000000000]              
	class UFont*                                       BenchmarkFont;                                    		// 0x06E4 (0x0008) [0x0000000000000000]              
	class UTexture2D*                                  BenchmarkBackground;                              		// 0x06EC (0x0008) [0x0000000000000000]              
	struct FTextureUVs                                 BenchmarkBackgroundUVs;                           		// 0x06F4 (0x0010) [0x0000000000000000]              
	float                                              BenchmarkResolutionScale;                         		// 0x0704 (0x0004) [0x0000000000000000]              
	int                                                BenchmarkFeatureLevel;                            		// 0x0708 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1880 ];

		return pClassPointer;
	};

	void FlashSticks ( );
	void DrawMobileZone_Joystick ( class UMobileInputZone* Zone );
	void DrawMobileZone_Slider ( class UMobileInputZone* Zone );
	void PostRenderBenchmarkModeRunning ( );
	void PostRenderBenchmarkModeCompleted ( );
	void PostRenderAttractMode ( );
	void PostRender ( );
	bool ShowMobileHud ( );
	void ConditionallyDrawTapToMoveEffect ( );
	void StartTapToMoveEffect ( float X, float Y );
	void UpdateBenchmarkInformation ( );
};

UClass* AMobileHUDExt::pClassPointer = NULL;

// Class UDKBase.ParticleModuleTypeDataSnow
// 0x00E4 (0x0150 - 0x006C)
class UParticleModuleTypeDataSnow : public UParticleModuleTypeDataBase
{
public:
	struct FRawDistributionVector                      StartSize;                                        		// 0x006C (0x0024) [0x0000000000480001]              ( CPF_Edit | CPF_Component | CPF_NeedCtorLink )
	struct FRawDistributionVector                      StartVelocity;                                    		// 0x0090 (0x0024) [0x0000000000480001]              ( CPF_Edit | CPF_Component | CPF_NeedCtorLink )
	struct FRawDistributionVector                      StartLocation;                                    		// 0x00B4 (0x0024) [0x0000000000480001]              ( CPF_Edit | CPF_Component | CPF_NeedCtorLink )
	struct FRawDistributionVector                      ColorOverLife;                                    		// 0x00D8 (0x0024) [0x0000000000480001]              ( CPF_Edit | CPF_Component | CPF_NeedCtorLink )
	struct FRawDistributionFloat                       AlphaOverLife;                                    		// 0x00FC (0x0024) [0x0000000000480001]              ( CPF_Edit | CPF_Component | CPF_NeedCtorLink )
	struct FRawDistributionFloat                       Lifetime;                                         		// 0x0120 (0x0024) [0x0000000000480001]              ( CPF_Edit | CPF_Component | CPF_NeedCtorLink )
	float                                              KillHeight;                                       		// 0x0144 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              FadeStart;                                        		// 0x0148 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              FadeStop;                                         		// 0x014C (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1881 ];

		return pClassPointer;
	};

};

UClass* UParticleModuleTypeDataSnow::pClassPointer = NULL;

// Class UDKBase.SimpleGame
// 0x0000 (0x04E8 - 0x04E8)
class ASimpleGame : public AFrameworkGame
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1882 ];

		return pClassPointer;
	};

	class UClass* eventSetGameType ( struct FString MapName, struct FString Options, struct FString Portal );
	struct FString StripPlayOnPrefix ( struct FString MapName );
};

UClass* ASimpleGame::pClassPointer = NULL;

// Class UDKBase.UDKGame
// 0x0000 (0x04E8 - 0x04E8)
class AUDKGame : public ASimpleGame
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1883 ];

		return pClassPointer;
	};

};

UClass* AUDKGame::pClassPointer = NULL;

// Class UDKBase.UDKAIDecisionComponent
// 0x0007 (0x008C - 0x0085)
class UUDKAIDecisionComponent : public UActorComponent
{
public:
	unsigned long                                      bTriggered : 1;                                   		// 0x0088 (0x0004) [0x0000000000000000] [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1884 ];

		return pClassPointer;
	};

};

UClass* UUDKAIDecisionComponent::pClassPointer = NULL;

// Class UDKBase.UDKBot
// 0x00FC (0x0598 - 0x049C)
class AUDKBot : public AAIController
{
public:
	class AUDKSquadAI*                                 Squad;                                            		// 0x049C (0x0008) [0x0000000000000000]              
	class UUDKAIDecisionComponent*                     DecisionComponent;                                		// 0x04A4 (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class AActor*                                      TemporaryFocus;                                   		// 0x04AC (0x0008) [0x0000000000000000]              
	unsigned long                                      bExecutingWhatToDoNext : 1;                       		// 0x04B4 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bScriptSpecialJumpCost : 1;                       		// 0x04B4 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bForceRefreshRoute : 1;                           		// 0x04B4 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bTargetAlternateLoc : 1;                          		// 0x04B4 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bEnemyInfoValid : 1;                              		// 0x04B4 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bEnemyIsVisible : 1;                              		// 0x04B4 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bLeadTarget : 1;                                  		// 0x04B4 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      bJumpOverWall : 1;                                		// 0x04B4 (0x0004) [0x0000000000000000] [0x00000080] 
	unsigned long                                      bPlannedJump : 1;                                 		// 0x04B4 (0x0004) [0x0000000000000000] [0x00000100] 
	unsigned long                                      bInDodgeMove : 1;                                 		// 0x04B4 (0x0004) [0x0000000000000000] [0x00000200] 
	unsigned long                                      bEnemyAcquired : 1;                               		// 0x04B4 (0x0004) [0x0000000000000000] [0x00000400] 
	unsigned long                                      bNeedDelayedLeaveVehicle : 1;                     		// 0x04B4 (0x0004) [0x0000000000000000] [0x00000800] 
	unsigned long                                      bAllowRouteReuse : 1;                             		// 0x04B4 (0x0004) [0x0000000000000000] [0x00001000] 
	unsigned long                                      bUsingSquadRoute : 1;                             		// 0x04B4 (0x0004) [0x0000000000000000] [0x00002000] 
	unsigned long                                      bUsePreviousSquadRoute : 1;                       		// 0x04B4 (0x0004) [0x0000000000000000] [0x00004000] 
	unsigned char                                      ScriptedFireMode;                                 		// 0x04B8 (0x0001) [0x0000000000000000]              
	float                                              EnemyVisibilityTime;                              		// 0x04BC (0x0004) [0x0000000000000000]              
	class APawn*                                       VisibleEnemy;                                     		// 0x04C0 (0x0008) [0x0000000000000000]              
	class AVehicle*                                    LastBlockingVehicle;                              		// 0x04C8 (0x0008) [0x0000000000000000]              
	class APawn*                                       CurrentlyTrackedEnemy;                            		// 0x04D0 (0x0008) [0x0000000000000000]              
	TArray< struct FEnemyPosition >                    SavedPositions;                                   		// 0x04D8 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FVector                                     ImpactVelocity;                                   		// 0x04E8 (0x000C) [0x0000000000000000]              
	int                                                AcquisitionYawRate;                               		// 0x04F4 (0x0004) [0x0000000000000000]              
	float                                              HearingThreshold;                                 		// 0x04F8 (0x0004) [0x0000000000000000]              
	float                                              RespawnPredictionTime;                            		// 0x04FC (0x0004) [0x0000000000000000]              
	float                                              WarningDelay;                                     		// 0x0500 (0x0004) [0x0000000000000000]              
	class AProjectile*                                 WarningProjectile;                                		// 0x0504 (0x0008) [0x0000000000000000]              
	struct FVector                                     MonitorStartLoc;                                  		// 0x050C (0x000C) [0x0000000000000000]              
	class APawn*                                       MonitoredPawn;                                    		// 0x0518 (0x0008) [0x0000000000000000]              
	float                                              MonitorMaxDistSq;                                 		// 0x0520 (0x0004) [0x0000000000000000]              
	struct FVector                                     LastSeenPos;                                      		// 0x0524 (0x000C) [0x0000000000000000]              
	struct FVector                                     LastSeeingPos;                                    		// 0x0530 (0x000C) [0x0000000000000000]              
	float                                              LastSeenTime;                                     		// 0x053C (0x0004) [0x0000000000000000]              
	float                                              TrackingReactionTime;                             		// 0x0540 (0x0004) [0x0000000000000000]              
	float                                              BaseTrackingReactionTime;                         		// 0x0544 (0x0004) [0x0000000000000000]              
	struct FVector                                     TrackedVelocity;                                  		// 0x0548 (0x000C) [0x0000000000000000]              
	class ANavigationPoint*                            SquadRouteGoal;                                   		// 0x0554 (0x0008) [0x0000000000000000]              
	class APawn*                                       BlockedAimTarget;                                 		// 0x055C (0x0008) [0x0000000000000000]              
	float                                              LastIterativeCheck;                               		// 0x0564 (0x0004) [0x0000000000000000]              
	float                                              AimUpdateFrequency;                               		// 0x0568 (0x0004) [0x0000000000000000]              
	float                                              LastAimUpdateTime;                                		// 0x056C (0x0004) [0x0000000000000000]              
	float                                              ErrorUpdateFrequency;                             		// 0x0570 (0x0004) [0x0000000000000000]              
	float                                              LastErrorUpdateTime;                              		// 0x0574 (0x0004) [0x0000000000000000]              
	float                                              CurrentAimError;                                  		// 0x0578 (0x0004) [0x0000000000000000]              
	float                                              DodgeLandZ;                                       		// 0x057C (0x0004) [0x0000000000000000]              
	class AActor*                                      FearSpots[ 0x2 ];                                 		// 0x0580 (0x0010) [0x0000000000000000]              
	float                                              DodgeToGoalPct;                                   		// 0x0590 (0x0004) [0x0000000000000000]              
	float                                              MultiJumpZ;                                       		// 0x0594 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1885 ];

		return pClassPointer;
	};

	void eventDelayedLeaveVehicle ( );
	void eventDelayedWarning ( );
	void eventMissedDodge ( );
	float eventAdjustAimError ( float TargetDist, unsigned long bInstantProj );
	float eventSuperDesireability ( class APickupFactory* P );
	bool eventSpecialJumpCost ( float RequiredJumpZ, float* Cost );
	void eventMayDodgeToMoveTarget ( );
	void eventTimeDJReset ( );
	void eventMonitoredPawnAlert ( );
	void eventWhatToDoNext ( );
	class AActor* FindBestSuperPickup ( float MaxDist );
	void BuildSquadRoute ( );
	class AActor* FindPathToSquadRoute ( unsigned long bWeightDetours );
	class AActor* FindBestInventoryPath ( float* MinWeight );
	bool CanMakePathTo ( class AActor* A );
	void LatentWhatToDoNext ( );
	void WaitToSeeEnemy ( );
	void eventReceiveRunOverWarning ( class AUDKVehicle* V, float projSpeed, struct FVector VehicleDir );
	void eventExecuteWhatToDoNext ( );
	class AActor* FaceActor ( float StrafingModifier );
};

UClass* AUDKBot::pClassPointer = NULL;

// Class UDKBase.UDKCarriedObject
// 0x0050 (0x02DC - 0x028C)
class AUDKCarriedObject : public AActor
{
public:
	class ATeamInfo*                                   Team;                                             		// 0x028C (0x0008) [0x0000000000000020]              ( CPF_Net )
	class ANavigationPoint*                            LastAnchor;                                       		// 0x0294 (0x0008) [0x0000000000000002]              ( CPF_Const )
	float                                              LastValidAnchorTime;                              		// 0x029C (0x0004) [0x0000000000000000]              
	class USkeletalMeshComponent*                      SkelMesh;                                         		// 0x02A0 (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	unsigned long                                      bHome : 1;                                        		// 0x02A8 (0x0004) [0x0000000000000020] [0x00000001] ( CPF_Net )
	class AUDKGameObjective*                           HomeBase;                                         		// 0x02AC (0x0008) [0x0000000000000020]              ( CPF_Net )
	struct FVector                                     HomeBaseOffset;                                   		// 0x02B4 (0x000C) [0x0000000000000000]              
	class AActor*                                      OldBase;                                          		// 0x02C0 (0x0008) [0x0000000000000000]              
	class AActor*                                      OldBaseBase;                                      		// 0x02C8 (0x0008) [0x0000000000000000]              
	struct FVector                                     HUDLocation;                                      		// 0x02D0 (0x000C) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1886 ];

		return pClassPointer;
	};

	unsigned char GetTeamNum ( );
	void eventOnBaseChainChanged ( );
	void eventNotReachableBy ( class APawn* P );
	void SetHUDLocation ( struct FVector NewHUDLocation );
};

UClass* AUDKCarriedObject::pClassPointer = NULL;

// Class UDKBase.UDKDataStore_GameSearchBase
// 0x0008 (0x00D8 - 0x00D0)
class UUDKDataStore_GameSearchBase : public UUIDataStore_OnlineGameSearch
{
public:
	class UUDKUIDataProvider_ServerDetails*            ServerDetailsProvider;                            		// 0x00D0 (0x0008) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1887 ];

		return pClassPointer;
	};

	bool HasExistingSearchResults ( );
	bool HasOutstandingQueries ( unsigned long bRestrictCheckToSelf );
	void OnSearchComplete ( unsigned long bWasSuccessful );
	bool eventSubmitGameSearch ( unsigned char ControllerIndex, unsigned long bInvalidateExistingSearchResults );
	void eventInit ( );
};

UClass* UUDKDataStore_GameSearchBase::pClassPointer = NULL;

// Class UDKBase.UDKEmitCameraEffect
// 0x000C (0x02AC - 0x02A0)
class AUDKEmitCameraEffect : public AEmitter
{
public:
	float                                              DistFromCamera;                                   		// 0x02A0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class AUDKPlayerController*                        Cam;                                              		// 0x02A4 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1888 ];

		return pClassPointer;
	};

	void UpdateLocation ( float CamFOVDeg, struct FVector* CamLoc, struct FRotator* CamRot );
	void RegisterCamera ( class AUDKPlayerController* inCam );
	void Destroyed ( );
	void eventPostBeginPlay ( );
};

UClass* AUDKEmitCameraEffect::pClassPointer = NULL;

// Class UDKBase.UDKEmitterPool
// 0x0010 (0x030C - 0x02FC)
class AUDKEmitterPool : public AEmitterPool
{
public:
	TArray< struct FAttachedExplosionLight >           RelativeExplosionLights;                          		// 0x02FC (0x0010) [0x0000000000480000]              ( CPF_Component | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1889 ];

		return pClassPointer;
	};

	class UUDKExplosionLight* SpawnExplosionLight ( class UClass* LightClass, struct FVector SpawnLocation, class AActor* AttachToActor );
	void OnExplosionLightFinished ( class UUDKExplosionLight* Light );
	class UParticleSystemComponent* SpawnEmitter ( class UParticleSystem* EmitterTemplate, struct FVector SpawnLocation, struct FRotator SpawnRotation, class AActor* AttachToActor, class AActor* InInstigator, int MaxDLEPooledReuses, unsigned long bInheritScaleFromBase );
};

UClass* AUDKEmitterPool::pClassPointer = NULL;

// Class UDKBase.UDKExplosionLight
// 0x0030 (0x0270 - 0x0240)
class UUDKExplosionLight : public UPointLightComponent
{
public:
	unsigned long                                      bCheckFrameRate : 1;                              		// 0x0240 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bInitialized : 1;                                 		// 0x0240 (0x0004) [0x0000000000000000] [0x00000002] 
	float                                              HighDetailFrameTime;                              		// 0x0244 (0x0004) [0x0000000000000000]              
	float                                              Lifetime;                                         		// 0x0248 (0x0004) [0x0000000000000000]              
	int                                                TimeShiftIndex;                                   		// 0x024C (0x0004) [0x0000000000000000]              
	TArray< struct FLightValues >                      TimeShift;                                        		// 0x0250 (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	struct FScriptDelegate                             __OnLightFinished__Delegate;                      		// 0x0260 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1890 ];

		return pClassPointer;
	};

	void OnLightFinished ( class UUDKExplosionLight* Light );
	void ResetLight ( );
};

UClass* UUDKExplosionLight::pClassPointer = NULL;

// Class UDKBase.UDKForcedDirectionVolume
// 0x0030 (0x0348 - 0x0318)
class AUDKForcedDirectionVolume : public APhysicsVolume
{
public:
	class UClass*                                      TypeToForce;                                      		// 0x0318 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      bIgnoreHoverboards : 1;                           		// 0x0320 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bDenyExit : 1;                                    		// 0x0320 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bBlockPawns : 1;                                  		// 0x0320 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bBlockSpectators : 1;                             		// 0x0320 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	class UArrowComponent*                             Arrow;                                            		// 0x0324 (0x0008) [0x000000000408000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject | CPF_Component | CPF_EditInline )
	struct FVector                                     ArrowDirection;                                   		// 0x032C (0x000C) [0x0000000000000000]              
	TArray< class AUDKVehicle* >                       TouchingVehicles;                                 		// 0x0338 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1891 ];

		return pClassPointer;
	};

	bool StopsProjectile ( class AProjectile* P );
	void eventUnTouch ( class AActor* Other );
	void eventTouch ( class AActor* Other, class UPrimitiveComponent* OtherComp, struct FVector HitLocation, struct FVector HitNormal );
	void eventActorEnteredVolume ( class AActor* Other );
	void PostBeginPlay ( );
};

UClass* AUDKForcedDirectionVolume::pClassPointer = NULL;

// Class UDKBase.UDKGameInteraction
// 0x0004 (0x01D8 - 0x01D4)
class UUDKGameInteraction : public UUIInteraction
{
public:
	int                                                BlockUIInputSemaphore;                            		// 0x01D4 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1892 ];

		return pClassPointer;
	};

	void NotifyGameSessionEnded ( );
	void eventBlockUIInput ( unsigned long bBlock );
	void eventClearUIInputBlocks ( );
	bool ShouldProcessUIInput ( );
};

UClass* UUDKGameInteraction::pClassPointer = NULL;

// Class UDKBase.UDKGameObjective
// 0x0039 (0x03DD - 0x03A4)
class AUDKGameObjective : public ANavigationPoint
{
public:
	TArray< class ANavigationPoint* >                  ShootSpots;                                       		// 0x03A4 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	unsigned long                                      bAllowOnlyShootable : 1;                          		// 0x03B4 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bUnderAttack : 1;                                 		// 0x03B4 (0x0004) [0x0000000000000020] [0x00000002] ( CPF_Net )
	struct FVector                                     HUDLocation;                                      		// 0x03B8 (0x000C) [0x0000000000000000]              
	class UTexture2D*                                  IconHudTexture;                                   		// 0x03C4 (0x0008) [0x0000000000000002]              ( CPF_Const )
	struct FTextureCoordinates                         IconCoords;                                       		// 0x03CC (0x0010) [0x0000000000000000]              
	unsigned char                                      DefenderTeamIndex;                                		// 0x03DC (0x0001) [0x0000000000000020]              ( CPF_Net )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1893 ];

		return pClassPointer;
	};

	unsigned char GetTeamNum ( );
	void DrawIcon ( class UCanvas* Canvas, struct FVector IconLocation, float IconWidth, float IconAlpha, class AUDKPlayerController* PlayerOwner, struct FLinearColor DrawColor );
	void SetHUDLocation ( struct FVector NewHUDLocation );
	void TriggerFlagEvent ( struct FName EventType, class AController* EventInstigator );
	bool BotNearObjective ( class AAIController* C );
	class AActor* eventGetBestViewTarget ( );
	void ObjectiveChanged ( );
};

UClass* AUDKGameObjective::pClassPointer = NULL;

// Class UDKBase.UDKGameSettingsCommon
// 0x0000 (0x00E4 - 0x00E4)
class UUDKGameSettingsCommon : public UOnlineGameSettings
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1894 ];

		return pClassPointer;
	};

	struct FString BlobToString ( struct FString* InBlob );
	bool StringToBlob ( struct FString* InString, struct FString* OutBlob );
};

UClass* UUDKGameSettingsCommon::pClassPointer = NULL;

// Class UDKBase.UDKGameViewportClient
// 0x0010 (0x01B0 - 0x01A0)
class UUDKGameViewportClient : public UGameViewportClient
{
public:
	struct FString                                     HintLocFileName;                                  		// 0x01A0 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1895 ];

		return pClassPointer;
	};

	struct FString LoadRandomLocalizedHintMessage ( struct FString Category1Name, struct FString Category2Name );
};

UClass* UUDKGameViewportClient::pClassPointer = NULL;

// Class UDKBase.UDKHUD
// 0x0054 (0x071C - 0x06C8)
class AUDKHUD : public AMobileHUD
{
public:
	class UFont*                                       GlowFonts[ 0x2 ];                                 		// 0x06C8 (0x0010) [0x0000000000000000]              
	float                                              PulseDuration;                                    		// 0x06D8 (0x0004) [0x0000000000000000]              
	float                                              PulseSplit;                                       		// 0x06DC (0x0004) [0x0000000000000000]              
	float                                              PulseMultiplier;                                  		// 0x06E0 (0x0004) [0x0000000000000000]              
	struct FFontRenderInfo                             TextRenderInfo;                                   		// 0x06E4 (0x0028) [0x0000000000000000]              
	class UFont*                                       ConsoleIconFont;                                  		// 0x070C (0x0008) [0x0000000000000000]              
	class UFont*                                       BindTextFont;                                     		// 0x0714 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1896 ];

		return pClassPointer;
	};

	void TranslateBindToFont ( struct FString InBindStr, class UFont** DrawFont, struct FString* OutBindStr );
	void DrawGlowText ( struct FString Text, float X, float Y, float MaxHeightInPixels, float PulseTime, unsigned long bRightJustified );
};

UClass* AUDKHUD::pClassPointer = NULL;

// Class UDKBase.UDKJumpPad
// 0x002C (0x03D0 - 0x03A4)
class AUDKJumpPad : public ANavigationPoint
{
public:
	struct FVector                                     JumpVelocity;                                     		// 0x03A4 (0x000C) [0x0000000000000000]              
	class APathNode*                                   JumpTarget;                                       		// 0x03B0 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   JumpSound;                                        		// 0x03B8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              JumpTime;                                         		// 0x03C0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              JumpAirControl;                                   		// 0x03C4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAudioComponent*                             JumpAmbientSound;                                 		// 0x03C8 (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1897 ];

		return pClassPointer;
	};

	bool eventSuggestMovePreparation ( class APawn* Other );
	void eventPostTouch ( class AActor* Other );
	void eventTouch ( class AActor* Other, class UPrimitiveComponent* OtherComp, struct FVector HitLocation, struct FVector HitNormal );
};

UClass* AUDKJumpPad::pClassPointer = NULL;

// Class UDKBase.UDKKActorBreakable
// 0x004C (0x0404 - 0x03B8)
class AUDKKActorBreakable : public AKActor
{
public:
	unsigned long                                      bHasHealth : 1;                                   		// 0x03B8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bDamageOnEncroachment : 1;                        		// 0x03B8 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bResetDOEWhenAsleep : 1;                          		// 0x03B8 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bTakeDamageOnEncroachment : 1;                    		// 0x03B8 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      bBreakWhenCausingDamage : 1;                      		// 0x03B8 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	unsigned long                                      bBroken : 1;                                      		// 0x03B8 (0x0004) [0x0000000000000000] [0x00000020] 
	int                                                Health;                                           		// 0x03BC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                EncroachDamage_Other;                             		// 0x03C0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                EncroachDamage_Self;                              		// 0x03C4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UClass*                                      DmgTypeClass;                                     		// 0x03C8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                DOEResetThreshold;                                		// 0x03D0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UParticleSystem*                             BrokenTemplate;                                   		// 0x03D4 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	class AController*                                 InstigatorController;                             		// 0x03DC (0x0008) [0x0000000000000000]              
	struct FScriptDelegate                             __OnBreakApart__Delegate;                         		// 0x03E4 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FScriptDelegate                             __OnEncroach__Delegate;                           		// 0x03F4 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1898 ];

		return pClassPointer;
	};

	void eventReplicatedEvent ( struct FName VarName );
	void BreakApart ( );
	bool EncroachingOn ( class AActor* Other );
	void eventTakeDamage ( int Damage, class AController* EventInstigator, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
	bool OnEncroach ( class AActor* Other );
	void OnBreakApart ( );
};

UClass* AUDKKActorBreakable::pClassPointer = NULL;

// Class UDKBase.UDKMapInfo
// 0x0004 (0x0064 - 0x0060)
class UUDKMapInfo : public UMapInfo
{
public:
	float                                              VisibilityModifier;                               		// 0x0060 (0x0004) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1899 ];

		return pClassPointer;
	};

};

UClass* UUDKMapInfo::pClassPointer = NULL;

// Class UDKBase.UDKMapMusicInfo
// 0x00F4 (0x0154 - 0x0060)
class UUDKMapMusicInfo : public UObject
{
public:
	struct FMusicForAMap                               MapMusic;                                         		// 0x0060 (0x007C) [0x0000000000000001]              ( CPF_Edit )
	struct FStingersForAMap                            MapStingers;                                      		// 0x00DC (0x0078) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1900 ];

		return pClassPointer;
	};

};

UClass* UUDKMapMusicInfo::pClassPointer = NULL;

// Class UDKBase.UDKParticleSystemComponent
// 0x0014 (0x0398 - 0x0384)
class UUDKParticleSystemComponent : public UParticleSystemComponent
{
public:
	float                                              FOV;                                              		// 0x0384 (0x0004) [0x0000000000000002]              ( CPF_Const )
	unsigned long                                      bHasSavedScale3D : 1;                             		// 0x0388 (0x0004) [0x0000000000000002] [0x00000001] ( CPF_Const )
	struct FVector                                     SavedScale3D;                                     		// 0x038C (0x000C) [0x0000000000000002]              ( CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1901 ];

		return pClassPointer;
	};

	void SetFOV ( float NewFOV );
};

UClass* UUDKParticleSystemComponent::pClassPointer = NULL;

// Class UDKBase.UDKPawn
// 0x0244 (0x07E8 - 0x05A4)
class AUDKPawn : public AGamePawn
{
public:
	unsigned long                                      bReadyToDoubleJump : 1;                           		// 0x05A4 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bRequiresDoubleJump : 1;                          		// 0x05A4 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bCanDoubleJump : 1;                               		// 0x05A4 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bNoJumpAdjust : 1;                                		// 0x05A4 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bIsHoverboardAnimPawn : 1;                        		// 0x05A4 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bFeigningDeath : 1;                               		// 0x05A4 (0x0004) [0x0000000000000020] [0x00000020] ( CPF_Net )
	unsigned long                                      bNotifyStopFalling : 1;                           		// 0x05A4 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      bIsInvisible : 1;                                 		// 0x05A4 (0x0004) [0x0000000000000020] [0x00000080] ( CPF_Net )
	unsigned long                                      bSmoothNetUpdates : 1;                            		// 0x05A4 (0x0004) [0x0000000000000000] [0x00000100] 
	unsigned long                                      bPuttingDownWeapon : 1;                           		// 0x05A4 (0x0004) [0x0000000000000020] [0x00000200] ( CPF_Net )
	unsigned long                                      bPlayingFeignDeathRecovery : 1;                   		// 0x05A4 (0x0004) [0x0000000000000000] [0x00000400] 
	unsigned long                                      bCanPlayFallingImpacts : 1;                       		// 0x05A4 (0x0004) [0x0000000000000000] [0x00000800] 
	unsigned long                                      bEnableFootPlacement : 1;                         		// 0x05A4 (0x0004) [0x0000000000000000] [0x00001000] 
	unsigned long                                      bPostRenderOtherTeam : 1;                         		// 0x05A4 (0x0004) [0x0000000000000000] [0x00002000] 
	unsigned long                                      bBlendOutTakeHitPhysics : 1;                      		// 0x05A4 (0x0004) [0x0000000000000000] [0x00004000] 
	unsigned long                                      bUpdateEyeheight : 1;                             		// 0x05A4 (0x0004) [0x0000000000000000] [0x00008000] 
	unsigned long                                      bTearOffGibs : 1;                                 		// 0x05A4 (0x0004) [0x0000000000000020] [0x00010000] ( CPF_Net )
	float                                              MaxDoubleJumpHeight;                              		// 0x05A8 (0x0004) [0x0000000000000000]              
	int                                                MultiJumpRemaining;                               		// 0x05AC (0x0004) [0x0000000000000000]              
	int                                                MaxMultiJump;                                     		// 0x05B0 (0x0004) [0x0000000000000000]              
	int                                                MultiJumpBoost;                                   		// 0x05B4 (0x0004) [0x0000000000000000]              
	float                                              CustomGravityScaling;                             		// 0x05B8 (0x0004) [0x0000000000000020]              ( CPF_Net )
	struct FPlayEmoteInfo                              EmoteRepInfo;                                     		// 0x05BC (0x0010) [0x0000000000000020]              ( CPF_Net )
	float                                              LastEmoteTime;                                    		// 0x05CC (0x0004) [0x0000000000000000]              
	float                                              MinTimeBetweenEmotes;                             		// 0x05D0 (0x0004) [0x0000000000000000]              
	unsigned char                                      BigTeleportCount;                                 		// 0x05D4 (0x0001) [0x0000000000000020]              ( CPF_Net )
	unsigned char                                      WeaponOverlayFlags;                               		// 0x05D5 (0x0001) [0x0000000000000020]              ( CPF_Net )
	struct FUTTakeHitInfo                              LastTakeHitInfo;                                  		// 0x05D8 (0x0038) [0x0000000000000020]              ( CPF_Net )
	float                                              LastTakeHitTimeout;                               		// 0x0610 (0x0004) [0x0000000000000000]              
	float                                              FireRateMultiplier;                               		// 0x0614 (0x0004) [0x0000000000000020]              ( CPF_Net )
	float                                              HeadScale;                                        		// 0x0618 (0x0004) [0x0000000000000020]              ( CPF_Net )
	float                                              MaxSmoothNetUpdateDist;                           		// 0x061C (0x0004) [0x0000000000000000]              
	float                                              NoSmoothNetUpdateDist;                            		// 0x0620 (0x0004) [0x0000000000000000]              
	float                                              SmoothNetUpdateTime;                              		// 0x0624 (0x0004) [0x0000000000000000]              
	struct FVector                                     MeshTranslationOffset;                            		// 0x0628 (0x000C) [0x0000000000000000]              
	float                                              OldZ;                                             		// 0x0634 (0x0004) [0x0000000000000000]              
	class UAudioComponent*                             PawnAmbientSound;                                 		// 0x0638 (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class USoundCue*                                   PawnAmbientSoundCue;                              		// 0x0640 (0x0008) [0x0000000000000020]              ( CPF_Net )
	struct FDrivenWeaponPawnInfo                       DrivenWeaponPawn;                                 		// 0x0648 (0x0014) [0x0000000000000020]              ( CPF_Net )
	class UAudioComponent*                             WeaponAmbientSound;                               		// 0x065C (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class USoundCue*                                   WeaponAmbientSoundCue;                            		// 0x0664 (0x0008) [0x0000000000000020]              ( CPF_Net )
	class UMaterial*                                   ReplicatedBodyMaterial;                           		// 0x066C (0x0008) [0x0000000000000020]              ( CPF_Net )
	TArray< class UMaterialInstanceConstant* >         BodyMaterialInstances;                            		// 0x0674 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UMaterialInterface*                          OverlayMaterialInstance;                          		// 0x0684 (0x0008) [0x0000000000000020]              ( CPF_Net )
	class USkelControlSingleBone*                      RootRotControl;                                   		// 0x068C (0x0008) [0x0000000000000000]              
	class UAnimNodeAimOffset*                          AimNode;                                          		// 0x0694 (0x0008) [0x0000000000000000]              
	class UGameSkelCtrl_Recoil*                        GunRecoilNode;                                    		// 0x069C (0x0008) [0x0000000000000000]              
	class UGameSkelCtrl_Recoil*                        LeftRecoilNode;                                   		// 0x06A4 (0x0008) [0x0000000000000000]              
	class UGameSkelCtrl_Recoil*                        RightRecoilNode;                                  		// 0x06AC (0x0008) [0x0000000000000000]              
	TArray< class AUDKBot* >                           Trackers;                                         		// 0x06B4 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              BodyMatFadeDuration;                              		// 0x06C4 (0x0004) [0x0000000000000000]              
	struct FLinearColor                                CurrentBodyMatColor;                              		// 0x06C8 (0x0010) [0x0000000000000000]              
	float                                              RemainingBodyMatDuration;                         		// 0x06D8 (0x0004) [0x0000000000000000]              
	float                                              ClientBodyMatDuration;                            		// 0x06DC (0x0004) [0x0000000000000020]              ( CPF_Net )
	struct FLinearColor                                BodyMatColor;                                     		// 0x06E0 (0x0010) [0x0000000000000000]              
	struct FRotator                                    CompressedBodyMatColor;                           		// 0x06F0 (0x000C) [0x0000000000000020]              ( CPF_Net )
	float                                              StartFallImpactTime;                              		// 0x06FC (0x0004) [0x0000000000000000]              
	struct FName                                       TorsoBoneName;                                    		// 0x0700 (0x0008) [0x0000000000000000]              
	class USoundCue*                                   FallImpactSound;                                  		// 0x0708 (0x0008) [0x0000000000000000]              
	float                                              FallSpeedThreshold;                               		// 0x0710 (0x0004) [0x0000000000000000]              
	class UStaticMeshComponent*                        BlobShadow;                                       		// 0x0714 (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class USkeletalMeshComponent*                      OverlayMesh;                                      		// 0x071C (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	struct FName                                       LeftFootBone;                                     		// 0x0724 (0x0008) [0x0000000000000000]              
	struct FName                                       RightFootBone;                                    		// 0x072C (0x0008) [0x0000000000000000]              
	struct FName                                       LeftFootControlName;                              		// 0x0734 (0x0008) [0x0000000000000000]              
	struct FName                                       RightFootControlName;                             		// 0x073C (0x0008) [0x0000000000000000]              
	float                                              BaseTranslationOffset;                            		// 0x0744 (0x0004) [0x0000000000000000]              
	float                                              CrouchTranslationOffset;                          		// 0x0748 (0x0004) [0x0000000000000000]              
	float                                              OldLocationZ;                                     		// 0x074C (0x0004) [0x0000000000000000]              
	float                                              ZSmoothingRate;                                   		// 0x0750 (0x0004) [0x0000000000000002]              ( CPF_Const )
	float                                              MaxFootPlacementDistSquared;                      		// 0x0754 (0x0004) [0x0000000000000000]              
	class USkelControlFootPlacement*                   LeftLegControl;                                   		// 0x0758 (0x0008) [0x0000000000000000]              
	class USkelControlFootPlacement*                   RightLegControl;                                  		// 0x0760 (0x0008) [0x0000000000000000]              
	class USkelControlLimb*                            LeftHandIK;                                       		// 0x0768 (0x0008) [0x0000000000000000]              
	class USkelControlLimb*                            RightHandIK;                                      		// 0x0770 (0x0008) [0x0000000000000000]              
	struct FName                                       DamageParameterName;                              		// 0x0778 (0x0008) [0x0000000000000000]              
	struct FName                                       SaturationParameterName;                          		// 0x0780 (0x0008) [0x0000000000000000]              
	float                                              LastPostRenderTraceTime;                          		// 0x0788 (0x0004) [0x0000000000000000]              
	float                                              TeamBeaconMaxDist;                                		// 0x078C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              StartedFallingTime;                               		// 0x0790 (0x0004) [0x0000000000000000]              
	float                                              SlopeBoostFriction;                               		// 0x0794 (0x0004) [0x0000000000000000]              
	class UAnimNodeAimOffset*                          FlyingDirOffset;                                  		// 0x0798 (0x0008) [0x0000000000000000]              
	int                                                MaxLeanRoll;                                      		// 0x07A0 (0x0004) [0x0000000000000000]              
	float                                              FeignDeathPhysicsBlendOutSpeed;                   		// 0x07A4 (0x0004) [0x0000000000000000]              
	float                                              SwimmingZOffset;                                  		// 0x07A8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              SwimmingZOffsetSpeed;                             		// 0x07AC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              CrouchMeshZOffset;                                		// 0x07B0 (0x0004) [0x0000000000000000]              
	float                                              TakeHitPhysicsBlendOutSpeed;                      		// 0x07B4 (0x0004) [0x0000000000000000]              
	class UUDKSkeletalMeshComponent*                   ArmsMesh[ 0x2 ];                                  		// 0x07B8 (0x0010) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	int                                                RootYaw;                                          		// 0x07C8 (0x0004) [0x0000000000000000]              
	float                                              RootYawSpeed;                                     		// 0x07CC (0x0004) [0x0000000000000000]              
	int                                                MaxYawAim;                                        		// 0x07D0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FVector2D                                   CurrentSkelAim;                                   		// 0x07D4 (0x0008) [0x0000000000000000]              
	struct FVector                                     HUDLocation;                                      		// 0x07DC (0x000C) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1902 ];

		return pClassPointer;
	};

	void eventStuckFalling ( );
	void eventUpdateEyeHeight ( float DeltaTime );
	void eventTakeHitBlendedOut ( );
	void eventStartFeignDeathRecoveryAnim ( );
	void SetHandIKEnabled ( unsigned long bEnabled );
	void SetWeaponAttachmentVisibility ( unsigned long bAttachmentVisible );
	void NativePostRenderFor ( class APlayerController* PC, class UCanvas* Canvas, struct FVector CameraPosition, struct FVector CameraDir );
	void SetHUDLocation ( struct FVector NewHUDLocation );
	bool SuggestJumpVelocity ( struct FVector Destination, struct FVector Start, unsigned long bRequireFallLanding, struct FVector* JumpVelocity );
	void eventStartCrouch ( float HeightAdjust );
	void eventEndCrouch ( float HeightAdjust );
	void eventStoppedFalling ( );
	void eventHoldGameObject ( class AUDKCarriedObject* UDKGameObj );
	bool IsInvisible ( );
	struct FVector GetTargetLocation ( class AActor* RequestedBy, unsigned long bRequestAlternateLoc );
	void EnsureOverlayComponentLast ( );
	void RestorePreRagdollCollisionComponent ( );
	void GetBoundingCylinder ( float* CollisionRadius, float* CollisionHeight );
};

UClass* AUDKPawn::pClassPointer = NULL;

// Class UDKBase.UDKPickupFactory
// 0x00C0 (0x0490 - 0x03D0)
class AUDKPickupFactory : public APickupFactory
{
public:
	unsigned long                                      bIsRespawning : 1;                                		// 0x03D0 (0x0004) [0x0000000000000020] [0x00000001] ( CPF_Net )
	unsigned long                                      bPulseBase : 1;                                   		// 0x03D0 (0x0004) [0x0000000000000020] [0x00000002] ( CPF_Net )
	unsigned long                                      bIsDisabled : 1;                                  		// 0x03D0 (0x0004) [0x0000000000000020] [0x00000004] ( CPF_Net )
	unsigned long                                      bFloatingPickup : 1;                              		// 0x03D0 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bRandomStart : 1;                                 		// 0x03D0 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bRotatingPickup : 1;                              		// 0x03D0 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bUpdatingPickup : 1;                              		// 0x03D0 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      bDoVisibilityFadeIn : 1;                          		// 0x03D0 (0x0004) [0x0000000000000000] [0x00000080] 
	class UStaticMeshComponent*                        BaseMesh;                                         		// 0x03D4 (0x0008) [0x0000000004082008]              ( CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline )
	class UMaterialInstanceConstant*                   BaseMaterialInstance;                             		// 0x03DC (0x0008) [0x0000000000000000]              
	struct FLinearColor                                BaseBrightEmissive;                               		// 0x03E4 (0x0010) [0x0000000000000000]              
	struct FLinearColor                                BaseDimEmissive;                                  		// 0x03F4 (0x0010) [0x0000000000000000]              
	float                                              BasePulseRate;                                    		// 0x0404 (0x0004) [0x0000000000000000]              
