/*
#############################################################################################
# Nether (BETA Patch #7 (64-bit, DX9)) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51->custom
# ========================================================================================= #
# File: UnrealEd_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, kokole (64-bit port)
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/


/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/

// Enum UnrealEd.TextureFactory.TextureCompressionSettings
/*enum TextureCompressionSettings
{
	TC_Default                                         = 0,
	TC_Normalmap                                       = 1,
	TC_Displacementmap                                 = 2,
	TC_NormalmapAlpha                                  = 3,

	MLM_Phong                                          = 0,
	MLM_NonDirectional                                 = 1,
	MLM_Unlit                                          = 2,
	MLM_Custom                                         = 3,
	MLM_Anisotropic                                    = 4,
	MLM_MAX                                            = 5
};*/

// Enum UnrealEd.ReimportTextureFactory.TextureMipGenSettings
/*enum TextureMipGenSettings
{
	TMGS_FromTextureGroup                              = 0,
	TMGS_SimpleAverage                                 = 1,
	TMGS_Sharpen0                                      = 2,
	TMGS_Sharpen1                                      = 3,
	TMGS_Sharpen2                                      = 4,
	TMGS_Sharpen3                                      = 5,
	TMGS_Sharpen4                                      = 6,
	TMGS_Sharpen5                                      = 7,
	TMGS_Sharpen6                                      = 8,
	TMGS_Sharpen7                                      = 9,
	TMGS_Sharpen8                                      = 10,
	TMGS_Sharpen9                                      = 11,
	TMGS_Sharpen10                                     = 12,
	TMGS_NoMipmaps                                     = 13,
	TMGS_LeaveExistingMips                             = 14,
	TMGS_Blur1                                         = 15,
	TMGS_Blur2                                         = 16,
	TMGS_Blur3                                         = 17,
	TMGS_Blur4                                         = 18,
	TMGS_Blur5                                         = 19,
	TMGS_MAX                                           = 20
};*/

// Enum UnrealEd.RenderTargetCubeExporterTGA.CubeFace
/*enum CubeFace
{
	CubeFace_MAX                                       = 0
};*/

// Enum UnrealEd.TextureMovieFactory.MovieStreamSource
/*enum MovieStreamSource
{
	MovieStream_File                                   = 0,
	MovieStream_Memory                                 = 1,
	MovieStream_MAX                                    = 2
};*/

// Enum UnrealEd.TextureRenderTargetCubeFactoryNew.Format
/*enum Format
{
	A8R8G8B8                                           = 0,
	G8                                                 = 1,
	FloatRGB                                           = 2,
	A16B16G16R16                                       = 3,
	Format_MAX                                         = 4
};*/

// Enum UnrealEd.TextureRenderTargetFactoryNew.Format
/*enum Format
{
	A8R8G8B8                                           = 0,
	G8                                                 = 1,
	FloatRGB                                           = 2,
	A16B16G16R16                                       = 3,
	Format_MAX                                         = 4
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class UnrealEd.ActorFactorySelection
// 0x0000 (0x008C - 0x008C)
class UActorFactorySelection : public USelection
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1450 ];

		return pClassPointer;
	};

};

UClass* UActorFactorySelection::pClassPointer = NULL;

// Class UnrealEd.AkBankFactoryNew
// 0x0000 (0x00A8 - 0x00A8)
class UAkBankFactoryNew : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1451 ];

		return pClassPointer;
	};

};

UClass* UAkBankFactoryNew::pClassPointer = NULL;

// Class UnrealEd.AkEventFactoryNew
// 0x0000 (0x00A8 - 0x00A8)
class UAkEventFactoryNew : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1452 ];

		return pClassPointer;
	};

};

UClass* UAkEventFactoryNew::pClassPointer = NULL;

// Class UnrealEd.AnalyzeContentCommandlet
// 0x0000 (0x00B4 - 0x00B4)
class UAnalyzeContentCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1453 ];

		return pClassPointer;
	};

};

UClass* UAnalyzeContentCommandlet::pClassPointer = NULL;

// Class UnrealEd.AnalyzeCookedContentCommandlet
// 0x0020 (0x00D4 - 0x00B4)
class UAnalyzeCookedContentCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x20 ];                            		// 0x00B4 (0x0020) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1454 ];

		return pClassPointer;
	};

};

UClass* UAnalyzeCookedContentCommandlet::pClassPointer = NULL;

// Class UnrealEd.AnalyzeCookedPackagesCommandlet
// 0x0000 (0x00B4 - 0x00B4)
class UAnalyzeCookedPackagesCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1455 ];

		return pClassPointer;
	};

};

UClass* UAnalyzeCookedPackagesCommandlet::pClassPointer = NULL;

// Class UnrealEd.AnalyzeCookedTextureSingleUsageCommandlet
// 0x010C (0x01C0 - 0x00B4)
class UAnalyzeCookedTextureSingleUsageCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x10C ];                           		// 0x00B4 (0x010C) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1456 ];

		return pClassPointer;
	};

};

UClass* UAnalyzeCookedTextureSingleUsageCommandlet::pClassPointer = NULL;

// Class UnrealEd.AnalyzeCookedTextureUsageCommandlet
// 0x0000 (0x00B4 - 0x00B4)
class UAnalyzeCookedTextureUsageCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1457 ];

		return pClassPointer;
	};

};

UClass* UAnalyzeCookedTextureUsageCommandlet::pClassPointer = NULL;

// Class UnrealEd.AnalyzeKismetCommandlet
// 0x004C (0x0100 - 0x00B4)
class UAnalyzeKismetCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x4C ];                            		// 0x00B4 (0x004C) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1458 ];

		return pClassPointer;
	};

};

UClass* UAnalyzeKismetCommandlet::pClassPointer = NULL;

// Class UnrealEd.AnalyzeReferencedContentCommandlet
// 0x069C (0x0750 - 0x00B4)
class UAnalyzeReferencedContentCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x69C ];                           		// 0x00B4 (0x069C) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1459 ];

		return pClassPointer;
	};

};

UClass* UAnalyzeReferencedContentCommandlet::pClassPointer = NULL;

// Class UnrealEd.AnalyzeReferencedObjectCommandlet
// 0x0058 (0x010C - 0x00B4)
class UAnalyzeReferencedObjectCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x58 ];                            		// 0x00B4 (0x0058) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1460 ];

		return pClassPointer;
	};

};

UClass* UAnalyzeReferencedObjectCommandlet::pClassPointer = NULL;

// Class UnrealEd.AnalyzeScriptCommandlet
// 0x0000 (0x00B4 - 0x00B4)
class UAnalyzeScriptCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1461 ];

		return pClassPointer;
	};

};

UClass* UAnalyzeScriptCommandlet::pClassPointer = NULL;

// Class UnrealEd.AnalyzeShaderCachesCommandlet
// 0x0000 (0x00B4 - 0x00B4)
class UAnalyzeShaderCachesCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1462 ];

		return pClassPointer;
	};

};

UClass* UAnalyzeShaderCachesCommandlet::pClassPointer = NULL;

// Class UnrealEd.AnimNodeEditInfo
// 0x0008 (0x0068 - 0x0060)
class UAnimNodeEditInfo : public UObject
{
public:
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x0060 (0x0008) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1463 ];

		return pClassPointer;
	};

};

UClass* UAnimNodeEditInfo::pClassPointer = NULL;

// Class UnrealEd.AnimNodeEditInfo_AimOffset
// 0x0010 (0x0078 - 0x0068)
class UAnimNodeEditInfo_AimOffset : public UAnimNodeEditInfo
{
public:
	unsigned char                                      UnknownData00[ 0x10 ];                            		// 0x0068 (0x0010) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1464 ];

		return pClassPointer;
	};

};

UClass* UAnimNodeEditInfo_AimOffset::pClassPointer = NULL;

// Class UnrealEd.AnimSetFactoryNew
// 0x0000 (0x00A8 - 0x00A8)
class UAnimSetFactoryNew : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1465 ];

		return pClassPointer;
	};

};

UClass* UAnimSetFactoryNew::pClassPointer = NULL;

// Class UnrealEd.AnimTreeEdSkelComponent
// 0x0010 (0x0750 - 0x0740)
class UAnimTreeEdSkelComponent : public USkeletalMeshComponent
{
public:
	unsigned char                                      UnknownData00[ 0x10 ];                            		// 0x0740 (0x0010) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1466 ];

		return pClassPointer;
	};

};

UClass* UAnimTreeEdSkelComponent::pClassPointer = NULL;

// Class UnrealEd.AnimTreeFactoryNew
// 0x0000 (0x00A8 - 0x00A8)
class UAnimTreeFactoryNew : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1467 ];

		return pClassPointer;
	};

};

UClass* UAnimTreeFactoryNew::pClassPointer = NULL;

// Class UnrealEd.ApexDestructibleDamageParametersFactoryNew
// 0x0000 (0x00A8 - 0x00A8)
class UApexDestructibleDamageParametersFactoryNew : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1468 ];

		return pClassPointer;
	};

};

UClass* UApexDestructibleDamageParametersFactoryNew::pClassPointer = NULL;

// Class UnrealEd.ApexGenericAssetFactory
// 0x0000 (0x00A8 - 0x00A8)
class UApexGenericAssetFactory : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1469 ];

		return pClassPointer;
	};

};

UClass* UApexGenericAssetFactory::pClassPointer = NULL;

// Class UnrealEd.ReimportApexGenericAssetFactory
// 0x0008 (0x00B0 - 0x00A8)
class UReimportApexGenericAssetFactory : public UApexGenericAssetFactory
{
public:
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x00A8 (0x0008) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1470 ];

		return pClassPointer;
	};

};

UClass* UReimportApexGenericAssetFactory::pClassPointer = NULL;

// Class UnrealEd.TextureFactory
// 0x0058 (0x0100 - 0x00A8)
class UTextureFactory : public UFactory
{
public:
	unsigned long                                      NoCompression : 1;                                		// 0x00A8 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      CompressionNoAlpha : 1;                           		// 0x00AC (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      DeferCompression : 1;                             		// 0x00B0 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned char                                      CompressionSettings;                              		// 0x00B4 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      CreateMaterial_ : 1;                              		// 0x00B8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      RGBToDiffuse : 1;                                 		// 0x00BC (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      RGBToEmissive : 1;                                		// 0x00C0 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      AlphaToSpecular : 1;                              		// 0x00C4 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      AlphaToEmissive : 1;                              		// 0x00C8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      AlphaToOpacity : 1;                               		// 0x00CC (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      AlphaToOpacityMask : 1;                           		// 0x00D0 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      TwoSided_ : 1;                                    		// 0x00D4 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned char                                      Blending;                                         		// 0x00D8 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      LightingModel;                                    		// 0x00D9 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      LODGroup;                                         		// 0x00DA (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      FlipBook : 1;                                     		// 0x00DC (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      LightMap : 1;                                     		// 0x00E0 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      DitherMip_mapsAlpha_ : 1;                         		// 0x00E4 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      PreserveBorderR : 1;                              		// 0x00E8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      PreserveBorderG : 1;                              		// 0x00EC (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      PreserveBorderB : 1;                              		// 0x00F0 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      PreserveBorderA : 1;                              		// 0x00F4 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned char                                      MipGenSettings;                                   		// 0x00F8 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      FlipNormalMapGreenChannel : 1;                    		// 0x00FC (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1471 ];

		return pClassPointer;
	};

};

UClass* UTextureFactory::pClassPointer = NULL;

// Class UnrealEd.ReimportTextureFactory
// 0x0010 (0x0110 - 0x0100)
class UReimportTextureFactory : public UTextureFactory
{
public:
	unsigned char                                      UnknownData00[ 0x10 ];                            		// 0x0100 (0x0010) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1472 ];

		return pClassPointer;
	};

};

UClass* UReimportTextureFactory::pClassPointer = NULL;

// Class UnrealEd.StaticMeshFactory
// 0x0018 (0x00C0 - 0x00A8)
class UStaticMeshFactory : public UFactory
{
public:
	int                                                Pitch;                                            		// 0x00A8 (0x0004) [0x0000000000000000]              
	int                                                Roll;                                             		// 0x00AC (0x0004) [0x0000000000000000]              
	int                                                Yaw;                                              		// 0x00B0 (0x0004) [0x0000000000000000]              
	unsigned long                                      bOneConvexPerUCXObject : 1;                       		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bSingleSmoothGroupSingleTangent : 1;              		// 0x00B8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bReplaceExistingVertexColors : 1;                 		// 0x00BC (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1473 ];

		return pClassPointer;
	};

};

UClass* UStaticMeshFactory::pClassPointer = NULL;

// Class UnrealEd.ReimportStaticMeshFactory
// 0x0008 (0x00C8 - 0x00C0)
class UReimportStaticMeshFactory : public UStaticMeshFactory
{
public:
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x00C0 (0x0008) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1474 ];

		return pClassPointer;
	};

};

UClass* UReimportStaticMeshFactory::pClassPointer = NULL;

// Class UnrealEd.FbxFactory
// 0x0008 (0x00B0 - 0x00A8)
class UFbxFactory : public UFactory
{
public:
	class UFbxImportUI*                                Import_Options;                                   		// 0x00A8 (0x0008) [0x0000000006004001]              ( CPF_Edit | CPF_Config | CPF_NoClear | CPF_EditInline )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1475 ];

		return pClassPointer;
	};

};

UClass* UFbxFactory::pClassPointer = NULL;

// Class UnrealEd.FbxImportUI
// 0x0008 (0x0068 - 0x0060)
class UFbxImportUI : public UObject
{
public:
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x0060 (0x0008) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1476 ];

		return pClassPointer;
	};

};

UClass* UFbxImportUI::pClassPointer = NULL;

// Class UnrealEd.ReimportFbxStaticMeshFactory
// 0x0008 (0x00B8 - 0x00B0)
class UReimportFbxStaticMeshFactory : public UFbxFactory
{
public:
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x00B0 (0x0008) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1477 ];

		return pClassPointer;
	};

};

UClass* UReimportFbxStaticMeshFactory::pClassPointer = NULL;

// Class UnrealEd.SkeletalMeshFactory
// 0x000C (0x00B4 - 0x00A8)
class USkeletalMeshFactory : public UFactory
{
public:
	unsigned long                                      bAssumeMayaCoordinates : 1;                       		// 0x00A8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x00AC (0x0008) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1478 ];

		return pClassPointer;
	};

};

UClass* USkeletalMeshFactory::pClassPointer = NULL;

// Class UnrealEd.ReimportSkeletalMeshFactory
// 0x0008 (0x00BC - 0x00B4)
class UReimportSkeletalMeshFactory : public USkeletalMeshFactory
{
public:
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x00B4 (0x0008) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1479 ];

		return pClassPointer;
	};

};

UClass* UReimportSkeletalMeshFactory::pClassPointer = NULL;

// Class UnrealEd.ReimportFbxSkeletalMeshFactory
// 0x0008 (0x00B8 - 0x00B0)
class UReimportFbxSkeletalMeshFactory : public UFbxFactory
{
public:
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x00B0 (0x0008) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1480 ];

		return pClassPointer;
	};

};

UClass* UReimportFbxSkeletalMeshFactory::pClassPointer = NULL;

// Class UnrealEd.SoundFactory
// 0x0024 (0x00CC - 0x00A8)
class USoundFactory : public UFactory
{
public:
	unsigned long                                      bAutoCreateCue : 1;                               		// 0x00A8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bIncludeAttenuationNode : 1;                      		// 0x00AC (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bIncludeLoopingNode : 1;                          		// 0x00B0 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bIncludeModulatorNode : 1;                        		// 0x00B4 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	float                                              CueVolume;                                        		// 0x00B8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     CuePackageSuffix;                                 		// 0x00BC (0x0010) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1481 ];

		return pClassPointer;
	};

};

UClass* USoundFactory::pClassPointer = NULL;

// Class UnrealEd.ReimportSoundFactory
// 0x0008 (0x00D4 - 0x00CC)
class UReimportSoundFactory : public USoundFactory
{
public:
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x00CC (0x0008) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1482 ];

		return pClassPointer;
	};

};

UClass* UReimportSoundFactory::pClassPointer = NULL;

// Class UnrealEd.ASVSkelComponent
// 0x0040 (0x0780 - 0x0740)
class UASVSkelComponent : public USkeletalMeshComponent
{
public:
	unsigned char                                      UnknownData00[ 0x40 ];                            		// 0x0740 (0x0040) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1483 ];

		return pClassPointer;
	};

};

UClass* UASVSkelComponent::pClassPointer = NULL;

// Class UnrealEd.BaseCollectionProcessingCommandlet
// 0x00A4 (0x0158 - 0x00B4)
class UBaseCollectionProcessingCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0xA4 ];                            		// 0x00B4 (0x00A4) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1484 ];

		return pClassPointer;
	};

};

UClass* UBaseCollectionProcessingCommandlet::pClassPointer = NULL;

// Class UnrealEd.FindBadAnimNotifyCommandlet
// 0x0048 (0x01A0 - 0x0158)
class UFindBadAnimNotifyCommandlet : public UBaseCollectionProcessingCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x48 ];                            		// 0x0158 (0x0048) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1485 ];

		return pClassPointer;
	};

};

UClass* UFindBadAnimNotifyCommandlet::pClassPointer = NULL;

// Class UnrealEd.FindOnDVDCinematicTexturesCommandlet
// 0x0048 (0x01A0 - 0x0158)
class UFindOnDVDCinematicTexturesCommandlet : public UBaseCollectionProcessingCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x48 ];                            		// 0x0158 (0x0048) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1486 ];

		return pClassPointer;
	};

};

UClass* UFindOnDVDCinematicTexturesCommandlet::pClassPointer = NULL;

// Class UnrealEd.FindOnDVDPSysDynamicParameterCommandlet
// 0x004C (0x01A4 - 0x0158)
class UFindOnDVDPSysDynamicParameterCommandlet : public UBaseCollectionProcessingCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x4C ];                            		// 0x0158 (0x004C) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1487 ];

		return pClassPointer;
	};

};

UClass* UFindOnDVDPSysDynamicParameterCommandlet::pClassPointer = NULL;

// Class UnrealEd.FindOnDVDPSystemsCommandlet
// 0x0048 (0x01A0 - 0x0158)
class UFindOnDVDPSystemsCommandlet : public UBaseCollectionProcessingCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x48 ];                            		// 0x0158 (0x0048) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1488 ];

		return pClassPointer;
	};

};

UClass* UFindOnDVDPSystemsCommandlet::pClassPointer = NULL;

// Class UnrealEd.FindOnDVDPSysWithCollisionEnabledCommandlet
// 0x0048 (0x01A0 - 0x0158)
class UFindOnDVDPSysWithCollisionEnabledCommandlet : public UBaseCollectionProcessingCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x48 ];                            		// 0x0158 (0x0048) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1489 ];

		return pClassPointer;
	};

};

UClass* UFindOnDVDPSysWithCollisionEnabledCommandlet::pClassPointer = NULL;

// Class UnrealEd.FindOnDVDPSysWithMedDetailSpawnRateCommandlet
// 0x004C (0x01A4 - 0x0158)
class UFindOnDVDPSysWithMedDetailSpawnRateCommandlet : public UBaseCollectionProcessingCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x4C ];                            		// 0x0158 (0x004C) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1490 ];

		return pClassPointer;
	};

};

UClass* UFindOnDVDPSysWithMedDetailSpawnRateCommandlet::pClassPointer = NULL;

// Class UnrealEd.FindOnDVDPSysWithNoFixedBoundsCommandlet
// 0x0048 (0x01A0 - 0x0158)
class UFindOnDVDPSysWithNoFixedBoundsCommandlet : public UBaseCollectionProcessingCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x48 ];                            		// 0x0158 (0x0048) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1491 ];

		return pClassPointer;
	};

};

UClass* UFindOnDVDPSysWithNoFixedBoundsCommandlet::pClassPointer = NULL;

// Class UnrealEd.BaseDatabaseCommandlet
// 0x0300 (0x03B4 - 0x00B4)
class UBaseDatabaseCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x300 ];                           		// 0x00B4 (0x0300) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1492 ];

		return pClassPointer;
	};

};

UClass* UBaseDatabaseCommandlet::pClassPointer = NULL;

// Class UnrealEd.AnalyzeDVDSpaceCommandlet
// 0x00DC (0x0490 - 0x03B4)
class UAnalyzeDVDSpaceCommandlet : public UBaseDatabaseCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0xDC ];                            		// 0x03B4 (0x00DC) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1493 ];

		return pClassPointer;
	};

};

UClass* UAnalyzeDVDSpaceCommandlet::pClassPointer = NULL;

// Class UnrealEd.FindCinematicTexturesCommandlet
// 0x0048 (0x03FC - 0x03B4)
class UFindCinematicTexturesCommandlet : public UBaseDatabaseCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x48 ];                            		// 0x03B4 (0x0048) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1494 ];

		return pClassPointer;
	};

};

UClass* UFindCinematicTexturesCommandlet::pClassPointer = NULL;

// Class UnrealEd.LensFlareAuditCommandlet
// 0x016C (0x0520 - 0x03B4)
class ULensFlareAuditCommandlet : public UBaseDatabaseCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x16C ];                           		// 0x03B4 (0x016C) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1495 ];

		return pClassPointer;
	};

};

UClass* ULensFlareAuditCommandlet::pClassPointer = NULL;

// Class UnrealEd.MaterialAuditCommandlet
// 0x0090 (0x0444 - 0x03B4)
class UMaterialAuditCommandlet : public UBaseDatabaseCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x90 ];                            		// 0x03B4 (0x0090) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1496 ];

		return pClassPointer;
	};

};

UClass* UMaterialAuditCommandlet::pClassPointer = NULL;

// Class UnrealEd.ParticleSystemAuditCommandlet
// 0x0480 (0x0834 - 0x03B4)
class UParticleSystemAuditCommandlet : public UBaseDatabaseCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x480 ];                           		// 0x03B4 (0x0480) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1497 ];

		return pClassPointer;
	};

};

UClass* UParticleSystemAuditCommandlet::pClassPointer = NULL;

// Class UnrealEd.PMapForceObjectCheckCommandlet
// 0x0068 (0x041C - 0x03B4)
class UPMapForceObjectCheckCommandlet : public UBaseDatabaseCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x68 ];                            		// 0x03B4 (0x0068) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1498 ];

		return pClassPointer;
	};

};

UClass* UPMapForceObjectCheckCommandlet::pClassPointer = NULL;

// Class UnrealEd.BaseObjectTagGeneratorCommandlet
// 0x00D8 (0x018C - 0x00B4)
class UBaseObjectTagGeneratorCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0xD8 ];                            		// 0x00B4 (0x00D8) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1499 ];

		return pClassPointer;
	};

};

UClass* UBaseObjectTagGeneratorCommandlet::pClassPointer = NULL;

// Class UnrealEd.FindPSysWithBadAutoActivateSettingCommandlet
// 0x0048 (0x01D4 - 0x018C)
class UFindPSysWithBadAutoActivateSettingCommandlet : public UBaseObjectTagGeneratorCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x48 ];                            		// 0x018C (0x0048) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1500 ];

		return pClassPointer;
	};

};

UClass* UFindPSysWithBadAutoActivateSettingCommandlet::pClassPointer = NULL;

// Class UnrealEd.FindPSysWithCollisionEnabledCommandlet
// 0x0000 (0x018C - 0x018C)
class UFindPSysWithCollisionEnabledCommandlet : public UBaseObjectTagGeneratorCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1501 ];

		return pClassPointer;
	};

};

UClass* UFindPSysWithCollisionEnabledCommandlet::pClassPointer = NULL;

// Class UnrealEd.FindPSysWithZOrientTowardsCameraCommandlet
// 0x0000 (0x018C - 0x018C)
class UFindPSysWithZOrientTowardsCameraCommandlet : public UBaseObjectTagGeneratorCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1502 ];

		return pClassPointer;
	};

};

UClass* UFindPSysWithZOrientTowardsCameraCommandlet::pClassPointer = NULL;

// Class UnrealEd.FindStaticMeshCleanIssuesCommandlet
// 0x021C (0x03A8 - 0x018C)
class UFindStaticMeshCleanIssuesCommandlet : public UBaseObjectTagGeneratorCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x21C ];                           		// 0x018C (0x021C) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1503 ];

		return pClassPointer;
	};

};

UClass* UFindStaticMeshCleanIssuesCommandlet::pClassPointer = NULL;

// Class UnrealEd.FixupMobileMaterialFogCommandlet
// 0x0000 (0x018C - 0x018C)
class UFixupMobileMaterialFogCommandlet : public UBaseObjectTagGeneratorCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1504 ];

		return pClassPointer;
	};

};

UClass* UFixupMobileMaterialFogCommandlet::pClassPointer = NULL;

// Class UnrealEd.ParticleModuleAuditCommandlet
// 0x0098 (0x0224 - 0x018C)
class UParticleModuleAuditCommandlet : public UBaseObjectTagGeneratorCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x98 ];                            		// 0x018C (0x0098) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1505 ];

		return pClassPointer;
	};

};

UClass* UParticleModuleAuditCommandlet::pClassPointer = NULL;

// Class UnrealEd.BatchExportCommandlet
// 0x0000 (0x00B4 - 0x00B4)
class UBatchExportCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1506 ];

		return pClassPointer;
	};

};

UClass* UBatchExportCommandlet::pClassPointer = NULL;

// Class UnrealEd.BreakApartPackagesCommandlet
// 0x0000 (0x00B4 - 0x00B4)
class UBreakApartPackagesCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1507 ];

		return pClassPointer;
	};

};

UClass* UBreakApartPackagesCommandlet::pClassPointer = NULL;

// Class UnrealEd.BrowserManager
// 0x0038 (0x0098 - 0x0060)
class UBrowserManager : public UObject
{
public:
	unsigned char                                      UnknownData00[ 0x38 ];                            		// 0x0060 (0x0038) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1508 ];

		return pClassPointer;
	};

};

UClass* UBrowserManager::pClassPointer = NULL;

// Class UnrealEd.BrushBuilder
// 0x0054 (0x00B4 - 0x0060)
class UBrushBuilder : public UObject
{
public:
	unsigned char                                      UnknownData00[ 0x54 ];                            		// 0x0060 (0x0054) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1509 ];

		return pClassPointer;
	};

};

UClass* UBrushBuilder::pClassPointer = NULL;

// Class UnrealEd.CubeBuilder
// 0x001C (0x00D0 - 0x00B4)
class UCubeBuilder : public UBrushBuilder
{
public:
	unsigned char                                      UnknownData00[ 0x1C ];                            		// 0x00B4 (0x001C) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1510 ];

		return pClassPointer;
	};

};

UClass* UCubeBuilder::pClassPointer = NULL;

// Class UnrealEd.ByteCodeSerializer
// 0x0058 (0x0128 - 0x00D0)
class UByteCodeSerializer : public UStruct
{
public:
	unsigned char                                      UnknownData00[ 0x58 ];                            		// 0x00D0 (0x0058) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1511 ];

		return pClassPointer;
	};

};

UClass* UByteCodeSerializer::pClassPointer = NULL;

// Class UnrealEd.CameraAnimFactory
// 0x0000 (0x00A8 - 0x00A8)
class UCameraAnimFactory : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1512 ];

		return pClassPointer;
	};

};

UClass* UCameraAnimFactory::pClassPointer = NULL;

// Class UnrealEd.CascadeConfiguration
// 0x0030 (0x0090 - 0x0060)
class UCascadeConfiguration : public UObject
{
public:
	unsigned char                                      UnknownData00[ 0x30 ];                            		// 0x0060 (0x0030) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1513 ];

		return pClassPointer;
	};

};

UClass* UCascadeConfiguration::pClassPointer = NULL;

// Class UnrealEd.CascadeOptions
// 0x00E8 (0x0148 - 0x0060)
class UCascadeOptions : public UObject
{
public:
	unsigned char                                      UnknownData00[ 0xE8 ];                            		// 0x0060 (0x00E8) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1514 ];

		return pClassPointer;
	};

};

UClass* UCascadeOptions::pClassPointer = NULL;

// Class UnrealEd.CascadePreviewComponent
// 0x0008 (0x0230 - 0x0228)
class UCascadePreviewComponent : public UPrimitiveComponent
{
public:
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x0228 (0x0008) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1515 ];

		return pClassPointer;
	};

};

UClass* UCascadePreviewComponent::pClassPointer = NULL;

// Class UnrealEd.CheckForSimplifiedMeshesCommandlet
// 0x0000 (0x00B4 - 0x00B4)
class UCheckForSimplifiedMeshesCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1516 ];

		return pClassPointer;
	};

};

UClass* UCheckForSimplifiedMeshesCommandlet::pClassPointer = NULL;

// Class UnrealEd.CheckLightMapUVsCommandlet
// 0x0000 (0x00B4 - 0x00B4)
class UCheckLightMapUVsCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1517 ];

		return pClassPointer;
	};

};

UClass* UCheckLightMapUVsCommandlet::pClassPointer = NULL;

// Class UnrealEd.CheckpointGameAssetDatabaseCommandlet
// 0x0000 (0x00B4 - 0x00B4)
class UCheckpointGameAssetDatabaseCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1518 ];

		return pClassPointer;
	};

};

UClass* UCheckpointGameAssetDatabaseCommandlet::pClassPointer = NULL;

// Class UnrealEd.ClassExporterUC
// 0x0000 (0x0094 - 0x0094)
class UClassExporterUC : public UExporter
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1519 ];

		return pClassPointer;
	};

};

UClass* UClassExporterUC::pClassPointer = NULL;

// Class UnrealEd.ClassFactoryUC
// 0x0000 (0x00A8 - 0x00A8)
class UClassFactoryUC : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1520 ];

		return pClassPointer;
	};

};

UClass* UClassFactoryUC::pClassPointer = NULL;

// Class UnrealEd.CompressAnimationsCommandlet
// 0x0000 (0x00B4 - 0x00B4)
class UCompressAnimationsCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1521 ];

		return pClassPointer;
	};

};

UClass* UCompressAnimationsCommandlet::pClassPointer = NULL;

// Class UnrealEd.ConformCommandlet
// 0x0000 (0x00B4 - 0x00B4)
class UConformCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1522 ];

		return pClassPointer;
	};

};

UClass* UConformCommandlet::pClassPointer = NULL;

// Class UnrealEd.ContentAuditCommandlet
// 0x0000 (0x00B4 - 0x00B4)
class UContentAuditCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1523 ];

		return pClassPointer;
	};

};

UClass* UContentAuditCommandlet::pClassPointer = NULL;

// Class UnrealEd.ContentComparisonCommandlet
// 0x0100 (0x01B4 - 0x00B4)
class UContentComparisonCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x100 ];                           		// 0x00B4 (0x0100) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1524 ];

		return pClassPointer;
	};

};

UClass* UContentComparisonCommandlet::pClassPointer = NULL;

// Class UnrealEd.ConvertMapToNavMesh
// 0x0000 (0x00B4 - 0x00B4)
class UConvertMapToNavMesh : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1525 ];

		return pClassPointer;
	};

};

UClass* UConvertMapToNavMesh::pClassPointer = NULL;

// Class UnrealEd.CookPackagesCommandlet
// 0x2010 (0x20C4 - 0x00B4)
class UCookPackagesCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x2010 ];                          		// 0x00B4 (0x2010) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1526 ];

		return pClassPointer;
	};

};

UClass* UCookPackagesCommandlet::pClassPointer = NULL;

// Class UnrealEd.CurveEdOptions
// 0x0078 (0x00D8 - 0x0060)
class UCurveEdOptions : public UObject
{
public:
	unsigned char                                      UnknownData00[ 0x78 ];                            		// 0x0060 (0x0078) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1527 ];

		return pClassPointer;
	};

};

UClass* UCurveEdOptions::pClassPointer = NULL;

// Class UnrealEd.CurveEdPresetBase
// 0x0000 (0x0060 - 0x0060)
class UCurveEdPresetBase : public UObject
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1528 ];

		return pClassPointer;
	};

};

UClass* UCurveEdPresetBase::pClassPointer = NULL;

// Class UnrealEd.CurveEdPreset_CosWave
// 0x000C (0x006C - 0x0060)
class UCurveEdPreset_CosWave : public UCurveEdPresetBase
{
public:
	unsigned char                                      UnknownData00[ 0xC ];                             		// 0x0060 (0x000C) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1529 ];

		return pClassPointer;
	};

};

UClass* UCurveEdPreset_CosWave::pClassPointer = NULL;

// Class UnrealEd.CurveEdPreset_LinearDecay
// 0x0010 (0x0070 - 0x0060)
class UCurveEdPreset_LinearDecay : public UCurveEdPresetBase
{
public:
	unsigned char                                      UnknownData00[ 0x10 ];                            		// 0x0060 (0x0010) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1530 ];

		return pClassPointer;
	};

};

UClass* UCurveEdPreset_LinearDecay::pClassPointer = NULL;

// Class UnrealEd.CurveEdPreset_Nothing
// 0x0000 (0x0060 - 0x0060)
class UCurveEdPreset_Nothing : public UCurveEdPresetBase
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1531 ];

		return pClassPointer;
	};

};

UClass* UCurveEdPreset_Nothing::pClassPointer = NULL;

// Class UnrealEd.CurveEdPreset_SineWave
// 0x000C (0x006C - 0x0060)
class UCurveEdPreset_SineWave : public UCurveEdPresetBase
{
public:
	unsigned char                                      UnknownData00[ 0xC ];                             		// 0x0060 (0x000C) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1532 ];

		return pClassPointer;
	};

};

UClass* UCurveEdPreset_SineWave::pClassPointer = NULL;

// Class UnrealEd.CurveEdPreset_UserSet
// 0x0008 (0x0068 - 0x0060)
class UCurveEdPreset_UserSet : public UCurveEdPresetBase
{
public:
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x0060 (0x0008) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1533 ];

		return pClassPointer;
	};

};

UClass* UCurveEdPreset_UserSet::pClassPointer = NULL;

// Class UnrealEd.CurveEdPresetCurveFactoryNew
// 0x0000 (0x00A8 - 0x00A8)
class UCurveEdPresetCurveFactoryNew : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1534 ];

		return pClassPointer;
	};

};

UClass* UCurveEdPresetCurveFactoryNew::pClassPointer = NULL;

// Class UnrealEd.DecalMaterialFactoryNew
// 0x0000 (0x00A8 - 0x00A8)
class UDecalMaterialFactoryNew : public UFactory
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1535 ];

		return pClassPointer;
	};

};

UClass* UDecalMaterialFactoryNew::pClassPointer = NULL;

// Class UnrealEd.DEditorParameterValue
// 0x001C (0x007C - 0x0060)
class UDEditorParameterValue : public UObject
{
public:
	unsigned char                                      UnknownData00[ 0x1C ];                            		// 0x0060 (0x001C) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1536 ];

		return pClassPointer;
	};

};

UClass* UDEditorParameterValue::pClassPointer = NULL;

// Class UnrealEd.DEditorFontParameterValue
// 0x000C (0x0088 - 0x007C)
class UDEditorFontParameterValue : public UDEditorParameterValue
{
public:
	unsigned char                                      UnknownData00[ 0xC ];                             		// 0x007C (0x000C) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1537 ];

		return pClassPointer;
	};

};

UClass* UDEditorFontParameterValue::pClassPointer = NULL;

// Class UnrealEd.DEditorScalarParameterValue
// 0x0004 (0x0080 - 0x007C)
class UDEditorScalarParameterValue : public UDEditorParameterValue
{
public:
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x007C (0x0004) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1538 ];

		return pClassPointer;
	};

};

UClass* UDEditorScalarParameterValue::pClassPointer = NULL;

// Class UnrealEd.DEditorStaticComponentMaskParameterValue
// 0x0004 (0x0080 - 0x007C)
class UDEditorStaticComponentMaskParameterValue : public UDEditorParameterValue
{
public:
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x007C (0x0004) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1539 ];

		return pClassPointer;
	};

};

UClass* UDEditorStaticComponentMaskParameterValue::pClassPointer = NULL;

// Class UnrealEd.DEditorStaticSwitchParameterValue
// 0x0004 (0x0080 - 0x007C)
class UDEditorStaticSwitchParameterValue : public UDEditorParameterValue
{
public:
	unsigned char                                      UnknownData00[ 0x4 ];                             		// 0x007C (0x0004) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1540 ];

		return pClassPointer;
	};

};

UClass* UDEditorStaticSwitchParameterValue::pClassPointer = NULL;

// Class UnrealEd.DEditorTextureParameterValue
// 0x0008 (0x0084 - 0x007C)
class UDEditorTextureParameterValue : public UDEditorParameterValue
{
public:
	unsigned char                                      UnknownData00[ 0x8 ];                             		// 0x007C (0x0008) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1541 ];

		return pClassPointer;
	};

};

UClass* UDEditorTextureParameterValue::pClassPointer = NULL;

// Class UnrealEd.DEditorVectorParameterValue
// 0x0010 (0x008C - 0x007C)
class UDEditorVectorParameterValue : public UDEditorParameterValue
{
public:
	unsigned char                                      UnknownData00[ 0x10 ];                            		// 0x007C (0x0010) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1542 ];

		return pClassPointer;
	};

};

UClass* UDEditorVectorParameterValue::pClassPointer = NULL;

// Class UnrealEd.DeleteQuarantinedContentCommandlet
// 0x0000 (0x00B4 - 0x00B4)
class UDeleteQuarantinedContentCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1543 ];

		return pClassPointer;
	};

};

UClass* UDeleteQuarantinedContentCommandlet::pClassPointer = NULL;

// Class UnrealEd.DiffPackagesCommandlet
// 0x0054 (0x0108 - 0x00B4)
class UDiffPackagesCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x54 ];                            		// 0x00B4 (0x0054) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1544 ];

		return pClassPointer;
	};

};

UClass* UDiffPackagesCommandlet::pClassPointer = NULL;

// Class UnrealEd.DumpEmittersCommandlet
// 0x0000 (0x00B4 - 0x00B4)
class UDumpEmittersCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1545 ];

		return pClassPointer;
	};

};

UClass* UDumpEmittersCommandlet::pClassPointer = NULL;

// Class UnrealEd.DumpLightmapInfoCommandlet
// 0x0000 (0x00B4 - 0x00B4)
class UDumpLightmapInfoCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1546 ];

		return pClassPointer;
	};

};

UClass* UDumpLightmapInfoCommandlet::pClassPointer = NULL;

// Class UnrealEd.DumpPropertiesCommandlet
// 0x0000 (0x00B4 - 0x00B4)
class UDumpPropertiesCommandlet : public UCommandlet
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1547 ];

		return pClassPointer;
	};

};

UClass* UDumpPropertiesCommandlet::pClassPointer = NULL;

// Class UnrealEd.DumpShadersCommandlet
// 0x0010 (0x00C4 - 0x00B4)
class UDumpShadersCommandlet : public UCommandlet
{
public:
	unsigned char                                      UnknownData00[ 0x10 ];                            		// 0x00B4 (0x0010) MISSED OFFSET

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1548 ];

		return pClassPointer;
	};

};

UClass* UDumpShadersCommandlet::pClassPointer = NULL;

// Class UnrealEd.EditorComponent
// 0x0028 (0x0250 - 0x0228)
class UEditorComponent : public UPrimitiveComponent
{
public:
	unsigned char                                      UnknownData00[ 0x28 ];                            		// 0x0228 (0x0028) MISSED OFFSET

private:
