/*
#############################################################################################
# Nether (BETA Patch #7 (64-bit, DX9)) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51->custom
# ========================================================================================= #
# File: UTGame_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL, kokole (64-bit port)
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_STATS_VIEW_DM_WEAPONS_RANKED_ALLTIME               8
#define CONST_STATS_VIEW_DM_VEHICLEWEAPONS_RANKED_ALLTIME        7
#define CONST_STATS_VIEW_DM_VEHICLES_RANKED_ALLTIME              6
#define CONST_STATS_VIEW_DM_VEHICLEWEAPONS_ALLTIME               5
#define CONST_STATS_VIEW_DM_VEHICLES_ALLTIME                     4
#define CONST_STATS_VIEW_DM_WEAPONS_ALLTIME                      3
#define CONST_STATS_VIEW_DM_RANKED_ALLTIME                       2
#define CONST_STATS_VIEW_DM_PLAYER_ALLTIME                       1

	EWAT_Pistol                                        = 1,
	EWAT_DualPistols                                   = 2,
	EWAT_ShoulderRocket                                = 3,
	EWAT_Stinger                                       = 4,
	EWAT_Rifle                                         = 5,
	EWAT_Melee                                         = 6,
	EWAT_MAX                                           = 7
};*/

// Enum UTGame.UTWeapon.EZoomState
/*enum EZoomState
{
	ZST_NotZoomed                                      = 0,
	ZST_ZoomingOut                                     = 1,
	ZST_ZoomingIn                                      = 2,
	ZST_Zoomed                                         = 3,
	ZST_MAX                                            = 4
};*/

// Enum UTGame.UTWeapon.AmmoWidgetDisplayStyle
/*enum AmmoWidgetDisplayStyle
{
	EAWDS_Numeric                                      = 0,
	EAWDS_BarGraph                                     = 1,
	EAWDS_Both                                         = 2,
	EAWDS_None                                         = 3,
	EAWDS_MAX                                          = 4
};*/

// Enum UTGame.UTGame.EVoiceChannel
/*enum EVoiceChannel
{
	VC_Spectators                                      = 0,
	VC_Team1                                           = 1,
	VC_Team2                                           = 2,
	VC_MAX                                             = 3
};*/

// Enum UTGame.UTGameReplicationInfo.EFlagState
/*enum EFlagState
{
	FLAG_Home                                          = 0,
	FLAG_HeldFriendly                                  = 1,
	FLAG_HeldEnemy                                     = 2,
	FLAG_Down                                          = 3,
	FLAG_MAX                                           = 4
};*/

// Enum UTGame.UTDefensePoint.EDefensePriority
/*enum EDefensePriority
{
	DEFPRI_Low                                         = 0,
	DEFPRI_High                                        = 1,
	DEFPRI_MAX                                         = 2
};*/

// Enum UTGame.UTMusicManager.EMusicState
/*enum EMusicState
{
	MST_Ambient                                        = 0,
	MST_Tension                                        = 1,
	MST_Suspense                                       = 2,
	MST_Action                                         = 3,
	MST_Victory                                        = 4,
	MST_MAX                                            = 5
};*/

// Enum UTGame.UTWeap_RocketLauncher.ERocketFireMode1
/*enum ERocketFireMode1
{
	RFM_Spread                                         = 0,
	RFM_Spiral                                         = 1,
	RFM_Grenades                                       = 2,
	RFM_Max                                            = 3
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class UTGame.UTPlayerController
// 0x0138 (0x0BB8 - 0x0A80)
class AUTPlayerController : public AUDKPlayerController
{
public:
	unsigned long                                      bLateComer : 1;                                   		// 0x0A80 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bIsTyping : 1;                                    		// 0x0A80 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bAutoTaunt : 1;                                   		// 0x0A80 (0x0004) [0x0000000000044000] [0x00000004] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bUseVehicleRotationOnPossess : 1;                 		// 0x0A80 (0x0004) [0x0000000000044000] [0x00000008] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bRotateMinimap : 1;                               		// 0x0A80 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bCameraOutOfWorld : 1;                            		// 0x0A80 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bFirstPersonWeaponsSelfShadow : 1;                		// 0x0A80 (0x0004) [0x0000000000044000] [0x00000040] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bBehindView : 1;                                  		// 0x0A80 (0x0004) [0x0000000000000000] [0x00000080] 
	unsigned long                                      bForceBehindView : 1;                             		// 0x0A80 (0x0004) [0x0000000000000000] [0x00000100] 
	unsigned long                                      bFreeCamera : 1;                                  		// 0x0A80 (0x0004) [0x0000000000000000] [0x00000200] 
	unsigned long                                      bNoTextToSpeechVoiceMessages : 1;                 		// 0x0A80 (0x0004) [0x0000000000044000] [0x00000400] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bTextToSpeechTeamMessagesOnly : 1;                		// 0x0A80 (0x0004) [0x0000000000044000] [0x00000800] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bCurrentCamAnimIsDamageShake : 1;                 		// 0x0A80 (0x0004) [0x0000000000000000] [0x00001000] 
	unsigned long                                      bCurrentCamAnimAffectsFOV : 1;                    		// 0x0A80 (0x0004) [0x0000000000000000] [0x00002000] 
	unsigned long                                      bLandingShake : 1;                                		// 0x0A80 (0x0004) [0x0000000000044000] [0x00004000] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bCenteredWeaponFire : 1;                          		// 0x0A80 (0x0004) [0x0000000000004000] [0x00008000] ( CPF_Config )
	unsigned long                                      bNonlinearZoomInterpolation : 1;                  		// 0x0A80 (0x0004) [0x0000000000002000] [0x00010000] ( CPF_Transient )
	unsigned long                                      bQuittingToMainMenu : 1;                          		// 0x0A80 (0x0004) [0x0000000000002000] [0x00020000] ( CPF_Transient )
	unsigned long                                      bDebugFreeCam : 1;                                		// 0x0A80 (0x0004) [0x0000000000002000] [0x00040000] ( CPF_Transient )
	unsigned long                                      bJustFoundVehicle : 1;                            		// 0x0A80 (0x0004) [0x0000000000000000] [0x00080000] 
	unsigned long                                      bNoCrosshair : 1;                                 		// 0x0A80 (0x0004) [0x0000000000004000] [0x00100000] ( CPF_Config )
	unsigned long                                      bSimpleCrosshair : 1;                             		// 0x0A80 (0x0004) [0x0000000000004000] [0x00200000] ( CPF_Config )
	unsigned long                                      bAlreadyReset : 1;                                		// 0x0A80 (0x0004) [0x0000000000000000] [0x00400000] 
	unsigned long                                      bServerMutedText : 1;                             		// 0x0A80 (0x0004) [0x0000000000000000] [0x00800000] 
	unsigned long                                      bHideObjectivePaths : 1;                          		// 0x0A80 (0x0004) [0x0000000000044000] [0x01000000] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bCleanupInProgress : 1;                           		// 0x0A80 (0x0004) [0x0000000000000000] [0x02000000] 
	unsigned long                                      bCleanupComplete : 1;                             		// 0x0A80 (0x0004) [0x0000000000000000] [0x04000000] 
	unsigned char                                      IdentifiedTeam;                                   		// 0x0A84 (0x0001) [0x0000000000000000]              
	unsigned char                                      PawnShadowMode;                                   		// 0x0A85 (0x0001) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
	unsigned char                                      WeaponHandPreference;                             		// 0x0A86 (0x0001) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
	unsigned char                                      WeaponHand;                                       		// 0x0A87 (0x0001) [0x0000000000000000]              
	unsigned char                                      AutoObjectivePreference;                          		// 0x0A88 (0x0001) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
	unsigned char                                      VehicleControlType;                               		// 0x0A89 (0x0001) [0x0000000000000000]              
	struct FVector                                     DesiredLocation;                                  		// 0x0A8C (0x000C) [0x0000000000000000]              
	class AUTAnnouncer*                                Announcer;                                        		// 0x0A98 (0x0008) [0x0000000000000000]              
	class AUTMusicManager*                             MusicManager;                                     		// 0x0AA0 (0x0008) [0x0000000000000000]              
	float                                              LastTauntAnimTime;                                		// 0x0AA8 (0x0004) [0x0000000000000000]              
	float                                              LastKickWarningTime;                              		// 0x0AAC (0x0004) [0x0000000000000000]              
	struct FString                                     MsgPlayerNotFound;                                		// 0x0AB0 (0x0010) [0x0000000000408002]              ( CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	class UForceFeedbackWaveform*                      CameraShakeShortWaveForm;                         		// 0x0AC0 (0x0008) [0x0000000000000000]              
	class UForceFeedbackWaveform*                      CameraShakeLongWaveForm;                          		// 0x0AC8 (0x0008) [0x0000000000000000]              
	class UCameraAnim*                                 DamageCameraAnim;                                 		// 0x0AD0 (0x0008) [0x0000000000000000]              
	float                                              LastCameraTimeStamp;                              		// 0x0AD8 (0x0004) [0x0000000000000000]              
	class UClass*                                      MatineeCameraClass;                               		// 0x0ADC (0x0008) [0x0000000000000000]              
	class AActor*                                      CalcViewActor;                                    		// 0x0AE4 (0x0008) [0x0000000000000000]              
	struct FVector                                     CalcViewActorLocation;                            		// 0x0AEC (0x000C) [0x0000000000000000]              
	struct FRotator                                    CalcViewActorRotation;                            		// 0x0AF8 (0x000C) [0x0000000000000000]              
	struct FVector                                     CalcViewLocation;                                 		// 0x0B04 (0x000C) [0x0000000000000000]              
	struct FRotator                                    CalcViewRotation;                                 		// 0x0B10 (0x000C) [0x0000000000000000]              
	float                                              CalcEyeHeight;                                    		// 0x0B1C (0x0004) [0x0000000000000000]              
	struct FVector                                     CalcWalkBob;                                      		// 0x0B20 (0x000C) [0x0000000000000000]              
	float                                              LastWarningTime;                                  		// 0x0B2C (0x0004) [0x0000000000000000]              
	float                                              FOVLinearZoomRate;                                		// 0x0B30 (0x0004) [0x0000000000000000]              
	float                                              FOVNonlinearZoomInterpSpeed;                      		// 0x0B34 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              ZoomRotationModifier;                             		// 0x0B38 (0x0004) [0x0000000000000000]              
	struct FRotator                                    DebugFreeCamRot;                                  		// 0x0B3C (0x000C) [0x0000000000002000]              ( CPF_Transient )
	float                                              LastShowPathTime;                                 		// 0x0B48 (0x0004) [0x0000000000000000]              
	class AActor*                                      LastAutoObjective;                                		// 0x0B4C (0x0008) [0x0000000000000000]              
	float                                              LastBullseyeTime;                                 		// 0x0B54 (0x0004) [0x0000000000000000]              
	float                                              LastUseTime;                                      		// 0x0B58 (0x0004) [0x0000000000000000]              
	float                                              OldMessageTime;                                   		// 0x0B5C (0x0004) [0x0000000000000000]              
	float                                              LastFriendlyFireTime;                             		// 0x0B60 (0x0004) [0x0000000000000000]              
	class UUTUIDataStore_StringAliasBindingsMap*       BoundEventsStringDataStore;                       		// 0x0B64 (0x0008) [0x0000000000000000]              
	float                                              NextAdminCmdTime;                                 		// 0x0B6C (0x0004) [0x0000000000000000]              
	float                                              OnFootDefaultFOV;                                 		// 0x0B70 (0x0004) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
	float                                              LastIncomingMessageTime;                          		// 0x0B74 (0x0004) [0x0000000000000000]              
	float                                              LastCombatUpdateTime;                             		// 0x0B78 (0x0004) [0x0000000000000000]              
	float                                              LastTeamChangeTime;                               		// 0x0B7C (0x0004) [0x0000000000000000]              
	class UClass*                                      AchievementHandlerClass;                          		// 0x0B80 (0x0008) [0x0000000000000000]              
	class UUTAchievementsBase*                         AchievementHandler;                               		// 0x0B88 (0x0008) [0x0000000000002000]              ( CPF_Transient )
	class UUTLeaderboardRead*                          LeaderboardStatsRead;                             		// 0x0B90 (0x0008) [0x0000000000000000]              
	class UClass*                                      LeaderboardStatsWriteClass;                       		// 0x0B98 (0x0008) [0x0000000000000000]              
	struct FString                                     DisconnectCommand;                                		// 0x0BA0 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UGFxUDKFrontEnd_JoinGame*                    JoinGameMenu;                                     		// 0x0BB0 (0x0008) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1980 ];

		return pClassPointer;
	};

	bool eventNotifyDisconnect ( struct FString Command );
	void ReadLeaderboardStatsComplete ( unsigned long bWasSuccessful );
	void ClientWriteLeaderboardStats ( class UClass* OnlineStatsWriteClass, unsigned long bIsIncomplete );
	void ClientUpdateSpiceOfLife ( int MutatorBitMask );
	void ClientUpdateAchievement ( int AchievementId, int Count );
	void InitAchievementHandler ( );
	void Disconnect ( );
	void ServerForceTextUnMute ( struct FString TargetPlayer );
	void AdminForceTextUnMute ( struct FString TargetPlayer );
	void ServerForceTextMute ( struct FString TargetPlayer );
	void AdminForceTextMute ( struct FString TargetPlayer );
	void ServerForceVoiceUnMute ( struct FString TargetPlayer );
	void AdminForceVoiceUnMute ( struct FString TargetPlayer );
	void ServerForceVoiceMute ( struct FString TargetPlayer );
	void AdminForceVoiceMute ( struct FString TargetPlayer );
	void ServerChangeMap ( struct FString URL );
	void AdminChangeMap ( struct FString URL );
	void ServerRestartMap ( );
	void AdminRestartMap ( );
	void AdminPlayerList ( );
	void AdminKick ( struct FString S );
	void AdminKickBan ( struct FString S );
	void ServerAdmin ( struct FString CommandLine );
	void Admin ( struct FString CommandLine );
	void ServerAdminLogOut ( );
	void AdminLogout ( );
	void ServerAdminLogin ( struct FString Password );
	void AdminLogin ( struct FString Password );
	bool AdminCmdOk ( );
	void ServerTeamSay ( struct FString msg );
	void ServerSay ( struct FString msg );
	void ServerKickBan ( struct FString PlayerToKick, unsigned long bBan );
	void eventGetSeamlessTravelActorList ( unsigned long bToEntry, TArray< class AActor* >* ActorList );
	void ServerChangeTeam ( int N );
	void BullseyeMessage ( );
	void ServerSetNetSpeed ( int NewSpeed );
	void ReceiveBotVoiceMessage ( class AUTPlayerReplicationInfo* SenderPRI, int MessageIndex, class UObject* LocationObject );
	void SendMessage ( class APlayerReplicationInfo* Recipient, struct FName MessageType, float Wait, class UClass* DamageType );
	bool CanRestartPlayer ( );
	void CharacterProcessingComplete ( );
	void GetPlayerLoc ( );
	void UpdateRotation ( float DeltaTime );
	void ClientEndZoom ( );
	void EndZoomNonlinear ( float ZoomInterpSpeed );
	void EndZoom ( );
	void StopZoom ( );
	void StartZoomNonlinear ( float NewDesiredFOV, float NewZoomInterpSpeed );
	void StartZoom ( float NewDesiredFOV, float NewZoomRate );
	void AdjustFOV ( float DeltaTime );
	void OnUpdatePropertyFOVAngle ( );
	void FlushDebug ( );
	void ClientBecameActivePlayer ( );
	void ServerBecomeActivePlayer ( );
	void BecomeActive ( );
	void ServerShowPathToBase ( unsigned char TeamNum );
	void BasePath ( unsigned char Num );
	void ClientPawnDied ( );
	void PawnDied ( class APawn* P );
	void CheckBulletWhip ( class UAkEvent* BulletWhip, struct FVector FireLocation, struct FVector FireDir, struct FVector HitLocation );
	void ClientRoundEnded ( class AActor* EndRoundFocus );
	void RoundHasEnded ( class AActor* EndRoundFocus );
	void ClientGameEnded ( class AActor* EndGameFocus, unsigned long bIsWinner );
	void ShowMidGameMenu ( struct FName TabTag, unsigned long bEnableInput );
	void ShowMap ( );
	void AdjustCameraScale ( unsigned long bIn );
	void NextWeapon ( );
	void PrevWeapon ( );
	void ServerViewObjective ( );
	void ViewObjective ( );
	void ServerViewPlayerByName ( struct FString PlayerName );
	void ViewPlayerByName ( struct FString PlayerName );
	void ServerViewSelf ( struct FViewTargetTransitionParams TransitionParams );
	void SwitchWeapon ( unsigned char T );
	void ViewNextBot ( );
	void LongClientAdjustPosition ( float TimeStamp, struct FName NewState, unsigned char newPhysics, float NewLocX, float NewLocY, float NewLocZ, float NewVelX, float NewVelY, float NewVelZ, class AActor* NewBase, float NewFloorX, float NewFloorY, float NewFloorZ );
	void ShortServerMove ( float TimeStamp, struct FVector ClientLoc, unsigned char NewFlags, unsigned char ClientRoll, int View );
	void CallServerMove ( class USavedMove* NewMove, struct FVector ClientLoc, unsigned char ClientRoll, int View, class USavedMove* OldMove );
	void ToggleTranslocator ( );
	void ToggleMelee ( );
	void ViewShake ( float DeltaTime );
	void OnStopCameraAnim ( class UUTSeqAct_StopCameraAnim* inAction );
	void OnPlayCameraAnim ( class UUTSeqAct_PlayCameraAnim* inAction );
	void eventClientStopCameraAnim ( class UCameraAnim* AnimToStop, unsigned long bImmediate );
	void eventClientPlayCameraAnim ( class UCameraAnim* AnimToPlay, float Scale, float Rate, float BlendInTime, float BlendOutTime, unsigned long bLoop, unsigned long bRandomStartTime, unsigned char Space, struct FRotator CustomPlaySpace );
	void SetCameraAnimStrength ( float NewStrength );
	void StopCameraAnim ( unsigned long bImmediate );
	void PlayCameraAnim ( class UCameraAnim* AnimToPlay, float Scale, float Rate, float BlendInTime, float BlendOutTime, unsigned long bLoop, unsigned long bIsDamageShake );
	void StopViewShaking ( );
	void DamageShake ( int Damage, class UClass* DamageType );
	void PlayAnnouncement ( class UClass* InMessageClass, int MessageIndex, class APlayerReplicationInfo* PRI, class UObject* OptionalObject );
	void ClientPlayAnnouncement ( class UClass* InMessageClass, int MessageIndex, class APlayerReplicationInfo* PRI, class UObject* OptionalObject );
	void Music ( int EventIndex );
	bool AlreadyInActionMusic ( );
	void ClientMusicEvent ( int EventIndex );
	void eventGetPlayerViewPoint ( struct FVector* POVLocation, struct FRotator* POVRotation );
	bool UsePlayerCameraForViewPoint ( );
	void SpawnCamera ( );
	void SetCameraMode ( struct FName NewCamMode );
	void ClientSetBehindView ( unsigned long bNewBehindView );
	void SetBehindView ( unsigned long bNewBehindView );
	void BehindView ( );
	void ClientReset ( );
	void Reset ( );
	void DisplayDebug ( class AHUD* HUD, float* out_YL, float* out_YPos );
	void ShowScoreboard ( );
	void ServerSpectate ( );
	void ClearDoubleClick ( );
	bool PerformedUseAction ( );
	void Use ( );
	void ServerUse ( );
	void ClientPlayTakeHit ( struct FVector HitLoc, unsigned char Damage, class UClass* DamageType );
	void NotifyTakeHit ( class AController* InstigatedBy, struct FVector HitLocation, int Damage, class UClass* DamageType, struct FVector Momentum );
	void PlayStartupMessage ( unsigned char StartupStage );
	void ToggleScreenShotMode ( );
	void SetAutoTaunt ( unsigned long Value );
	void ServerSetAutoTaunt ( unsigned long Value );
	bool UsingFirstPersonCamera ( );
	void eventResetCameraMode ( );
	void SetHand ( unsigned char NewWeaponHand );
	void ServerSetHand ( unsigned char NewWeaponHand );
	void ServerPlayerPreferences ( unsigned char NewWeaponHand, unsigned long bNewAutoTaunt, unsigned long bNewCenteredWeaponFire, unsigned char NewAutoObjectivePreference, unsigned char NewVehicleControls );
	void eventReceivedPlayer ( );
	void AcknowledgePossession ( class APawn* P );
	void eventPossess ( class APawn* inPawn, unsigned long bVehicleTransition );
	void ClientSetAutoObjective ( class AActor* NewAutoObjective );
	void SetAutoObjective ( class AActor* ObjectiveActor, unsigned long bOnlyNotifyDifferent );
	void CheckAutoObjective ( unsigned long bOnlyNotifyDifferent );
	void SetViewTarget ( class AActor* NewViewTarget, struct FViewTargetTransitionParams TransitionParams );
	void ClientRestart ( class APawn* NewPawn );
	void Restart ( unsigned long bVehicleTransition );
	void FixFOV ( );
	void FOV ( float F );
	void CheckJumpOrDuck ( );
	void eventKickWarning ( );
	void DrawHUD ( class AHUD* H );
	void eventSoakPause ( class APawn* P );
	void OnControllerChanged ( int ControllerId, unsigned long bIsConnected );
	void eventDestroyed ( );
	void Typing ( unsigned long bTyping );
	void Taunt ( int TauntIndex );
	void ServerPlayVehicleHorn ( );
	void PlayVehicleHorn ( );
	bool TriggerInteracted ( );
	void PlayWinMessage ( unsigned long bWinner );
	void ProjectileWarningTimer ( );
	void ReceiveProjectileWarning ( class AProjectile* Proj );
	void eventReceiveWarning ( class APawn* shooter, float projSpeed, struct FVector FireDir );
	void PlayBeepSound ( );
	bool LandingShake ( );
	void ServerDropFlag ( );
	void DropFlag ( );
	void ToggleMinimap ( );
	class AUTVehicle* CheckVehicleToDrive ( unsigned long bEnterVehicle );
	void ClientSetRequestedEntryWithFlag ( class AUTVehicle* V, unsigned long bNewValue, int MessageIndex );
	class AUTVehicle* CheckPickedVehicle ( class AUTVehicle* V, unsigned long bEnterVehicle );
	bool FindVehicleToDrive ( );
	struct FRotator GetAdjustedAimFor ( class AWeapon* W, struct FVector StartFireLoc );
	float AimHelpModifier ( );
	bool AimingHelp ( unsigned long bInstantHit );
	void eventClientHearSound ( class USoundCue* ASound, class AActor* SourceActor, struct FVector SourceLocation, unsigned long bStopWhenOwnerDestroyed, unsigned long bIsOccluded );
	void ToggleSpeaking ( unsigned long bNowOn );
	void ServerProcessSpeechRecognition ( struct FSpeechRecognizedWord* ReplicatedWords );
	void SpeechRecognitionComplete ( );
	void ClientSetSpeechRecognitionObject ( class USpeechRecognition* NewRecognitionData );
	void OnDestroyOnlineGameComplete ( struct FName SessionName, unsigned long bWasSuccessful );
	void OnEndOnlineGameComplete ( struct FName SessionName, unsigned long bWasSuccessful );
	bool CleanupOnlineSubsystemSession ( unsigned long bWasFromMenu );
	void FinishQuitToMainMenu ( );
	void QuitToMainMenu ( );
	void SetFrontEndErrorMessage ( struct FString Title, struct FString Message );
	void ClientWasKicked ( );
	void NotifyNotEnoughSpaceInInvite ( );
	void NotifyNotAllPlayersCanJoinInvite ( );
	void NotifyInviteFailed ( );
	void OnFriendMessageReceived ( unsigned char LocalUserNum, struct FUniqueNetId SendingPlayer, struct FString SendingNick, struct FString Message );
	void OnFriendInviteReceived ( unsigned char LocalUserNum, struct FUniqueNetId RequestingPlayer, struct FString RequestingNick, struct FString Message );
	void OnGameInviteReceived ( unsigned char LocalUserNum, struct FString RequestingNick );
	void OnReadProfileSettingsComplete ( unsigned char LocalUserNum, unsigned long bWasSuccessful );
	void OnLinkStatusChanged ( unsigned long bConnected );
	void OnConnectionStatusChange ( unsigned char ConnectionStatus );
	void ClientSetOnlineStatus ( );
	void eventClearOnlineDelegates ( );
	void AddOnlineDelegates ( unsigned long bRegisterVoice );
	void UnregisterPlayerDataStores ( );
	void RegisterCustomPlayerDataStores ( );
	void ClearStringAliasBindingMapCache ( );
	void ServerSetCharacterClass ( class UClass* CharClass );
	void PulseTeamColor ( );
	void eventInitInputSystem ( );
	void SwitchHud ( );
	void ServerThrowWeapon ( );
	void Camera ( struct FName NewMode );
};

UClass* AUTPlayerController::pClassPointer = NULL;

// Class UTGame.UTPawn
// 0x02DC (0x0AC4 - 0x07E8)
class AUTPawn : public AUDKPawn
{
public:
	unsigned long                                      bFixedView : 1;                                   		// 0x07E8 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bSpawnDone : 1;                                   		// 0x07E8 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bSpawnIn : 1;                                     		// 0x07E8 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bShieldAbsorb : 1;                                		// 0x07E8 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bDodging : 1;                                     		// 0x07E8 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bStopOnDoubleLanding : 1;                         		// 0x07E8 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bIsInvulnerable : 1;                              		// 0x07E8 (0x0004) [0x0000000000000000] [0x00000040] 
	unsigned long                                      bJustDroppedOrb : 1;                              		// 0x07E8 (0x0004) [0x0000000000000000] [0x00000080] 
	unsigned long                                      bForcedFeignDeath : 1;                            		// 0x07E8 (0x0004) [0x0000000000000000] [0x00000100] 
	unsigned long                                      bWeaponBob : 1;                                   		// 0x07E8 (0x0004) [0x0000000000044000] [0x00000200] ( CPF_Config | CPF_GlobalConfig )
	unsigned long                                      bJustLanded : 1;                                  		// 0x07E8 (0x0004) [0x0000000000000000] [0x00000400] 
	unsigned long                                      bLandRecovery : 1;                                		// 0x07E8 (0x0004) [0x0000000000000000] [0x00000800] 
	unsigned long                                      bHasHoverboard : 1;                               		// 0x07E8 (0x0004) [0x0000000000000020] [0x00001000] ( CPF_Net )
	unsigned long                                      bStopDeathCamera : 1;                             		// 0x07E8 (0x0004) [0x0000000000000000] [0x00002000] 
	unsigned long                                      bWinnerCam : 1;                                   		// 0x07E8 (0x0004) [0x0000000000000000] [0x00004000] 
	unsigned long                                      bGibbed : 1;                                      		// 0x07E8 (0x0004) [0x0000000000000000] [0x00008000] 
	unsigned long                                      bHeadGibbed : 1;                                  		// 0x07E8 (0x0004) [0x0000000000000000] [0x00010000] 
	unsigned long                                      bArmsAttached : 1;                                		// 0x07E8 (0x0004) [0x0000000000000000] [0x00020000] 
	unsigned long                                      bWeaponAttachmentVisible : 1;                     		// 0x07E8 (0x0004) [0x0000000000000000] [0x00040000] 
	unsigned long                                      bHideOnListenServer : 1;                          		// 0x07E8 (0x0004) [0x0000000000000000] [0x00080000] 
	unsigned long                                      bPostRenderTraceSucceeded : 1;                    		// 0x07E8 (0x0004) [0x0000000000000000] [0x00100000] 
	unsigned long                                      bReceivedValidTeam : 1;                           		// 0x07E8 (0x0004) [0x0000000000000000] [0x00200000] 
	unsigned long                                      bKillsAffectHead : 1;                             		// 0x07E8 (0x0004) [0x0000000000000000] [0x00400000] 
	unsigned long                                      bKilledByBio : 1;                                 		// 0x07E8 (0x0004) [0x0000000000000000] [0x00800000] 
	class UClass*                                      CurrentWeaponAttachmentClass;                     		// 0x07EC (0x0008) [0x0000000000000020]              ( CPF_Net )
	int                                                UnfeignFailedCount;                               		// 0x07F4 (0x0004) [0x0000000000000000]              
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                 		// 0x07F8 (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UAnimNodeBlend*                              FeignDeathBlend;                                  		// 0x0800 (0x0008) [0x0000000000000000]              
	class UAnimNodeSlot*                               FullBodyAnimSlot;                                 		// 0x0808 (0x0008) [0x0000000000000000]              
	class UAnimNodeSlot*                               TopHalfAnimSlot;                                  		// 0x0810 (0x0008) [0x0000000000000000]              
	float                                              DeathHipLinSpring;                                		// 0x0818 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              DeathHipLinDamp;                                  		// 0x081C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              DeathHipAngSpring;                                		// 0x0820 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              DeathHipAngDamp;                                  		// 0x0824 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              StartDeathAnimTime;                               		// 0x0828 (0x0004) [0x0000000000000000]              
	class UClass*                                      DeathAnimDamageType;                              		// 0x082C (0x0008) [0x0000000000000000]              
	float                                              TimeLastTookDeathAnimDamage;                      		// 0x0834 (0x0004) [0x0000000000000000]              
	struct FVector                                     FixedViewLoc;                                     		// 0x0838 (0x000C) [0x0000000000000000]              
	struct FRotator                                    FixedViewRot;                                     		// 0x0844 (0x000C) [0x0000000000000000]              
	float                                              CameraScale;                                      		// 0x0850 (0x0004) [0x0000000000000000]              
	float                                              CurrentCameraScale;                               		// 0x0854 (0x0004) [0x0000000000000000]              
	float                                              CameraScaleMin;                                   		// 0x0858 (0x0004) [0x0000000000000000]              
	float                                              CameraScaleMax;                                   		// 0x085C (0x0004) [0x0000000000000000]              
	struct FVector                                     OldCameraPosition;                                		// 0x0860 (0x000C) [0x0000000000000000]              
	float                                              CameraZOffset;                                    		// 0x086C (0x0004) [0x0000000000000000]              
	float                                              HeroCameraScale;                                  		// 0x0870 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                HeroCameraPitch;                                  		// 0x0874 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              DodgeSpeed;                                       		// 0x0878 (0x0004) [0x0000000000000000]              
	float                                              DodgeSpeedZ;                                      		// 0x087C (0x0004) [0x0000000000000000]              
	unsigned char                                      CurrentDir;                                       		// 0x0880 (0x0001) [0x0000000000000000]              
	float                                              DoubleJumpEyeHeight;                              		// 0x0884 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              DoubleJumpThreshold;                              		// 0x0888 (0x0004) [0x0000000000000000]              
	float                                              DefaultAirControl;                                		// 0x088C (0x0004) [0x0000000000000000]              
	float                                              Bob;                                              		// 0x0890 (0x0004) [0x0000000000044000]              ( CPF_Config | CPF_GlobalConfig )
	float                                              LandBob;                                          		// 0x0894 (0x0004) [0x0000000000000000]              
	float                                              JumpBob;                                          		// 0x0898 (0x0004) [0x0000000000000000]              
	float                                              AppliedBob;                                       		// 0x089C (0x0004) [0x0000000000000000]              
	float                                              BobTime;                                          		// 0x08A0 (0x0004) [0x0000000000000000]              
	struct FVector                                     WalkBob;                                          		// 0x08A4 (0x000C) [0x0000000000000000]              
	float                                              FeignDeathBodyAtRestSpeed;                        		// 0x08B0 (0x0004) [0x0000000000000000]              
	float                                              FeignDeathStartTime;                              		// 0x08B4 (0x0004) [0x0000000000000000]              
	float                                              FeignDeathRecoveryStartTime;                      		// 0x08B8 (0x0004) [0x0000000000000000]              
	int                                                SuperHealthMax;                                   		// 0x08BC (0x0004) [0x0000000000000000]              
	class UClass*                                      SoundGroupClass;                                  		// 0x08C0 (0x0008) [0x0000000000000000]              
	class UClass*                                      CurrCharClassInfo;                                		// 0x08C8 (0x0008) [0x0000000000000000]              
	TArray< struct FName >                             TakeHitPhysicsFixedBones;                         		// 0x08D0 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FName >                             NoDriveBodies;                                    		// 0x08E0 (0x0010) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UForceFeedbackWaveform*                      FallingDamageWaveForm;                            		// 0x08F0 (0x0008) [0x0000000000000000]              
	float                                              AccumulateDamage;                                 		// 0x08F8 (0x0004) [0x0000000000000000]              
	float                                              AccumulationTime;                                 		// 0x08FC (0x0004) [0x0000000000000000]              
	float                                              LastHoverboardTime;                               		// 0x0900 (0x0004) [0x0000000000000000]              
	float                                              MinHoverboardInterval;                            		// 0x0904 (0x0004) [0x0000000000000000]              
	class UUTAnimBlendByDriving*                       DrivingNode;                                      		// 0x0908 (0x0008) [0x0000000000000000]              
	class UUTAnimBlendByVehicle*                       VehicleNode;                                      		// 0x0910 (0x0008) [0x0000000000000000]              
	class UUTAnimBlendByHoverboarding*                 HoverboardingNode;                                		// 0x0918 (0x0008) [0x0000000000000000]              
	float                                              ShieldBeltArmor;                                  		// 0x0920 (0x0004) [0x0000000000000020]              ( CPF_Net )
	float                                              VestArmor;                                        		// 0x0924 (0x0004) [0x0000000000000020]              ( CPF_Net )
	float                                              ThighpadArmor;                                    		// 0x0928 (0x0004) [0x0000000000000020]              ( CPF_Net )
	class AUTWeaponAttachment*                         CurrentWeaponAttachment;                          		// 0x092C (0x0008) [0x0000000000000000]              
	struct FName                                       WeaponSocket;                                     		// 0x0934 (0x0008) [0x0000000000000000]              
	struct FName                                       WeaponSocket2;                                    		// 0x093C (0x0008) [0x0000000000000000]              
	struct FName                                       PawnEffectSockets[ 0x2 ];                         		// 0x0944 (0x0010) [0x0000000000000000]              
	float                                              HeadOffset;                                       		// 0x0954 (0x0004) [0x0000000000000000]              
	float                                              HeadRadius;                                       		// 0x0958 (0x0004) [0x0000000000000000]              
	float                                              HeadHeight;                                       		// 0x095C (0x0004) [0x0000000000000000]              
	struct FName                                       HeadBone;                                         		// 0x0960 (0x0008) [0x0000000000000000]              
	class UStaticMeshComponent*                        HeadshotNeckAttachment;                           		// 0x0968 (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UClass*                                      TransInEffects[ 0x2 ];                            		// 0x0970 (0x0010) [0x0000000000000000]              
	struct FLinearColor                                TranslocateColor[ 0x2 ];                          		// 0x0980 (0x0020) [0x0000000000000000]              
	class UCameraAnim*                                 TransCameraAnim[ 0x3 ];                           		// 0x09A0 (0x0018) [0x0000000000000000]              
	class USoundCue*                                   ArmorHitSound;                                    		// 0x09B8 (0x0008) [0x0000000000000000]              
	class USoundCue*                                   SpawnSound;                                       		// 0x09C0 (0x0008) [0x0000000000000000]              
	class USoundCue*                                   TeleportSound;                                    		// 0x09C8 (0x0008) [0x0000000000000000]              
	struct FLinearColor                                SpawnProtectionColor;                             		// 0x09D0 (0x0010) [0x0000000000000000]              
	float                                              TeamBeaconPlayerInfoMaxDist;                      		// 0x09E0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UTexture*                                    SpeakingBeaconTexture;                            		// 0x09E4 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              MapSize;                                          		// 0x09EC (0x0004) [0x0000000000000000]              
	struct FTextureCoordinates                         IconCoords;                                       		// 0x09F0 (0x0010) [0x0000000000000000]              
	float                                              LastPainSound;                                    		// 0x0A00 (0x0004) [0x0000000000000000]              
	float                                              RagdollLifespan;                                  		// 0x0A04 (0x0004) [0x0000000000000000]              
	class AUTProjectile*                               AttachedProj;                                     		// 0x0A08 (0x0008) [0x0000000000000000]              
	float                                              MaxFootstepDistSq;                                		// 0x0A10 (0x0004) [0x0000000000000000]              
	float                                              MaxJumpSoundDistSq;                               		// 0x0A14 (0x0004) [0x0000000000000000]              
	class UClass*                                      HoverboardClass;                                  		// 0x0A18 (0x0008) [0x0000000000000000]              
	struct FDrivenWeaponPawnInfo                       LastDrivenWeaponPawn;                             		// 0x0A20 (0x0014) [0x0000000000000000]              
	class AUTClientSideWeaponPawn*                     ClientSideWeaponPawn;                             		// 0x0A34 (0x0008) [0x0000000000000000]              
	class UMaterialInterface*                          ShieldBeltMaterialInstance;                       		// 0x0A3C (0x0008) [0x0000000000000000]              
	class UMaterialInterface*                          ShieldBeltTeamMaterialInstances[ 0x4 ];           		// 0x0A44 (0x0020) [0x0000000000000000]              
	int                                                JumpBootCharge;                                   		// 0x0A64 (0x0004) [0x0000000000000000]              
	float                                              DefaultMeshScale;                                 		// 0x0A68 (0x0004) [0x0000000000000000]              
	struct FName                                       TauntNames[ 0x6 ];                                		// 0x0A6C (0x0030) [0x0000000000000000]              
	float                                              DesiredMeshScale;                                 		// 0x0A9C (0x0004) [0x0000000000000000]              
	struct FVector                                     CamOffset;                                        		// 0x0AA0 (0x000C) [0x0000000000000000]              
	class UParticleSystemComponent*                    BioBurnAway;                                      		// 0x0AAC (0x0008) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	float                                              BioBurnAwayTime;                                  		// 0x0AB4 (0x0004) [0x0000000000000000]              
	struct FName                                       BioEffectName;                                    		// 0x0AB8 (0x0008) [0x0000000000000000]              
	float                                              DeathTime;                                        		// 0x0AC0 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1981 ];

		return pClassPointer;
	};

	void HandDamp ( float LinDamp );
	void HandSpring ( float LinSpring );
	void BackDamp ( float LinDamp );
	void BackSpring ( float LinSpring );
	void PostBigTeleport ( );
	void PostTeleport ( class ATeleporter* OutTeleporter );
	class UClass* GetFamilyInfo ( );
	bool NeedToTurn ( struct FVector targ );
	void PossessedBy ( class AController* C, unsigned long bVehicleTransition );
	void OnInfiniteAmmo ( class UUTSeqAct_InfiniteAmmo* Action );
	void OnExitVehicle ( class UUTSeqAct_ExitVehicle* Action );
	void eventStuckFalling ( );
	void eventOnRanOver ( class ASVehicle* Vehicle, class UPrimitiveComponent* RunOverComponent, int WheelIndex );
	void eventRigidBodyCollision ( class UPrimitiveComponent* HitComponent, class UPrimitiveComponent* OtherComponent, int ContactIndex, struct FCollisionImpactData* RigidCollisionData );
	void TakeFallingDamage ( );
	void SetOverlayVisibility ( unsigned long bVisible );
	void eventTornOff ( );
	struct FRotator eventGetViewRotation ( );
	void AdjustCameraScale ( unsigned long bMoveCameraIn );
	void ModifyRotForDebugFreeCam ( struct FRotator* out_CamRot );
	bool IsLocationOnHead ( float AdditionalScale, struct FImpactInfo* Impact );
	void TakeDrowningDamage ( );
	void SwitchWeapon ( unsigned char NewGroup );
	void OnUseHoverboard ( class UUTSeqAct_UseHoverboard* Action );
	void ServerHoverboard ( );
	void eventTakeHitBlendedOut ( );
	void PlayTakeHitEffects ( );
	void PlayHit ( float Damage, class AController* InstigatedBy, struct FVector HitLocation, class UClass* DamageType, struct FVector Momentum, struct FTraceHitInfo HitInfo );
	void WeaponAttachmentChanged ( );
	void WeaponChanged ( class AUTWeapon* NewWeapon );
	void WeaponStoppedFiring ( class AWeapon* InWeapon, unsigned long bViaReplication );
	void WeaponFired ( class AWeapon* InWeapon, unsigned long bViaReplication, struct FVector HitLocation );
	void eventTakeDamage ( int Damage, class AController* EventInstigator, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
	bool GetPuttingDownWeapon ( );
	void SetPuttingDownWeapon ( unsigned long bNowPuttingDownWeapon );
	void SetHeadScale ( float NewScale );
	void eventReplicatedEvent ( struct FName VarName );
	void FireRateChanged ( );
	void SetBigHead ( );
	void FiringModeUpdated ( class AWeapon* InWeapon, unsigned char InFiringMode, unsigned long bViaReplication );
	void ForceRagdoll ( );
	void FeignDeath ( );
	void ServerFeignDeath ( );
	bool CheckValidLocation ( struct FVector FeignLocation );
	bool SetFeignEndLocation ( struct FVector HitLocation, struct FVector FeignLocation );
	void PlayFeignDeath ( );
	void FeignDeathDelayTimer ( );
	void eventStartFeignDeathRecoveryAnim ( );
	void ApplyWeaponOverlayFlags ( unsigned char NewFlags );
	void ClearWeaponOverlayFlag ( unsigned char FlagToClear );
	void SetWeaponOverlayFlag ( unsigned char FlagToSet );
	class UMaterialInterface* GetOverlayMaterial ( );
	class UMaterialInterface* GetShieldMaterialInstance ( unsigned long bTeamGame );
	void SetOverlayMaterial ( class UMaterialInterface* NewOverlay );
	class USoundCue* GetWeaponAmbientSound ( );
	void SetWeaponAmbientSound ( class USoundCue* NewAmbientSound );
	class USoundCue* GetPawnAmbientSound ( );
	void SetPawnAmbientSound ( class USoundCue* NewAmbientSound );
	void DisplayDebug ( class AHUD* HUD, float* out_YL, float* out_YPos );
	void PlayDyingSound ( );
	bool CanMultiJump ( );
	bool CanDoubleJump ( );
	void JumpOutOfWater ( struct FVector JumpDir );
	void eventLanded ( struct FVector HitNormal, class AActor* FloorActor );
	bool DoJump ( unsigned long bUpdating );
	void StopFlying ( );
	void StartFlying ( );
	void Gasp ( );
	void DoDoubleJump ( unsigned long bUpdating );
	bool PerformDodge ( unsigned char DoubleClickMove, struct FVector Dir, struct FVector Cross );
	struct FVector BotDodge ( struct FVector Dir );
	bool Dodge ( unsigned char DoubleClickMove );
	struct FVector GetWeaponStartTraceLocation ( class AWeapon* CurrentWeapon );
	bool CalcThirdPersonCam ( float fDeltaTime, struct FVector* out_CamLoc, struct FRotator* out_CamRot, float* out_FOV );
	void SetHeroCam ( struct FRotator* out_CamRot );
	bool TryNewCamRot ( class AUTPlayerController* PC, struct FRotator ViewRotation, float* CamDist );
	void FindGoodEndView ( class APlayerController* InPC, struct FRotator* GoodRotation );
	void SetThirdPersonCamera ( unsigned long bNewBehindView );
	bool CalcCamera ( float fDeltaTime, struct FVector* out_CamLoc, struct FRotator* out_CamRot, float* out_FOV );
	void AddDefaultInventory ( );
	void eventDestroyed ( );
	void DoingDeathAnim ( );
	void PlayDying ( class UClass* DamageType, struct FVector HitLoc );
	void TurnOffPawn ( );
	void SpawnGibs ( class UClass* UTDamageType, struct FVector HitLocation );
	class AUTGib* SpawnGib ( class UClass* GibClass, struct FName BoneName, class UClass* UTDamageType, struct FVector HitLocation, unsigned long bSpinGib );
	void SpawnHeadGib ( class UClass* UTDamageType, struct FVector HitLocation );
	bool ShouldGib ( class UClass* UTDamageType );
	void PlayJumpingSound ( );
	void PlayLandingSound ( );
	struct FName GetMaterialBelowFeet ( );
	void ActuallyPlayFootstepSound ( int FootDown );
	void eventPlayFootStepSound ( int FootDown );
	struct FString GetDebugName ( );
	bool GiveHealth ( int HealAmount, int HealMax );
	void eventHoldGameObject ( class AUDKCarriedObject* GameObj );
	void EnableInventoryPickup ( );
	void DropFlag ( );
	void AdjustDamage ( class AController* InstigatedBy, struct FVector HitLocation, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser, int* InDamage, struct FVector* Momentum );
	int ShieldAbsorb ( int Damage );
	int AbsorbDamage ( int CurrentShieldStrength, float AbsorptionRate, int* Damage );
	int GetShieldStrength ( );
	void ClientRestart ( );
	void eventStopDriving ( class AVehicle* V );
	void eventStartDriving ( class AVehicle* V );
	void SpawnTransEffect ( int TeamNum );
	void PlayTeleportEffect ( unsigned long bOut, unsigned long bSound );
	void PlaySpawnSound ( );
	void PlayTeleportSound ( );
	void DeactivateSpawnProtection ( );
	void FixedView ( struct FString VisibleMeshes );
	void SetMeshVisibility ( unsigned long bVisible );
	void SetWeaponAttachmentVisibility ( unsigned long bAttachmentVisible );
	void SetWeaponVisibility ( unsigned long bWeaponVisible );
	void eventEndViewTarget ( class APlayerController* PC );
	void eventBecomeViewTarget ( class APlayerController* PC );
	struct FVector GetPawnViewLocation ( );
	void eventUpdateEyeHeight ( float DeltaTime );
	void FaceRotation ( struct FRotator NewRotation, float DeltaTime );
	void eventPostRenderFor ( class APlayerController* PC, class UCanvas* Canvas, struct FVector CameraPosition, struct FVector CameraDir );
	struct FString GetScreenName ( );
	void OnModifyHealth ( class USeqAct_ModifyHealth* Action );
	void PlayVictoryAnimation ( );
	float GetEyeHeight ( );
	float RangedAttackTime ( );
	bool RecommendLongRangedAttack ( );
	unsigned char ChooseFireMode ( );
	bool StopWeaponFiring ( );
	bool BotFire ( unsigned long bFinished );
	bool StopFiring ( );
	void StartFire ( unsigned char FireModeNum );
	bool Died ( class AController* Killer, class UClass* DamageType, struct FVector HitLocation );
	void AddVelocity ( struct FVector NewVelocity, struct FVector HitLocation, class UClass* DamageType, struct FTraceHitInfo HitInfo );
	void eventFalling ( );
	void eventStuckOnPawn ( class APawn* OtherPawn );
	void JumpOffPawn ( );
	void gibbedBy ( class AActor* Other );
	void eventEncroachedBy ( class AActor* Other );
	bool eventEncroachingOn ( class AActor* Other );
	void TurnOff ( );
	struct FVector WeaponBob ( float BobDamping, float JumpDamping );
	void SpawnDefaultController ( );
	void OnPlayAnim ( class UUTSeqAct_PlayAnim* inAction );
	void PlayEmote ( struct FName InEmoteTag, int InPlayerID );
	void ServerPlayEmote ( struct FName InEmoteTag, int InPlayerID );
	void DoPlayEmote ( struct FName InEmoteTag, int InPlayerID );
	void PerformEmoteCommand ( struct FEmoteInfo EInfo, int PlayerID );
	void LeaveABloodSplatterDecal ( struct FVector HitLoc, struct FVector HitNorm );
	void SetWeapAnimType ( unsigned char AnimType );
	void SetAnimRateScale ( float RateScale );
	void SetHandIKEnabled ( unsigned long bEnabled );
	void eventPostInitAnimTree ( class USkeletalMeshComponent* SkelComp );
	void ReattachMesh ( );
	void UpdateShadowSettings ( unsigned long bWantShadow );
	void PostBeginPlay ( );
	void SetTeamColor ( );
	void SetFirstPersonArmsInfo ( class USkeletalMesh* FirstPersonArmMesh, class UMaterialInterface* ArmMaterial );
	void NotifyTeamChanged ( );
	void ResetCharPhysState ( );
	void SetPawnRBChannels ( unsigned long bRagdollMode );
	void SetCharacterMeshInfo ( class USkeletalMesh* SkelMesh, class UMaterialInterface* HeadMaterial, class UMaterialInterface* BodyMaterial );
	void SetCharacterClassFromInfo ( class UClass* Info );
	bool VerifyBodyMaterialInstance ( );
	void SetArmsSkin ( class UMaterialInterface* NewMaterial );
	void SetSkin ( class UMaterial* NewMaterial );
	void SetInvisible ( unsigned long bNowInvisible );
	void SetBodyMatColor ( struct FLinearColor NewBodyMatColor, float NewOverlayDuration );
	void ClearBodyMatColor ( );
	void eventSetWalking ( unsigned long bNewIsWalking );
	void RenderMapIcon ( class UUTMapInfo* MP, class UCanvas* Canvas, class AUTPlayerController* PlayerOwner, struct FLinearColor FinalColor );
	bool InCombat ( );
	bool PoweredUp ( );
	void eventHeadVolumeChange ( class APhysicsVolume* newHeadVolume );
	void eventFellOutOfWorld ( class UClass* dmgType );
	class AUTPlayerReplicationInfo* GetUTPlayerReplicationInfo ( );
	float AdjustedStrength ( );
	void AdjustPPEffects ( class AUTPlayerController* PC, unsigned long bRemove );
};

UClass* AUTPawn::pClassPointer = NULL;

// Class UTGame.UTHUDBase
// 0x0088 (0x07A4 - 0x071C)
class AUTHUDBase : public AUDKHUD
{
public:
	class UGFxUIScoreboard*                            ScoreboardMovie;                                  		// 0x071C (0x0008) [0x0000000000000000]              
	class UGFxUI_PauseMenu*                            PauseMenuMovie;                                   		// 0x0724 (0x0008) [0x0000000000000000]              
	class UClass*                                      MusicManagerClass;                                		// 0x072C (0x0008) [0x0000000000000000]              
	class AUTPlayerController*                         UTPlayerOwner;                                    		// 0x0734 (0x0008) [0x0000000000000000]              
	class AUTGameReplicationInfo*                      UTGRI;                                            		// 0x073C (0x0008) [0x0000000000000000]              
	unsigned long                                      bIsSplitScreen : 1;                               		// 0x0744 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bEnableActorOverlays : 1;                         		// 0x0744 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bCrosshairShow : 1;                               		// 0x0744 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bCrosshairOnFriendly : 1;                         		// 0x0744 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bGreenCrosshair : 1;                              		// 0x0744 (0x0004) [0x0000000000000000] [0x00000010] 
	struct FTextureCoordinates                         ToolTipSepCoords;                                 		// 0x0748 (0x0010) [0x0000000000000000]              
	float                                              LastTimeTooltipDrawn;                             		// 0x0758 (0x0004) [0x0000000000000000]              
	class UTexture2D*                                  IconHudTexture;                                   		// 0x075C (0x0008) [0x0000000000000002]              ( CPF_Const )
	struct FString                                     ConsoleIconFontClassName;                         		// 0x0764 (0x0010) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	float                                              ConfiguredCrosshairScaling;                       		// 0x0774 (0x0004) [0x0000000000000000]              
	float                                              LastPickupTime;                                   		// 0x0778 (0x0004) [0x0000000000000000]              
	struct FColor                                      BlackColor;                                       		// 0x077C (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FColor                                      GoldColor;                                        		// 0x0780 (0x0004) [0x0000000000000002]              ( CPF_Const )
