/*
#############################################################################################
# Mortal Online (Unknown) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: NowGame_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_eMT_ShieldBase                                     8
#define CONST_eMT_ShieldCoat                                     16
#define CONST_eMT_ShieldFrame                                    32
#define CONST_eMT_Ranged                                         64
#define CONST_eMT_Weapon                                         128
#define CONST_eMT_WeaponCoat                                     256
#define CONST_HELM_ROT_DELTA_LIMIT                               15000
#define CONST_HELM_OFFSET_LIMIT                                  0.5f

	eActionEvent_PlaceTSWall                           = 17,
	eActionEvent_PlaceTSUpgradeTier                    = 18,
	eActionEvent_PlaceTSPatrolSphere                   = 19,
	eActionEvent_PlaceTSMine                           = 20,
	eActionEvent_PlaceTSGate                           = 21,
	eActionEvent_MAX                                   = 22
};*/

// Enum NowGame.OnlineSubsystemNowGame.eGMState
/*enum eGMState
{
	eGMState_NotValidGmState                           = 0,
	eGMState_Invincible                                = 1,
	eGMState_Invisible                                 = 2,
	eGMState_InvisFly                                  = 3,
	eGMState_Ghost                                     = 4,
	eGMState_MAX                                       = 5
};*/

// Enum NowGame.StatManager.GFXUpdateTypes
/*enum GFXUpdateTypes
{
	GFX_HPCUR                                          = 0,
	GFX_MPCUR                                          = 1,
	GFX_SPCUR                                          = 2,
	GFX_HPMAX                                          = 3,
	GFX_MPMAX                                          = 4,
	GFX_SPMAX                                          = 5,
	GFX_DISPNAME                                       = 6,
	GFX_FLAG                                           = 7,
	GFX_COMBAT                                         = 8,
	GFX_HPTHR                                          = 9,
	GFX_MPTHR                                          = 10,
	GFX_SPTHR                                          = 11,
	GFX_HUNGER                                         = 12,
	GFX_POTION                                         = 13,
	GFX_MAX                                            = 14
};*/

// Enum NowGame.StatManager.GFXUpdateTargetTypes
/*enum GFXUpdateTargetTypes
{
	GFXTGT_SELF                                        = 0,
	GFXTGT_TARGET                                      = 1,
	GFXTGT_MOUNT                                       = 2,
	GFXTGT_MAX                                         = 3
};*/

// Enum NowGame.UIInfo.UIInfoType
/*enum UIInfoType
{
	UIInfo_None                                        = 0,
	UIInfo_TalkerStable                                = 1,
	UIInfo_TalkerCityBrain                             = 2,
	UIInfo_TalkerNoobHelp                              = 3,
	UIInfo_TalkerTaxManager                            = 4,
	UIInfo_TalkerCropsFarmer                           = 5,
	UIInfo_TalkerAnimalBreeder                         = 6,
	UIInfo_TalkerGateKeeper                            = 7,
	UIInfo_TalkerMiner                                 = 8,
	UIInfo_TalkerTerritoryVendor                       = 9,
	UIInfo_TalkerTerritoryLibrary                      = 10,
	UIInfo_MAX                                         = 11
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class NowGame.AnimNodeBlendByMountRotation
// 0x0040 (0x0164 - 0x0124)
class UAnimNodeBlendByMountRotation : public UAnimNodeBlendList
{
public:
	class UAnimNodeAdditiveBlending*                   TurnAdditiveAnimationNode;                        		// 0x0124 (0x0004) [0x0000000000000000]              
	class UAnimNodeBlendList*                          TurnBlendList;                                    		// 0x0128 (0x0004) [0x0000000000000000]              
	struct FName                                       TurnAdditiveNodeName;                             		// 0x012C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                TurnAnimMaxSpeed;                                 		// 0x0134 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UAnimNodeAdditiveBlending*                   LeanAdditiveAnimationNode;                        		// 0x0138 (0x0004) [0x0000000000000000]              
	class UAnimNodeBlendList*                          LeanBlendList;                                    		// 0x013C (0x0004) [0x0000000000000000]              
	struct FName                                       LeanAnimationNodeName;                            		// 0x0140 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                LeanGallopMinSpeed;                               		// 0x0148 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                LeanGallopMaxSpeed;                               		// 0x014C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                LeanWalkMinSpeed;                                 		// 0x0150 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                LeanWalkMaxSpeed;                                 		// 0x0154 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                StillTurnMaxSpeed;                                		// 0x0158 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              LastKnownYaw;                                     		// 0x015C (0x0004) [0x0000000000000000]              
	int                                                LastTurnStyle;                                    		// 0x0160 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1502 ];

		return pClassPointer;
	};

	class ANowPlayerController* GetPlayerController ( );
	class ANowPawn* GetPawn ( );
	class ANowAtlasAvatarAiMount* GetAtlasAvatar ( );
	void SetActiveChild ( int ChildIndex, float BlendTime );
};

UClass* UAnimNodeBlendByMountRotation::pClassPointer = NULL;

// Class NowGame.AnimNodeBlendBySpeedMount
// 0x0048 (0x01BC - 0x0174)
class UAnimNodeBlendBySpeedMount : public UAnimNodeBlendBySpeed
{
public:
	class UAnimNodeBlendListMountAdditive*             SpeedAnimNode;                                    		// 0x0174 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UAnimNodeAdditiveBlending*                   SpeedAdditiveAnimationNode;                       		// 0x0178 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	struct FName                                       SpeedAdditiveNodeName;                            		// 0x017C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       SpeedAnimNodeName;                                		// 0x0184 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       ThrottleAnimName;                                 		// 0x018C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       BreakAnimName;                                    		// 0x0194 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       ThrottleSharpAnimName;                            		// 0x019C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       BreakSharpAnimName;                               		// 0x01A4 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	float                                              LastMountSpeed;                                   		// 0x01AC (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                LastSpeedStyle;                                   		// 0x01B0 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	int                                                LastActiveChild;                                  		// 0x01B4 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	float                                              PlayAnimTimeLeft;                                 		// 0x01B8 (0x0004) [0x0000000000002000]              ( CPF_Transient )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1503 ];

		return pClassPointer;
	};

	class ANowPlayerController* GetPlayerController ( );
	class ANowPawn* GetPawn ( );
	class ANowAtlasAvatarAiMount* GetAtlasAvatar ( );
	void SetActiveChild ( int ChildIndex, float BlendTime );
};

UClass* UAnimNodeBlendBySpeedMount::pClassPointer = NULL;

// Class NowGame.AnimNodeBlendListAttacksAi
// 0x0008 (0x012C - 0x0124)
class UAnimNodeBlendListAttacksAi : public UAnimNodeBlendList
{
public:
	unsigned long                                      bPlaying : 1;                                     		// 0x0124 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              fTimeLeft;                                        		// 0x0128 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1504 ];

		return pClassPointer;
	};

};

UClass* UAnimNodeBlendListAttacksAi::pClassPointer = NULL;

// Class NowGame.AnimNodeBlendListBool
// 0x0004 (0x0128 - 0x0124)
class UAnimNodeBlendListBool : public UAnimNodeBlendList
{
public:
	unsigned long                                      bIsBlockingBool : 1;                              		// 0x0124 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bInCombatBool : 1;                                		// 0x0124 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      bIsFemaleBool : 1;                                		// 0x0124 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      bMounted : 1;                                     		// 0x0124 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1505 ];

		return pClassPointer;
	};

};

UClass* UAnimNodeBlendListBool::pClassPointer = NULL;

// Class NowGame.AnimNodeBlendListBoolAi
// 0x0004 (0x0128 - 0x0124)
class UAnimNodeBlendListBoolAi : public UAnimNodeBlendList
{
public:
	unsigned long                                      bIsAttackingBool : 1;                             		// 0x0124 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      bBlockingBool : 1;                                		// 0x0124 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1506 ];

		return pClassPointer;
	};

};

UClass* UAnimNodeBlendListBoolAi::pClassPointer = NULL;

// Class NowGame.AnimNodeBlendListInteractionAi
// 0x0004 (0x0128 - 0x0124)
class UAnimNodeBlendListInteractionAi : public UAnimNodeBlendList
{
public:
	float                                              fTimeLeft;                                        		// 0x0124 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1507 ];

		return pClassPointer;
	};

	void SetActiveChild ( int ChildIndex, float BlendTime );
};

UClass* UAnimNodeBlendListInteractionAi::pClassPointer = NULL;

// Class NowGame.AnimNodeBlendListLastAttackType
// 0x0000 (0x0124 - 0x0124)
class UAnimNodeBlendListLastAttackType : public UAnimNodeBlendList
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1508 ];

		return pClassPointer;
	};

};

UClass* UAnimNodeBlendListLastAttackType::pClassPointer = NULL;

// Class NowGame.AnimNodeBlendListMountAdditive
// 0x0000 (0x0124 - 0x0124)
class UAnimNodeBlendListMountAdditive : public UAnimNodeBlendList
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1509 ];

		return pClassPointer;
	};

	void SetIndexAnim ( int Index, struct FName NewAnimName );
};

UClass* UAnimNodeBlendListMountAdditive::pClassPointer = NULL;

// Class NowGame.AnimNodeBlendListMountSpeed
// 0x0008 (0x012C - 0x0124)
class UAnimNodeBlendListMountSpeed : public UAnimNodeBlendList
{
public:
	float                                              TransitionTime;                                   		// 0x0124 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              TransitionLeft;                                   		// 0x0128 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1510 ];

		return pClassPointer;
	};

	void SetActiveChild ( int ChildIndex, float BlendTime );
};

UClass* UAnimNodeBlendListMountSpeed::pClassPointer = NULL;

// Class NowGame.AnimNodeBlendListPlayOnce
// 0x0004 (0x0128 - 0x0124)
class UAnimNodeBlendListPlayOnce : public UAnimNodeBlendList
{
public:
	float                                              fTimeLeft;                                        		// 0x0124 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1511 ];

		return pClassPointer;
	};

	void SetActiveChild ( int ChildIndex, float BlendTime );
};

UClass* UAnimNodeBlendListPlayOnce::pClassPointer = NULL;

// Class NowGame.AnimNodeInCombatAi
// 0x0000 (0x0124 - 0x0124)
class UAnimNodeInCombatAi : public UAnimNodeBlendList
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1512 ];

		return pClassPointer;
	};

};

UClass* UAnimNodeInCombatAi::pClassPointer = NULL;

// Class NowGame.AnimNodeIsFemale
// 0x0000 (0x0124 - 0x0124)
class UAnimNodeIsFemale : public UAnimNodeBlendList
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1513 ];

		return pClassPointer;
	};

};

UClass* UAnimNodeIsFemale::pClassPointer = NULL;

// Class NowGame.CharacterSlot
// 0x009C (0x0384 - 0x02E8)
class ACharacterSlot : public AActor
{
public:
	class UStaticMeshComponent*                        BaseMesh;                                         		// 0x02E8 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UStaticMeshComponent*                        BaseMeshExtra;                                    		// 0x02EC (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class USkeletalMeshComponentGeneratedPlayerNew*    BodyMesh;                                         		// 0x02F0 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class USkeletalMeshComponent*                      BodyMeshStone;                                    		// 0x02F4 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class ANowStaticMeshActorWeapon*                   RWeapon;                                          		// 0x02F8 (0x0004) [0x0000000000000000]              
	class ANowStaticMeshActorWeapon*                   LWeapon;                                          		// 0x02FC (0x0004) [0x0000000000000000]              
	class ULightEnvironmentComponent*                  LightEnvironment;                                 		// 0x0300 (0x0004) [0x000000000408000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UMaterialInstance*                           pStoneMaterial;                                   		// 0x0304 (0x0004) [0x0000000000002000]              ( CPF_Transient )
	class UPointLightComponent*                        FlagLight;                                        		// 0x0308 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	struct FColor                                      FlagColor[ 0xA ];                                 		// 0x030C (0x0028) [0x0000000000000000]              
	int                                                iSlotIndex;                                       		// 0x0334 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              fMoveAnim;                                        		// 0x0338 (0x0004) [0x0000000000000000]              
	struct FVector                                     vFinalLoc;                                        		// 0x033C (0x000C) [0x0000000000000000]              
	struct FVector                                     vUpLoc;                                           		// 0x0348 (0x000C) [0x0000000000000000]              
	struct FVector                                     vDownLoc;                                         		// 0x0354 (0x000C) [0x0000000000000000]              
	struct FString                                     sCharacterName;                                   		// 0x0360 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     sCharacterData;                                   		// 0x036C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                iFlag;                                            		// 0x0378 (0x0004) [0x0000000000000000]              
	int                                                iMurderCount;                                     		// 0x037C (0x0004) [0x0000000000000000]              
	unsigned long                                      bAlive : 1;                                       		// 0x0380 (0x0004) [0x0000000000000000] [0x00000001] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1514 ];

		return pClassPointer;
	};

	void eventSetCharacterSize ( float fSize );
	void GenerateMeshes ( );
	void eventTick ( float fDeltaTime );
	void TickInitAnimation ( float fDeltaTime );
	void SmallStoneEffect ( class USkeletalMeshComponent* Component );
	void Hide ( );
	void DeleteAnim ( );
	void Delete ( );
	void DeSelect ( );
	void Select ( );
	void TriggerOutAnim ( );
	void eventDoOutAnimation ( );
	void eventDoInitAnimation ( );
	void PostBeginPlay ( );
	void ParseData ( );
	bool CanCustomize ( );
};

UClass* ACharacterSlot::pClassPointer = NULL;

// Class NowGame.CharacterSlotCreate
// 0x0014 (0x0398 - 0x0384)
class ACharacterSlotCreate : public ACharacterSlot
{
public:
	TArray< struct FsRaceIntPair >                     vRaceToInt;                                       		// 0x0384 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                iRotationDelta;                                   		// 0x0390 (0x0004) [0x0000000000000000]              
	int                                                iRotated;                                         		// 0x0394 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1515 ];

		return pClassPointer;
	};

	void DeltaRotation ( int iRotation );
	void eventSetCharacterSize ( float fSize );
	int RaceToInt ( struct FString sString );
	void SelectedRaces ( struct FString sRace1, struct FString sRace2, struct FString sRace3, struct FString sRace4 );
	void SetRaceState ( int iNewState );
	void Select ( );
	void GenerateMeshes ( );
	void eventDoInitAnimation ( );
	void PlayCustom ( struct FName AnimName );
	void eventTick ( float fDeltaTime );
};

UClass* ACharacterSlotCreate::pClassPointer = NULL;

// Class NowGame.ChatManager
// 0x0170 (0x01AC - 0x003C)
class UChatManager : public UObject
{
public:
	class ANowPlayerController*                        MyController;                                     		// 0x003C (0x0004) [0x0000000000000000]              
	class ANowPawn*                                    MyPawn;                                           		// 0x0040 (0x0004) [0x0000000000000000]              
	struct FChatChannels                               Channels[ 0x15 ];                                 		// 0x0044 (0x0150) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                iNrChan;                                          		// 0x0194 (0x0004) [0x0000000000000000]              
	float                                              cmdCooldown;                                      		// 0x0198 (0x0004) [0x0000000000000000]              
	float                                              chatCooldown;                                     		// 0x019C (0x0004) [0x0000000000000000]              
	TArray< struct FMessageLog >                       MsgLog;                                           		// 0x01A0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1516 ];

		return pClassPointer;
	};

	bool eventIsValidName ( struct FString sName, int iMaxChar );
	void DoWhoSetSurname ( TArray< struct FString > msgParts );
	class AWorldInfo* GetWorldInfo ( );
	void CmdMurderCount ( );
	void CmdTestmode ( );
	void CmdStopReading ( );
	void CmdEndTutorial ( );
	void CmdStatLossCount ( );
	void CmdCallGuards ( );
	void CmdWhoMe ( );
	void CmdWho ( );
	void CmdFriendCommand ( struct FString sInput );
	void CmdPet ( struct FString sInput );
	void CmdTrade ( class ANowAtlasAvatar* aActor );
	bool CheckCommandOk ( struct FString WhatCommand );
	bool HandleAiCommand ( struct FString sCommand, TArray< struct FString > messageparts );
	bool HandleTSCommand ( struct FString sCommand, TArray< struct FString > messageparts );
	bool HandleDebugCommand ( struct FString sCommand, TArray< struct FString > messageparts );
	void CmdMod ( struct FString sCommand, struct FString sMessage, unsigned long bIgnoreMeParse );
	struct FString CheckCommandForMeAndTgt ( struct FString sMessage, unsigned long bIgnoreMeParse );
	void CmdCast ( struct FString sCommand );
	void CmdSkill ( struct FString sCommand );
	void CmdEmote ( struct FString sCommand );
	void CmdOrder ( struct FString sCommand );
	void CmdOptions ( struct FString sCommand );
	void HandleOutgoingCommand ( struct FString sMessage );
	bool CheckForChatSpam ( );
	bool CheckForCommandSpam ( float fMinTime );
	void CheckMyPawn ( );
	bool ChanGuild ( struct FString sMessage );
	class UOnlineSubsystemNowGame* GetSubSystem ( );
	bool CheckForChannelCommand ( struct FString sMessage );
	bool CheckForTalkCommand ( struct FString sMessage );
	bool CheckChatText ( struct FString InText );
	bool CheckOkChar ( struct FString InText );
	void HandleOutgoingChat ( struct FString sMessage );
	void HandleOutgoingMessage ( struct FString sMessage );
	class UNowGFXHudScene* GetGFXHud ( );
	bool IsNumber ( struct FString Number );
	class AActor* GetActorFromNameOrId ( struct FString* whatName );
	int GetChannelFromString ( struct FString sString );
	int eventGetLogMessageChannelIndex ( int iChannel );
	void LogMessage ( int iChannel, struct FString sMsg, struct FString sTalker );
	void ShowMessage ( int iChannel, struct FString sMsg, struct FString sTalker );
	void eventHandleIncomingMessage ( struct FString sMessage );
	void InitManager ( );
	void ToggleOculus ( );
	void ToggleUnitTimes ( );
	void ToggleFPS ( );
	void DropLoot ( );
	void StartDuel ( class ANowPawn* pTarget );
	bool IsAvatarId ( struct FString sString );
};

UClass* UChatManager::pClassPointer = NULL;

// Class NowGame.ClientEffect
// 0x0040 (0x007C - 0x003C)
class UClientEffect : public UObject
{
public:
	class ANowPlayerController*                        MyController;                                     		// 0x003C (0x0004) [0x0000000000000000]              
	class AWorldInfo*                                  MyWorldInfo;                                      		// 0x0040 (0x0004) [0x0000000000000000]              
	TArray< struct FEffectInfo >                       EffectInfos;                                      		// 0x0044 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              TimePassed;                                       		// 0x0050 (0x0004) [0x0000000000000000]              
	float                                              RelativeTimePct;                                  		// 0x0054 (0x0004) [0x0000000000000000]              
	float                                              StartTime;                                        		// 0x0058 (0x0004) [0x0000000000000000]              
	unsigned long                                      bSingleEffect : 1;                                		// 0x005C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bClearEffectsOnStart : 1;                         		// 0x005C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bClearEffectsOnEnd : 1;                           		// 0x005C (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bPlayEffectOnMove : 1;                            		// 0x005C (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bNowIgnoreInputWhilePlaying : 1;                  		// 0x005C (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bNowIgnoreRotationWhilePlaying : 1;               		// 0x005C (0x0004) [0x0000000000000000] [0x00000020] 
	struct FVector                                     vSetVel;                                          		// 0x0060 (0x000C) [0x0000000000000000]              
	class UClass*                                      PlayOnMoveEffect;                                 		// 0x006C (0x0004) [0x0000000000000000]              
	struct FVector                                     lastKnownPos;                                     		// 0x0070 (0x000C) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1517 ];

		return pClassPointer;
	};

	void SetScreenColor ( struct FColor WhatColor );
	void Tick ( float DeltaTime );
	void AttachTo ( class AController* aController );
};

UClass* UClientEffect::pClassPointer = NULL;

// Class NowGame.ClientViewMode
// 0x0014 (0x0050 - 0x003C)
class UClientViewMode : public UObject
{
public:
	class ANowPlayerController*                        MyController;                                     		// 0x003C (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   DenyMat;                                          		// 0x0040 (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   OkMat;                                            		// 0x0044 (0x0004) [0x0000000000000000]              
	class UMaterialInstanceConstant*                   SelectMat;                                        		// 0x0048 (0x0004) [0x0000000000000000]              
	unsigned long                                      bUseCanvasTick : 1;                               		// 0x004C (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bUseMouseInput : 1;                               		// 0x004C (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bUseNumberInput : 1;                              		// 0x004C (0x0004) [0x0000000000000000] [0x00000004] 

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1518 ];

		return pClassPointer;
	};

	void NumberPress ( int iNumber );
	bool Escape ( );
	void RightClick ( );
	void LeftClick ( );
	void CanvasTick ( class UCanvas* C );
	bool PressedUse ( );
	void RemoveViewmode ( );
	void Tick ( float DeltaTime );
	void AttachTo ( class AController* aController );
};

UClass* UClientViewMode::pClassPointer = NULL;

// Class NowGame.ClientViewModePackageMode
// 0x003C (0x008C - 0x0050)
class UClientViewModePackageMode : public UClientViewMode
{
public:
	int                                                iByteSentSec;                                     		// 0x0050 (0x0004) [0x0000000000000000]              
	int                                                iByteRecvSec;                                     		// 0x0054 (0x0004) [0x0000000000000000]              
	int                                                iByteSentAverage;                                 		// 0x0058 (0x0004) [0x0000000000000000]              
	int                                                iByteRecvAverage;                                 		// 0x005C (0x0004) [0x0000000000000000]              
	int                                                iByteSentTotal;                                   		// 0x0060 (0x0004) [0x0000000000000000]              
	int                                                iByteRecvTotal;                                   		// 0x0064 (0x0004) [0x0000000000000000]              
	TArray< int >                                      vByteSent;                                        		// 0x0068 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      vByteRecv;                                        		// 0x0074 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      vPackageIDReceive;                                		// 0x0080 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1519 ];

		return pClassPointer;
	};

	bool Escape ( );
	void CanvasTick ( class UCanvas* C );
	void Tick ( float DeltaTime );
	void AttachTo ( class AController* aController );
	void GetPackageData ( );
	void ResetPackageData ( );
};

UClass* UClientViewModePackageMode::pClassPointer = NULL;

// Class NowGame.ClientViewModeStructureBuild
// 0x00B8 (0x0108 - 0x0050)
class UClientViewModeStructureBuild : public UClientViewMode
{
public:
	class ANowStaticMeshActorSpawnable*                PreviewAOEActor;                                  		// 0x0050 (0x0004) [0x0000000000000000]              
	class ANowStaticMeshActorSpawnable*                PreviewActor;                                     		// 0x0054 (0x0004) [0x0000000000000000]              
	class ANowStaticMeshActorSpawnable*                HelperMesh;                                       		// 0x0058 (0x0004) [0x0000000000000000]              
	struct FVector                                     LastLocation;                                     		// 0x005C (0x000C) [0x0000000000000000]              
	struct FRotator                                    LastRotation;                                     		// 0x0068 (0x000C) [0x0000000000000000]              
	class UStaticMesh*                                 PreviewMesh;                                      		// 0x0074 (0x0004) [0x0000000000000000]              
	class UOnlineSubsystemNowGame*                     NowOnlineSub;                                     		// 0x0078 (0x0004) [0x0000000000000000]              
	int                                                PlaceState;                                       		// 0x007C (0x0004) [0x0000000000000000]              
	unsigned long                                      bOkMat : 1;                                       		// 0x0080 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bOKToPlace : 1;                                   		// 0x0080 (0x0004) [0x0000000000000000] [0x00000002] 
	class UStaticMesh*                                 HelperMeshes[ 0x5 ];                              		// 0x0084 (0x0014) [0x0000000000000000]              
	struct FVector                                     vCollisionSize;                                   		// 0x0098 (0x000C) [0x0000000000000000]              
	struct FVector                                     vCornerAdd[ 0x4 ];                                		// 0x00A4 (0x0030) [0x0000000000000000]              
	class UParticleSystem*                             PlaceCornerParticle;                              		// 0x00D4 (0x0004) [0x0000000000000000]              
	class USoundCue*                                   PlaceCornerSound;                                 		// 0x00D8 (0x0004) [0x0000000000000000]              
	float                                              fInitalZ;                                         		// 0x00DC (0x0004) [0x0000000000000000]              
	float                                              fMaxMoveZ;                                        		// 0x00E0 (0x0004) [0x0000000000000000]              
	float                                              fMinMoveZ;                                        		// 0x00E4 (0x0004) [0x0000000000000000]              
	float                                              fMaxPitch;                                        		// 0x00E8 (0x0004) [0x0000000000000000]              
	float                                              fMinPitch;                                        		// 0x00EC (0x0004) [0x0000000000000000]              
	struct FString                                     sPlaceErrorMsg;                                   		// 0x00F0 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FVector >                           vMyConnectPoints;                                 		// 0x00FC (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1520 ];

		return pClassPointer;
	};

	void RemoveViewmode ( );
	bool Escape ( );
	void DrawDebugCylinder ( struct FVector Start, struct FVector End, float Radius, int Segments, unsigned char R, unsigned char G, unsigned char B, unsigned long bPersistentLines );
	void DrawMoDebugLine ( struct FVector LineStart, struct FVector LineEnd, unsigned char R, unsigned char G, unsigned char B, unsigned long bPersistentLines );
	bool IsInGuildTerritory ( struct FVector vLoc );
	void CheckForPreviewAOEActor ( );
	float GetHouseAoeRange ( class ANowAtlasAvatarPlayerHouse* myHouse );
	bool VerifyPoint ( struct FVector WhatPoint, unsigned long bMessage );
	bool GroundPoint ( struct FVector* WhatPoint );
	void ResetPreviewMaterials ( );
	struct FVector GetPlacePoint ( );
	float CalcHeightAdd ( float fMouseY );
	bool CornerCheck ( struct FVector WhatPoint );
	void UpdateStructureHelpers ( );
	bool FinalPlaceStructureCheck ( );
	void Tick ( float DeltaTime );
	void InitPylonInfo ( );
	void SetDenyMat ( );
	void SetOkMat ( );
	void UpdateHelperMesh ( );
	void GiveStateMessage ( );
	void eventPlayPlaceEffect ( );
	bool CheckTouching ( );
	bool PressedUse ( );
	void AttachTo ( class AController* aController );
	void GetInfo ( );
};

UClass* UClientViewModeStructureBuild::pClassPointer = NULL;

// Class NowGame.ClientViewModeGateBuild
// 0x0024 (0x012C - 0x0108)
class UClientViewModeGateBuild : public UClientViewModeStructureBuild
{
public:
	TArray< struct FsWallConnect >                     WallConnectPoints;                                		// 0x0108 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                iWallConnectIndex;                                		// 0x0114 (0x0004) [0x0000000000000000]              
	int                                                iWallConnectIndexB;                               		// 0x0118 (0x0004) [0x0000000000000000]              
	int                                                iMyConnectPoint;                                  		// 0x011C (0x0004) [0x0000000000000000]              
	float                                              fWallWidth;                                       		// 0x0120 (0x0004) [0x0000000000000000]              
	class ANowStaticMeshActorSpawnable*                LinkMeshA;                                        		// 0x0124 (0x0004) [0x0000000000000000]              
	class ANowStaticMeshActorSpawnable*                LinkMeshB;                                        		// 0x0128 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1521 ];

		return pClassPointer;
	};

	void RemoveViewmode ( );
	void DrawDebugCylinder ( struct FVector Start, struct FVector End, float Radius, int Segments, unsigned char R, unsigned char G, unsigned char B, unsigned long bPersistentLines );
	struct FVector FindConnectPoint ( );
	struct FVector FindSecondConnectPoint ( );
	struct FVector FindMyConnectPoint ( struct FVector vCloseTo );
	void Tick ( float DeltaTime );
	struct FVector GetPlacePoint ( );
	void GiveStateMessage ( );
	bool Escape ( );
	void AttachTo ( class AController* aController );
	void eventPlayPlaceEffect ( );
	void GetWallConnectPoints ( );
	bool FinalPlaceStructureCheck ( );
	bool CheckTouching ( );
	bool PressedUse ( );
	void GetInfo ( );
};

UClass* UClientViewModeGateBuild::pClassPointer = NULL;

// Class NowGame.ClientViewModeMineBuild
// 0x001C (0x0124 - 0x0108)
class UClientViewModeMineBuild : public UClientViewModeStructureBuild
{
public:
	class ANowStaticMeshActorSpawnable*                LinkMesh;                                         		// 0x0108 (0x0004) [0x0000000000000000]              
	struct FString                                     m_sMineType;                                      		// 0x010C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FVector                                     m_vStonePos;                                      		// 0x0118 (0x000C) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1522 ];

		return pClassPointer;
	};

	void RemoveViewmode ( );
	bool CloseToStone ( );
	bool FinalPlaceStructureCheck ( );
	bool GroundPoint ( struct FVector* WhatPoint );
	void Tick ( float DeltaTime );
	bool PressedUse ( );
	void AttachTo ( class AController* aController );
};

UClass* UClientViewModeMineBuild::pClassPointer = NULL;

// Class NowGame.ClientViewModePatrolSphereBuild
// 0x0004 (0x010C - 0x0108)
class UClientViewModePatrolSphereBuild : public UClientViewModeStructureBuild
{
public:
	class ANowStaticMeshActorSpawnable*                RadiusPreviewActor;                               		// 0x0108 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1523 ];

		return pClassPointer;
	};

	void RemoveViewmode ( );
	void Tick ( float DeltaTime );
	void AttachTo ( class AController* aController );
};

UClass* UClientViewModePatrolSphereBuild::pClassPointer = NULL;

// Class NowGame.ClientViewModeWallBuild
// 0x0024 (0x012C - 0x0108)
class UClientViewModeWallBuild : public UClientViewModeStructureBuild
{
public:
	TArray< struct FsWallConnect >                     WallConnectPoints;                                		// 0x0108 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                iWallConnectIndex;                                		// 0x0114 (0x0004) [0x0000000000000000]              
	int                                                iWallConnectIndexB;                               		// 0x0118 (0x0004) [0x0000000000000000]              
	int                                                iMyConnectPoint;                                  		// 0x011C (0x0004) [0x0000000000000000]              
	float                                              fWallWidth;                                       		// 0x0120 (0x0004) [0x0000000000000000]              
	class ANowStaticMeshActorSpawnable*                LinkMeshA;                                        		// 0x0124 (0x0004) [0x0000000000000000]              
	class ANowStaticMeshActorSpawnable*                LinkMeshB;                                        		// 0x0128 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1524 ];

		return pClassPointer;
	};

	void RemoveViewmode ( );
	void DrawDebugCylinder ( struct FVector Start, struct FVector End, float Radius, int Segments, unsigned char R, unsigned char G, unsigned char B, unsigned long bPersistentLines );
	struct FVector FindConnectPoint ( );
	struct FVector FindSecondConnectPoint ( );
	struct FVector FindMyConnectPoint ( struct FVector vCloseTo );
	void Tick ( float DeltaTime );
	struct FVector GetPlacePoint ( );
	void GiveStateMessage ( );
	bool Escape ( );
	void AttachTo ( class AController* aController );
	void eventPlayPlaceEffect ( );
	void GetWallConnectPoints ( );
	bool FinalPlaceStructureCheck ( );
	bool CheckTouching ( );
	bool PressedUse ( );
	void GetInfo ( );
};

UClass* UClientViewModeWallBuild::pClassPointer = NULL;

// Class NowGame.ClientViewModeTSNpcPlace
// 0x003C (0x008C - 0x0050)
class UClientViewModeTSNpcPlace : public UClientViewMode
{
public:
	class UStaticMesh*                                 GhostMesh;                                        		// 0x0050 (0x0004) [0x0000000000000000]              
	TArray< class ANowStaticMeshActorSpawnable* >      PreviewMesh;                                      		// 0x0054 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              UpdateSelectTimer;                                		// 0x0060 (0x0004) [0x0000000000000000]              
	int                                                ActiveSlot;                                       		// 0x0064 (0x0004) [0x0000000000000000]              
	TArray< class ANowAtlasAvatarTerritoryStructure* > vTerritoryStructures;                             		// 0x0068 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< int >                                      vSlotIndex;                                       		// 0x0074 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	struct FString                                     sPlaceOnlyOnGuid;                                 		// 0x0080 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1525 ];

		return pClassPointer;
	};

	void RemoveViewmode ( );
	void UpdateSelected ( );
	void Tick ( float DeltaTime );
	bool FindTerritoryStructures ( );
	void AttachTo ( class AController* aController );
	int GetSlot ( );
	bool PressedUse ( );
	void GetItemData ( );
};

UClass* UClientViewModeTSNpcPlace::pClassPointer = NULL;

// Class NowGame.ClientViewModeTSUpgradeTier
// 0x002C (0x007C - 0x0050)
class UClientViewModeTSUpgradeTier : public UClientViewMode
{
public:
	class UStaticMesh*                                 GhostMesh;                                        		// 0x0050 (0x0004) [0x0000000000000000]              
	TArray< class ANowStaticMeshActorSpawnable* >      PreviewMesh;                                      		// 0x0054 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	float                                              UpdateSelectTimer;                                		// 0x0060 (0x0004) [0x0000000000000000]              
	int                                                ActiveSlot;                                       		// 0x0064 (0x0004) [0x0000000000000000]              
	unsigned long                                      bTierUpgrade : 1;                                 		// 0x0068 (0x0004) [0x0000000000000000] [0x00000001] 
	class UStaticMesh*                                 pUpgradeMesh;                                     		// 0x006C (0x0004) [0x0000000000000000]              
	struct FString                                     sTargetContentGuid;                               		// 0x0070 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1526 ];

		return pClassPointer;
	};

	void RemoveViewmode ( );
	void UpdateSelected ( );
	void Tick ( float DeltaTime );
	bool FindTerritoryStructures ( );
	void SetAllMaterials ( class ANowStaticMeshActorSpawnable* aStructure, class UMaterialInstanceConstant* NewMat );
	void AttachTo ( class AController* aController );
	int GetSlot ( );
	bool PressedUse ( );
	void IniteTSUpgradeTier ( );
};

UClass* UClientViewModeTSUpgradeTier::pClassPointer = NULL;

// Class NowGame.CombatSystemNew
// 0x0014 (0x0050 - 0x003C)
class UCombatSystemNew : public UObject
{
public:
	class ANowPlayerController*                        MyController;                                     		// 0x003C (0x0004) [0x0000000000000000]              
	class AWorldInfo*                                  MyWorldInfo;                                      		// 0x0040 (0x0004) [0x0000000000000000]              
	float                                              StartNewMoveTimer;                                		// 0x0044 (0x0004) [0x0000000000000000]              
	unsigned long                                      bDebugTraces : 1;                                 		// 0x0048 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bDebugInfo : 1;                                   		// 0x0048 (0x0004) [0x0000000000000000] [0x00000002] 
	class ANowPawn*                                    PawnOwner;                                        		// 0x004C (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1527 ];

		return pClassPointer;
	};

	class ANowPawn* eventGetNowPawn ( );
	void TickCombat ( float DeltaTime );
	float GetTimerCount ( struct FName inTimerFunc, class UObject* inObj );
	bool IsTimerActive ( struct FName inTimerFunc, class UObject* inObj );
	void ClearTimer ( struct FName inTimerFunc, class UObject* inObj );
	void SetTimer ( float InRate, unsigned long inbLoop, struct FName inTimerFunc, class UObject* inObj );
	int ReturnHitInfo ( class UPhysicsAsset* TestPhys, struct FName HitBone, class AActor* HitActor );
	int getHitPart ( class AActor* HitActor, struct FVector StartTrace, struct FVector EndTrace, struct FVector HitLoc, struct FTraceHitInfo* HitInfo );
	void AttachTo ( class AController* aController );
	void ClientHitFeedback ( unsigned long bStructure, unsigned long bBlocked );
	void DrawDebugInfo ( class UCanvas* C );
	void CancelCharge ( );
	void eventUpdateWeaponStats ( class APawn* MyPawn );
	void PlayerWasHit ( int lastBoneID );
	void eventSetIntParam ( int NewParam );
	void ChargeReady ( );
	void StopAltFire ( unsigned long bForce );
	void StartAltFire ( );
	void StopFire ( unsigned long TargetSelf );
	void StartFire ( );
	void ExitMode ( );
	void InitMode ( );
	void UseFireOnWeapon ( );
	void StartClientAnimations ( struct FString WhatAction, float AnimRate );
};

UClass* UCombatSystemNew::pClassPointer = NULL;

// Class NowGame.CombatSystemFishingNew
// 0x0078 (0x00C8 - 0x0050)
class UCombatSystemFishingNew : public UCombatSystemNew
{
public:
	float                                              MINCHARGETIME;                                    		// 0x0050 (0x0004) [0x0000000000000000]              
	float                                              MAXCHARGETIME;                                    		// 0x0054 (0x0004) [0x0000000000000000]              
	float                                              MINPULLTIMER;                                     		// 0x0058 (0x0004) [0x0000000000000000]              
	float                                              MAXJIGGLETIMER;                                   		// 0x005C (0x0004) [0x0000000000000000]              
	float                                              MAXTUGREPEAT;                                     		// 0x0060 (0x0004) [0x0000000000000000]              
	float                                              TUGRESULTTIMER;                                   		// 0x0064 (0x0004) [0x0000000000000000]              
	float                                              MINTHROWLENGTH;                                   		// 0x0068 (0x0004) [0x0000000000000000]              
	float                                              Timer;                                            		// 0x006C (0x0004) [0x0000000000000000]              
	float                                              TugTimer;                                         		// 0x0070 (0x0004) [0x0000000000000000]              
	float                                              TimerValue;                                       		// 0x0074 (0x0004) [0x0000000000000000]              
	unsigned char                                      eCurState;                                        		// 0x0078 (0x0001) [0x0000000000000000]              
	class ANowProjectileFishing*                       FishProjectile;                                   		// 0x007C (0x0004) [0x0000000000000000]              
	struct FVector                                     StartShot;                                        		// 0x0080 (0x000C) [0x0000000000000000]              
	struct FVector                                     EndShot;                                          		// 0x008C (0x000C) [0x0000000000000000]              
	struct FRotator                                    viewPointRotator;                                 		// 0x0098 (0x000C) [0x0000000000000000]              
	struct FVector                                     StartFishLocation;                                		// 0x00A4 (0x000C) [0x0000000000000000]              
	float                                              MaxThrow;                                         		// 0x00B0 (0x0004) [0x0000000000000000]              
	class AController*                                 C;                                                		// 0x00B4 (0x0004) [0x0000000000000000]              
	class UNewTugSession*                              m_TugSession;                                     		// 0x00B8 (0x0004) [0x0000000000000000]              
	class ANowPlayerController*                        m_NowPC;                                          		// 0x00BC (0x0004) [0x0000000000000000]              
	unsigned long                                      bPlayerPulls : 1;                                 		// 0x00C0 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bFishPulls : 1;                                   		// 0x00C0 (0x0004) [0x0000000000000000] [0x00000002] 
	float                                              dPlayerTime;                                      		// 0x00C4 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1528 ];

		return pClassPointer;
	};

	void ProjectileHitWater ( class AActor* WaterVolume, float Depth );
	void ProjectileHit ( class AActor* Target, struct FTraceHitInfo hitInfoTmp, struct FVector StartTrace, struct FVector EndTrace, struct FVector HitLocTmp );
	void ProjectileLanded ( struct FVector Loc, class AActor* Volume );
	void TellB ( unsigned char I, struct FString Value );
	void AbortFishing ( );
	void TickCombat ( float DeltaTime );
	void RemoveAllProjectiles ( );
	void Tug ( );
	void Throw ( );
	bool CheckMove ( );
	void eventPlayerFishEvent ( int iValue, float fValue );
	void eventPlayFishEffect ( int WhatEffect );
	void StopFire ( unsigned long TargetSelf );
	void StartFire ( );
	void ExitMode ( );
	void InitMode ( );
	void eventUpdateTugAnimations ( unsigned long PlayerPull, unsigned long FishPull );
	void AttachTo ( class AController* aController );
	void SwitchPlayerTugState ( unsigned long bState, float dTime );
	int GetBlockResult ( );
	struct FString GetSuccessValue ( );
	bool UpdateTugSession ( float DeltaTime );
	void InitTugwarGame ( );
};

UClass* UCombatSystemFishingNew::pClassPointer = NULL;

// Class NowGame.CombatSystemMagicNew
// 0x0010 (0x0060 - 0x0050)
class UCombatSystemMagicNew : public UCombatSystemNew
{
public:
	unsigned long                                      bReadyToFire : 1;                                 		// 0x0050 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bCharging : 1;                                    		// 0x0050 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bHoldingMouse : 1;                                		// 0x0050 (0x0004) [0x0000000000000000] [0x00000004] 
	class UParticleSystemComponent*                    MainEffectEmitter;                                		// 0x0054 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UNowSpellLight*                              SpellLight;                                       		// 0x0058 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	float                                              LastGCDTime;                                      		// 0x005C (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1529 ];

		return pClassPointer;
	};

	class AActor* TraceAndGetTarget ( float SpellRange );
	void CheckForFXEmitter ( );
	void StartChargeFX ( int SpellID );
	void StartNewChargeFX ( int SpellID, class UAnimNotify_PlayIndexedParticleEffect* AnimNotifyData );
	void spawnLateEffect ( );
	void StartReleaseFX ( int SpellID, unsigned long selfPwnage, struct FString SocketName, struct FString BoneName );
	void StopParticleFX ( int Index );
	void GetNewTraceEndStraight ( int Speed, struct FVector* EndShot, struct FVector* StartShot );
	class AActor* GetTarget ( );
	void CancelSpells ( );
	void SetMainEffectEmitter ( class UParticleSystem* PS );
	struct FVector traceLocation ( struct FString traceMethod, struct FVector TargetLoc );
	bool traceCharacter ( struct FString traceMethod, struct FVector TargetLoc, class AActor** HitActor );
	bool spellRelease ( int SpellID, struct FVector TargetLoc );
	void heldTooLong ( );
	void ChargeReady ( );
	bool SpellCharge ( int SpellID );
	bool checkActionAvailability ( int SpellID );
	void SpellAction ( int SpellID );
	bool CheckGCD ( unsigned long spellRelease );
	void AttachTo ( class AController* aController );
	void TickCombat ( float DeltaTime );
	void DrawDebugInfo ( class UCanvas* C );
};

UClass* UCombatSystemMagicNew::pClassPointer = NULL;

// Class NowGame.CombatSystemMeleeNew
// 0x00F4 (0x0144 - 0x0050)
class UCombatSystemMeleeNew : public UCombatSystemNew
{
public:
	class UParticleSystemComponent*                    TrailPSCRight;                                    		// 0x0050 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UParticleSystemComponent*                    TrailPSCLeft;                                     		// 0x0054 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	unsigned long                                      bBlocking : 1;                                    		// 0x0058 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      bBloodTrailOn : 1;                                		// 0x0058 (0x0004) [0x0000000000000000] [0x00000002] 
	unsigned long                                      bBloodTrailRight : 1;                             		// 0x0058 (0x0004) [0x0000000000000000] [0x00000004] 
	unsigned long                                      bBluntClientEffectRight : 1;                      		// 0x0058 (0x0004) [0x0000000000000000] [0x00000008] 
	unsigned long                                      bBluntClientEffectLeft : 1;                       		// 0x0058 (0x0004) [0x0000000000000000] [0x00000010] 
	unsigned long                                      bTraceFromLeftSocket : 1;                         		// 0x0058 (0x0004) [0x0000000000000000] [0x00000020] 
	unsigned long                                      bPendingRelease : 1;                              		// 0x0058 (0x0004) [0x0000000000000000] [0x00000040] 
